ksekimoto/llvm-project/llvm/lib/Target/RL78/Disassembler/RL78Disassembler.cpp
//===- RL78Disassembler.cpp - Disassembler for RL78 -----------*- C++ -*-===//
//
// Part of the LLVM Project, under the Apache License v2.0 with LLVM Exceptions.
// See https://llvm.org/LICENSE.txt for license information.
// SPDX-License-Identifier: Apache-2.0 WITH LLVM-exception
//
//===----------------------------------------------------------------------===//
//
// This file is part of the RL78 Disassembler.
//
//===----------------------------------------------------------------------===//

#include "RL78Subtarget.h"
#include "TargetInfo/RL78TargetInfo.h"
#include "llvm/MC/MCContext.h"
#include "llvm/MC/MCDisassembler/MCDisassembler.h"
#include "llvm/MC/MCFixedLenDisassembler.h"
#include "llvm/Object/ObjectFile.h"
#include "llvm/Support/TargetRegistry.h"

using namespace llvm;

#define DEBUG_TYPE "RL78-disassembler"

typedef MCDisassembler::DecodeStatus DecodeStatus;

namespace {

/// A disassembler class for RL78.
class RL78Disassembler : public MCDisassembler {
public:
  RL78Disassembler(const MCSubtargetInfo &STI, MCContext &Ctx)
      : MCDisassembler(STI, Ctx) {}
  virtual ~RL78Disassembler() {}

  DecodeStatus getInstruction(MCInst &Instr, uint64_t &Size,
                              ArrayRef<uint8_t> Bytes, uint64_t Address,
                              raw_ostream &CStream) const override;
};

class RL78Symbolizer : public MCSymbolizer {
private:
  void *DisInfo;

public:
  RL78Symbolizer(MCContext &Ctx, std::unique_ptr<MCRelocationInfo> &&RelInfo,
                 void *disInfo)
      : MCSymbolizer(Ctx, std::move(RelInfo)), DisInfo(disInfo) {}

  bool tryAddingSymbolicOperand(MCInst &Inst, raw_ostream &cStream,
                                int64_t Value, uint64_t Address, bool IsBranch,
                                uint64_t Offset, uint64_t InstSize) override;

  void tryAddingPcLoadReferenceComment(raw_ostream &cStream, int64_t Value,
                                       uint64_t Address) override;
};

} // end anonymous namespace

static MCSymbolizer *
createRL78Symbolizer(const Triple & /*TT*/, LLVMOpInfoCallback /*GetOpInfo*/,
                     LLVMSymbolLookupCallback /*SymbolLookUp*/, void *DisInfo,
                     MCContext *Ctx,
                     std::unique_ptr<MCRelocationInfo> &&RelInfo) {
  return new RL78Symbolizer(*Ctx, std::move(RelInfo), DisInfo);
}

static MCDisassembler *createRL78Disassembler(const Target &T,
                                              const MCSubtargetInfo &STI,
                                              MCContext &Ctx) {
  return new RL78Disassembler(STI, Ctx);
}

extern "C" LLVM_EXTERNAL_VISIBILITY void LLVMInitializeRL78Disassembler() {
  // Register the disassembler.
  TargetRegistry::RegisterMCDisassembler(getTheRL78Target(),
                                         createRL78Disassembler);
  TargetRegistry::RegisterMCSymbolizer(getTheRL78Target(),
                                       createRL78Symbolizer);
}

#include "RL78GenDisassemblerTables.inc"

namespace llvm {

extern const MCInstrDesc RL78Insts[];

} // end namespace llvm

struct SBP {
  static const unsigned int adr = 0x101;
  static const unsigned int adrh = 0x102;
  static const unsigned int adrl = 0x103;
  static const unsigned int adrs = 0x104;
  static const unsigned int data = 0x105;
  static const unsigned int datah = 0x106;
  static const unsigned int datal = 0x107;
  static const unsigned int saddr = 0x108;
  static const unsigned int sfr = 0x109;
};

struct OPT {
  static const unsigned int ES_I_addr16 = 0x101;
  static const unsigned int ES_memDE = 0x102;
  static const unsigned int ES_memDE_byte = 0x103;
  static const unsigned int ES_memHL = 0x104;
  static const unsigned int ES_memHL0 = 0x105;
  static const unsigned int ES_memHL_B = 0x106;
  static const unsigned int ES_memHL_C = 0x107;
  static const unsigned int ES_memHL_byte = 0x108;
  static const unsigned int ES_word_memB = 0x109;
  static const unsigned int ES_word_memBC = 0x10A;
  static const unsigned int ES_word_memC = 0x10B;
  static const unsigned int II_addr20 = 0x10C;
  static const unsigned int I_addr16 = 0x10D;
  static const unsigned int RB0 = 0x10E;
  static const unsigned int RB1 = 0x10F;
  static const unsigned int RB2 = 0x110;
  static const unsigned int RB3 = 0x111;
  static const unsigned int SI_addr20 = 0x112;
  static const unsigned int S_addr20 = 0x113;
  static const unsigned int byte = 0x114;
  static const unsigned int imm0 = 0x115;
  static const unsigned int imm1 = 0x116;
  static const unsigned int imm10 = 0x117;
  static const unsigned int imm11 = 0x118;
  static const unsigned int imm12 = 0x119;
  static const unsigned int imm13 = 0x11A;
  static const unsigned int imm14 = 0x11B;
  static const unsigned int imm15 = 0x11C;
  static const unsigned int imm2 = 0x11D;
  static const unsigned int imm3 = 0x11E;
  static const unsigned int imm4 = 0x11F;
  static const unsigned int imm5 = 0x120;
  static const unsigned int imm6 = 0x121;
  static const unsigned int imm7 = 0x122;
  static const unsigned int imm8 = 0x123;
  static const unsigned int imm9 = 0x124;
  static const unsigned int memDE = 0x125;
  static const unsigned int memDE_byte = 0x126;
  static const unsigned int memHL = 0x127;
  static const unsigned int memHL0 = 0x128;
  static const unsigned int memHL_B = 0x129;
  static const unsigned int memHL_C = 0x12A;
  static const unsigned int memHL_byte = 0x12B;
  static const unsigned int memSP_byte = 0x12C;
  static const unsigned int mem_addr5 = 0x12D;
  static const unsigned int saddr = 0x12E;
  static const unsigned int saddrp = 0x12F;
  static const unsigned int sfr = 0x130;
  static const unsigned int sfrp = 0x131;
  static const unsigned int word = 0x132;
  static const unsigned int word_memB = 0x133;
  static const unsigned int word_memBC = 0x134;
  static const unsigned int word_memC = 0x135;
  static const unsigned int RL78CC_C = 0x200 + RL78CC::RL78CC_C;
  static const unsigned int RL78CC_NC = 0x200 + RL78CC::RL78CC_NC;
  static const unsigned int RL78CC_Z = 0x200 + RL78CC::RL78CC_Z;
  static const unsigned int RL78CC_NZ = 0x200 + RL78CC::RL78CC_NZ;
  static const unsigned int RL78CC_H = 0x200 + RL78CC::RL78CC_H;
  static const unsigned int RL78CC_NH = 0x200 + RL78CC::RL78CC_NH;
};

static std::map<unsigned char, unsigned int> saddrLookup = {
    {0xF8, RL78::R0},  {0xF9, RL78::R1},  {0xFA, RL78::R2},  {0xFB, RL78::R3},
    {0xFC, RL78::R4},  {0xFD, RL78::R5},  {0xFE, RL78::R6},  {0xFF, RL78::R7}};

static std::map<unsigned char, unsigned int> saddrpLookup = {
    {0xF8, RL78::RP0},  {0xFA, RL78::RP2},  {0xFC, RL78::RP4},
    {0xFE, RL78::RP6}};

struct InstructionInfo {
  int OpCode;
  std::vector<unsigned int> BitParts;
  std::vector<unsigned int> Operands;
};

