ksekimoto/llvm-project/llvm/lib/Target/RL78/Disassembler/RL78Disassembler.cpp
// static std::multimap<char, InstructionInfo> instructions =
static std::multimap<unsigned int, InstructionInfo> instructionsS3 = {
    // DIVHU
    {0xCEU, {RL78::DIVHU, {0xFBU, 0x3U}, {}}},
    // DIVWU
    {0xCEU, {RL78::DIVWU, {0xFBU, 0x0BU}, {}}},
    // MACH
    {0xCEU, {RL78::MACH, {0xFBU, 0x6U}, {}}},
    // MACHU
    {0xCEU, {RL78::MACHU, {0xFBU, 0x5U}, {}}},
    // MULH
    {0xCEU, {RL78::MULH, {0xFBU, 0x2U}, {}}},
    // MULHU
    {0xCEU, {RL78::MULHU, {0xFBU, 0x1U}, {}}}};
// static std::multimap<char, InstructionInfo> instructions =
static std::multimap<unsigned int, InstructionInfo> instructions = {
    // clang-format off
    // ADD A,!addr16
    {0x0FU, {RL78::ADD_r_abs16, {SBP::adrl, SBP::adrh}, {RL78::R1, RL78::R1, OPT::I_addr16}}},
    // ADD saddr,#byte
    {0x0AU, {RL78::ADD_saddr_imm, {SBP::saddr, SBP::data}, {OPT::saddr, OPT::byte}}},
    // ADD A,#byte
    {0x0CU, {RL78::ADD_r_imm, {SBP::data}, {RL78::R1, RL78::R1, OPT::byte}}},
    // ADD A,[HL]
    {0x0DU, {RL78::ADD_r_memri, {}, {RL78::R1, RL78::R1, OPT::memHL0}}},
    // ADD A,[HL+byte]
    {0x0EU, {RL78::ADD_r_memri, {SBP::adr}, {RL78::R1, RL78::R1, OPT::memHL_byte}}},
    // ADD A,[HL+B]
    {0x61U, {RL78::ADD_r_memrr, {0x80U}, {RL78::R1, RL78::R1, OPT::memHL_B}}},
    // ADD A,[HL+C]
    {0x61U, {RL78::ADD_r_memrr, {0x82U}, {RL78::R1, RL78::R1, OPT::memHL_C}}},
    // ADD A,A
    {0x61U, {RL78::ADD_r_r, {0x1U}, {RL78::R1, RL78::R1, RL78::R1}}},
    // ADD A,B
    {0x61U, {RL78::ADD_r_r, {0x0BU}, {RL78::R1, RL78::R1, RL78::R3}}},
    // ADD A,C
    {0x61U, {RL78::ADD_r_r, {0x0AU}, {RL78::R1, RL78::R1, RL78::R2}}},
    // ADD A,D
    {0x61U, {RL78::ADD_r_r, {0x0DU}, {RL78::R1, RL78::R1, RL78::R5}}},
    // ADD A,E
    {0x61U, {RL78::ADD_r_r, {0x0CU}, {RL78::R1, RL78::R1, RL78::R4}}},
    // ADD A,H
    {0x61U, {RL78::ADD_r_r, {0x0FU}, {RL78::R1, RL78::R1, RL78::R7}}},
    // ADD A,L
    {0x61U, {RL78::ADD_r_r, {0x0EU}, {RL78::R1, RL78::R1, RL78::R6}}},
    // ADD A,X
    {0x61U, {RL78::ADD_r_r, {0x8U}, {RL78::R1, RL78::R1, RL78::R0}}},
    // ADD B,A
    {0x61U, {RL78::ADD_r_r, {0x3U}, {RL78::R3, RL78::R3, RL78::R1}}},
    // ADD C,A
    {0x61U, {RL78::ADD_r_r, {0x2U}, {RL78::R2, RL78::R2, RL78::R1}}},
    // ADD D,A
    {0x61U, {RL78::ADD_r_r, {0x5U}, {RL78::R5, RL78::R5, RL78::R1}}},
    // ADD E,A
    {0x61U, {RL78::ADD_r_r, {0x4U}, {RL78::R4, RL78::R4, RL78::R1}}},
    // ADD H,A
    {0x61U, {RL78::ADD_r_r, {0x7U}, {RL78::R7, RL78::R7, RL78::R1}}},
    // ADD L,A
    {0x61U, {RL78::ADD_r_r, {0x6U}, {RL78::R6, RL78::R6, RL78::R1}}},
    // ADD X,A
    {0x61U, {RL78::ADD_r_r, {0x0U}, {RL78::R0, RL78::R0, RL78::R1}}},
    // ADD A,saddr
    {0x0BU, {RL78::ADD_r_saddr, {SBP::saddr}, {RL78::R1, RL78::R1, OPT::saddr}}},
    // ADD A,ES:!addr16
    {0x11U, {RL78::ADD_r_esaddr16, {0x0FU, SBP::adrl, SBP::adrh}, {RL78::R1,RL78::R1,OPT::ES_I_addr16}}},
    // ADD A,ES:[HL]
    {0x11U, {RL78::ADD_r_esmemHL, {0x0DU}, {RL78::R1,RL78::R1,OPT::ES_memHL0}}},
    // ADD A,ES:[HL+B]
    {0x11U, {RL78::ADD_r_esmemRpr, {0x61U, 0x80U}, {RL78::R1,RL78::R1,OPT::ES_memHL_B}}},
    // ADD A,ES:[HL+byte]
    {0x11U, {RL78::ADD_r_esmemHLi, {0x0EU, SBP::adr}, {RL78::R1,RL78::R1,OPT::ES_memHL_byte}}},
    // ADD A,ES:[HL+C]
    {0x11U, {RL78::ADD_r_esmemRpr, {0x61U, 0x82U}, {RL78::R1,RL78::R1,OPT::ES_memHL_C}}},
    // ADDC A,!addr16
    {0x1FU, {RL78::ADDC_r_abs16, {SBP::adrl, SBP::adrh}, {RL78::R1, RL78::R1, OPT::I_addr16}}},
    // ADDC saddr,#byte
    {0x1AU, {RL78::ADDC_saddrabs_imm, {SBP::saddr, SBP::data}, {OPT::saddr, OPT::byte}}},
    // ADDC A,#byte
    {0x1CU, {RL78::ADDC_A_imm, {SBP::data}, {RL78::R1, RL78::R1, OPT::byte}}},
    // ADDC A,[HL]
    {0x1DU, {RL78::ADDC_r_memri, {}, {RL78::R1, RL78::R1, OPT::memHL0}}},
    // ADDC A,[HL+byte]
    {0x1EU, {RL78::ADDC_r_memri, {SBP::adr}, {RL78::R1, RL78::R1, OPT::memHL_byte}}},
    // ADDC A,[HL+B]
    {0x61U, {RL78::ADDC_r_memrr, {0x90U}, {RL78::R1, RL78::R1, OPT::memHL_B}}},
    // ADDC A,[HL+C]
    {0x61U, {RL78::ADDC_r_memrr, {0x92U}, {RL78::R1, RL78::R1, OPT::memHL_C}}},
    // ADDC A,A
    {0x61U, {RL78::ADDC_r_r, {0x11U}, {RL78::R1, RL78::R1, RL78::R1}}},
    // ADDC A,B
    {0x61U, {RL78::ADDC_r_r, {0x1BU}, {RL78::R1, RL78::R1, RL78::R3}}},
    // ADDC A,C
    {0x61U, {RL78::ADDC_r_r, {0x1AU}, {RL78::R1, RL78::R1, RL78::R2}}},
    // ADDC A,D
    {0x61U, {RL78::ADDC_r_r, {0x1DU}, {RL78::R1, RL78::R1, RL78::R5}}},
    // ADDC A,E
    {0x61U, {RL78::ADDC_r_r, {0x1CU}, {RL78::R1, RL78::R1, RL78::R4}}},
    // ADDC A,H
    {0x61U, {RL78::ADDC_r_r, {0x1FU}, {RL78::R1, RL78::R1, RL78::R7}}},
    // ADDC A,L
    {0x61U, {RL78::ADDC_r_r, {0x1EU}, {RL78::R1, RL78::R1, RL78::R6}}},
    // ADDC A,X
    {0x61U, {RL78::ADDC_r_r, {0x18U}, {RL78::R1, RL78::R1, RL78::R0}}},
    // ADDC B,A
    {0x61U, {RL78::ADDC_r_r, {0x13U}, {RL78::R3, RL78::R3, RL78::R1}}},
    // ADDC C,A
    {0x61U, {RL78::ADDC_r_r, {0x12U}, {RL78::R2, RL78::R2, RL78::R1}}},
    // ADDC D,A
    {0x61U, {RL78::ADDC_r_r, {0x15U}, {RL78::R5, RL78::R5, RL78::R1}}},
    // ADDC E,A
    {0x61U, {RL78::ADDC_r_r, {0x14U}, {RL78::R4, RL78::R4, RL78::R1}}},
    // ADDC H,A
    {0x61U, {RL78::ADDC_r_r, {0x17U}, {RL78::R7, RL78::R7, RL78::R1}}},
    // ADDC L,A
    {0x61U, {RL78::ADDC_r_r, {0x16U}, {RL78::R6, RL78::R6, RL78::R1}}},
    // ADDC X,A
    {0x61U, {RL78::ADDC_r_r, {0x10U}, {RL78::R0, RL78::R0, RL78::R1}}},
    // ADDC A,saddr
    {0x1BU, {RL78::ADDC_r_saddrabs, {SBP::saddr}, {RL78::R1, RL78::R1, OPT::saddr}}},
    // ADDC A,ES:!addr16
    {0x11U, {RL78::ADDC_r_esaddr16, {0x1FU, SBP::adrl, SBP::adrh}, {RL78::R1,RL78::R1,OPT::ES_I_addr16}}},
    // ADDC A,ES:[HL]
    {0x11U, {RL78::ADDC_r_esmemHL, {0x1DU}, {RL78::R1,RL78::R1,OPT::ES_memHL0}}},
    // ADDC A,ES:[HL+B]
    {0x11U, {RL78::ADDC_r_esmemRpr, {0x61U, 0x90U}, {RL78::R1,RL78::R1,OPT::ES_memHL_B}}},
    // ADDC A,ES:[HL+byte]
    {0x11U, {RL78::ADDC_r_esmemHLi, {0x1EU, SBP::adr}, {RL78::R1,RL78::R1,OPT::ES_memHL_byte}}},
    // ADDC A,ES:[HL+C]
    {0x11U, {RL78::ADDC_r_esmemRpr, {0x61U, 0x92U}, {RL78::R1,RL78::R1,OPT::ES_memHL_C}}},
    // ADDW AX,#word
    {0x4U, {RL78::ADDW_rp_imm, {SBP::datal, SBP::datah}, {RL78::RP0, RL78::RP0, OPT::word}}},
    // ADDW AX,!addr16
    {0x2U, {RL78::ADDW_rp_abs16, {SBP::adrl, SBP::adrh}, {RL78::RP0, RL78::RP0, OPT::I_addr16}}},
    // ADDW AX,[HL+byte]
    {0x61U, {RL78::ADDW_rp_memri, {0x9U, SBP::adr}, {RL78::RP0, RL78::RP0, OPT::memHL_byte}}},
    // ADDW AX,AX
    {0x1U, {RL78::ADDW_rp_rp, {}, {RL78::RP0, RL78::RP0, RL78::RP0}}},
    // ADDW AX,BC
    {0x3U, {RL78::ADDW_rp_rp, {}, {RL78::RP0, RL78::RP0, RL78::RP2}}},
    // ADDW AX,DE
    {0x5U, {RL78::ADDW_rp_rp, {}, {RL78::RP0, RL78::RP0, RL78::RP4}}},
    // ADDW AX,saddrp
    {0x6U, {RL78::ADDW_rp_saddr, {SBP::saddr}, {RL78::RP0, RL78::RP0, OPT::saddrp}}},
    // ADDW AX,HL
    {0x7U, {RL78::ADDW_rp_rp, {}, {RL78::RP0, RL78::RP0, RL78::RP6}}},
    // ADDW SP,#byte
    {0x10U, {RL78::ADDW_sp_imm, {SBP::data}, {RL78::SPreg, RL78::SPreg, OPT::byte}}},
    // ADDW AX,ES:!addr16
    {0x11U, {RL78::ADDW_rp_esaddr16, {0x2U, SBP::adrl, SBP::adrh}, {RL78::RP0,RL78::RP0,OPT::ES_I_addr16}}},
    // ADDW AX,ES:[HL+byte]
    {0x11U, {RL78::ADDW_rp_esmemHLi, {0x61U, 0x9U, SBP::adr}, {RL78::RP0,RL78::RP0,OPT::ES_memHL_byte}}},
    // AND A,!addr16
    {0x5FU, {RL78::AND_r_abs16, {SBP::adrl, SBP::adrh}, {RL78::R1, RL78::R1, OPT::I_addr16}}},
    // AND saddr,#byte
    {0x5AU, {RL78::AND_saddr_imm, {SBP::saddr, SBP::data}, {OPT::saddr, OPT::byte}}},
    // AND A,#byte
    {0x5CU, {RL78::AND_r_imm, {SBP::data}, {RL78::R1, RL78::R1, OPT::byte}}},
    // AND A,[HL]
    {0x5DU, {RL78::AND_r_memri, {}, {RL78::R1, RL78::R1, OPT::memHL0}}},
    // AND A,[HL+byte]
    {0x5EU, {RL78::AND_r_memri, {SBP::adr}, {RL78::R1, RL78::R1, OPT::memHL_byte}}},
    // AND A,[HL+B]
    {0x61U, {RL78::AND_r_memrr, {0xD0U}, {RL78::R1, RL78::R1, OPT::memHL_B}}},
    // AND A,[HL+C]
    {0x61U, {RL78::AND_r_memrr, {0xD2U}, {RL78::R1, RL78::R1, OPT::memHL_C}}},
    // AND A,A
    {0x61U, {RL78::AND_r_r, {0x51U}, {RL78::R1, RL78::R1, RL78::R1}}},
    // AND A,B
    {0x61U, {RL78::AND_r_r, {0x5BU}, {RL78::R1, RL78::R1, RL78::R3}}},
    // AND A,C
    {0x61U, {RL78::AND_r_r, {0x5AU}, {RL78::R1, RL78::R1, RL78::R2}}},
    // AND A,D
    {0x61U, {RL78::AND_r_r, {0x5DU}, {RL78::R1, RL78::R1, RL78::R5}}},
    // AND A,E
    {0x61U, {RL78::AND_r_r, {0x5CU}, {RL78::R1, RL78::R1, RL78::R4}}},
    // AND A,H
    {0x61U, {RL78::AND_r_r, {0x5FU}, {RL78::R1, RL78::R1, RL78::R7}}},
    // AND A,L
    {0x61U, {RL78::AND_r_r, {0x5EU}, {RL78::R1, RL78::R1, RL78::R6}}},
    // AND A,X
    {0x61U, {RL78::AND_r_r, {0x58U}, {RL78::R1, RL78::R1, RL78::R0}}},
    // AND B,A
    {0x61U, {RL78::AND_r_r, {0x53U}, {RL78::R3, RL78::R3, RL78::R1}}},
    // AND C,A
    {0x61U, {RL78::AND_r_r, {0x52U}, {RL78::R2, RL78::R2, RL78::R1}}},
    // AND D,A
    {0x61U, {RL78::AND_r_r, {0x55U}, {RL78::R5, RL78::R5, RL78::R1}}},
    // AND E,A
    {0x61U, {RL78::AND_r_r, {0x54U}, {RL78::R4, RL78::R4, RL78::R1}}},
    // AND H,A
    {0x61U, {RL78::AND_r_r, {0x57U}, {RL78::R7, RL78::R7, RL78::R1}}},
    // AND L,A
    {0x61U, {RL78::AND_r_r, {0x56U}, {RL78::R6, RL78::R6, RL78::R1}}},
    // AND X,A
    {0x61U, {RL78::AND_r_r, {0x50U}, {RL78::R0, RL78::R0, RL78::R1}}},
    // AND A,saddr
    {0x5BU, {RL78::AND_r_saddr, {SBP::saddr}, {RL78::R1, RL78::R1, OPT::saddr}}},
    // AND A,ES:!addr16
    {0x11U, {RL78::AND_r_esaddr16, {0x5FU, SBP::adrl, SBP::adrh}, {RL78::R1,RL78::R1,OPT::ES_I_addr16}}},
    // AND A,ES:[HL]
    {0x11U, {RL78::AND_r_esmemHL, {0x5DU}, {RL78::R1,RL78::R1,OPT::ES_memHL0}}},
    // AND A,ES:[HL+B]
    {0x11U, {RL78::AND_r_esmemRpr, {0x61U, 0xD0U}, {RL78::R1,RL78::R1,OPT::ES_memHL_B}}},
    // AND A,ES:[HL+byte]
    {0x11U, {RL78::AND_r_esmemHLi, {0x5EU, SBP::adr}, {RL78::R1,RL78::R1,OPT::ES_memHL_byte}}},
    // AND A,ES:[HL+C]
    {0x11U, {RL78::AND_r_esmemRpr, {0x61U, 0xD2U}, {RL78::R1,RL78::R1,OPT::ES_memHL_C}}},
    // AND1 CY,[HL].0
    {0x71U, {RL78::AND1_cy_memr, {0x85U}, {OPT::memHL, OPT::imm0}}},
    // AND1 CY,[HL].1
    {0x71U, {RL78::AND1_cy_memr, {0x95U}, {OPT::memHL, OPT::imm1}}},
    // AND1 CY,[HL].2
    {0x71U, {RL78::AND1_cy_memr, {0xA5U}, {OPT::memHL, OPT::imm2}}},
    // AND1 CY,[HL].3
    {0x71U, {RL78::AND1_cy_memr, {0xB5U}, {OPT::memHL, OPT::imm3}}},
    // AND1 CY,[HL].4
    {0x71U, {RL78::AND1_cy_memr, {0xC5U}, {OPT::memHL, OPT::imm4}}},
    // AND1 CY,[HL].5
    {0x71U, {RL78::AND1_cy_memr, {0xD5U}, {OPT::memHL, OPT::imm5}}},
    // AND1 CY,[HL].6
    {0x71U, {RL78::AND1_cy_memr, {0xE5U}, {OPT::memHL, OPT::imm6}}},
    // AND1 CY,[HL].7
    {0x71U, {RL78::AND1_cy_memr, {0xF5U}, {OPT::memHL, OPT::imm7}}},
    // AND1 CY,A.0
    {0x71U, {RL78::AND1_cy_r, {0x8DU}, {RL78::R1, OPT::imm0}}},
    // AND1 CY,A.1
    {0x71U, {RL78::AND1_cy_r, {0x9DU}, {RL78::R1, OPT::imm1}}},
    // AND1 CY,A.2
    {0x71U, {RL78::AND1_cy_r, {0xADU}, {RL78::R1, OPT::imm2}}},
    // AND1 CY,A.3
    {0x71U, {RL78::AND1_cy_r, {0xBDU}, {RL78::R1, OPT::imm3}}},
    // AND1 CY,A.4
    {0x71U, {RL78::AND1_cy_r, {0xCDU}, {RL78::R1, OPT::imm4}}},
    // AND1 CY,A.5
    {0x71U, {RL78::AND1_cy_r, {0xDDU}, {RL78::R1, OPT::imm5}}},
    // AND1 CY,A.6
    {0x71U, {RL78::AND1_cy_r, {0xEDU}, {RL78::R1, OPT::imm6}}},
    // AND1 CY,A.7
    {0x71U, {RL78::AND1_cy_r, {0xFDU}, {RL78::R1, OPT::imm7}}},
    // AND1 CY,saddr.0
    {0x71U, {RL78::AND1_cy_saddrx, {0x5U, SBP::saddr}, {OPT::saddr, OPT::imm0}}},
    // AND1 CY,saddr.1
    {0x71U, {RL78::AND1_cy_saddrx, {0x15U, SBP::saddr}, {OPT::saddr, OPT::imm1}}},
    // AND1 CY,saddr.2
    {0x71U, {RL78::AND1_cy_saddrx, {0x25U, SBP::saddr}, {OPT::saddr, OPT::imm2}}},
    // AND1 CY,saddr.3
    {0x71U, {RL78::AND1_cy_saddrx, {0x35U, SBP::saddr}, {OPT::saddr, OPT::imm3}}},
    // AND1 CY,saddr.4
    {0x71U, {RL78::AND1_cy_saddrx, {0x45U, SBP::saddr}, {OPT::saddr, OPT::imm4}}},
    // AND1 CY,saddr.5
    {0x71U, {RL78::AND1_cy_saddrx, {0x55U, SBP::saddr}, {OPT::saddr, OPT::imm5}}},
    // AND1 CY,saddr.6
    {0x71U, {RL78::AND1_cy_saddrx, {0x65U, SBP::saddr}, {OPT::saddr, OPT::imm6}}},
    // AND1 CY,saddr.7
    {0x71U, {RL78::AND1_cy_saddrx, {0x75U, SBP::saddr}, {OPT::saddr, OPT::imm7}}},
    // AND1 CY,ES:[HL].0
    {0x11U, {RL78::AND1_esmemr, {0x71U, 0x85U}, {RL78::CY, OPT::ES_memHL,OPT::imm0}}},
    // AND1 CY,ES:[HL].1
    {0x11U, {RL78::AND1_esmemr, {0x71U, 0x95U}, {RL78::CY, OPT::ES_memHL,OPT::imm1}}},
    // AND1 CY,ES:[HL].2
    {0x11U, {RL78::AND1_esmemr, {0x71U, 0xA5U}, {RL78::CY, OPT::ES_memHL,OPT::imm2}}},
    // AND1 CY,ES:[HL].3
    {0x11U, {RL78::AND1_esmemr, {0x71U, 0xB5U}, {RL78::CY, OPT::ES_memHL,OPT::imm3}}},
    // AND1 CY,ES:[HL].4
    {0x11U, {RL78::AND1_esmemr, {0x71U, 0xC5U}, {RL78::CY, OPT::ES_memHL,OPT::imm4}}},
    // AND1 CY,ES:[HL].5
    {0x11U, {RL78::AND1_esmemr, {0x71U, 0xD5U}, {RL78::CY, OPT::ES_memHL,OPT::imm5}}},
    // AND1 CY,ES:[HL].6
    {0x11U, {RL78::AND1_esmemr, {0x71U, 0xE5U}, {RL78::CY, OPT::ES_memHL,OPT::imm6}}},
    // AND1 CY,ES:[HL].7
    {0x11U, {RL78::AND1_esmemr, {0x71U, 0xF5U}, {RL78::CY, OPT::ES_memHL,OPT::imm7}}},
    // AND1 CY,PSW.0
    {0x71U, {RL78::AND1_cy_PSW, {0x0DU, 0xFAU}, {RL78::PSW, OPT::imm0}}},
    // AND1 CY,PSW.1
    {0x71U, {RL78::AND1_cy_PSW, {0x1DU, 0xFAU}, {RL78::PSW, OPT::imm1}}},
    // AND1 CY,PSW.2
    {0x71U, {RL78::AND1_cy_PSW, {0x2DU, 0xFAU}, {RL78::PSW, OPT::imm2}}},
    // AND1 CY,PSW.3
    {0x71U, {RL78::AND1_cy_PSW, {0x3DU, 0xFAU}, {RL78::PSW, OPT::imm3}}},
    // AND1 CY,PSW.4
    {0x71U, {RL78::AND1_cy_PSW, {0x4DU, 0xFAU}, {RL78::PSW, OPT::imm4}}},
    // AND1 CY,PSW.5
    {0x71U, {RL78::AND1_cy_PSW, {0x5DU, 0xFAU}, {RL78::PSW, OPT::imm5}}},
    // AND1 CY,PSW.6
    {0x71U, {RL78::AND1_cy_PSW, {0x6DU, 0xFAU}, {RL78::PSW, OPT::imm6}}},
    // AND1 CY,PSW.7
    {0x71U, {RL78::AND1_cy_PSW, {0x7DU, 0xFAU}, {RL78::PSW, OPT::imm7}}},
    // AND1 CY,sfr.0
    {0x71U, {RL78::AND1_cy_sfr, {0x0DU, SBP::sfr}, {OPT::sfr,OPT::imm0}}},
    // AND1 CY,sfr.1
    {0x71U, {RL78::AND1_cy_sfr, {0x1DU, SBP::sfr}, {OPT::sfr,OPT::imm1}}},
    // AND1 CY,sfr.2
    {0x71U, {RL78::AND1_cy_sfr, {0x2DU, SBP::sfr}, {OPT::sfr,OPT::imm2}}},
    // AND1 CY,sfr.3
    {0x71U, {RL78::AND1_cy_sfr, {0x3DU, SBP::sfr}, {OPT::sfr,OPT::imm3}}},
    // AND1 CY,sfr.4
    {0x71U, {RL78::AND1_cy_sfr, {0x4DU, SBP::sfr}, {OPT::sfr,OPT::imm4}}},
    // AND1 CY,sfr.5
    {0x71U, {RL78::AND1_cy_sfr, {0x5DU, SBP::sfr}, {OPT::sfr,OPT::imm5}}},
    // AND1 CY,sfr.6
    {0x71U, {RL78::AND1_cy_sfr, {0x6DU, SBP::sfr}, {OPT::sfr,OPT::imm6}}},
    // AND1 CY,sfr.7
    {0x71U, {RL78::AND1_cy_sfr, {0x7DU, SBP::sfr}, {OPT::sfr,OPT::imm7}}},
    // BC $addr20
    {0xDCU, {RL78::B_cc, {SBP::adr}, {OPT::S_addr20, OPT::RL78CC_C}}},
    // BF [HL].0,$addr20
    {0x31U, {RL78::BTBF_memr, {0x85U, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_NZ, OPT::memHL, OPT::imm0}}},
    // BF [HL].1,$addr20
    {0x31U, {RL78::BTBF_memr, {0x95U, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_NZ, OPT::memHL, OPT::imm1}}},
    // BF [HL].2,$addr20
    {0x31U, {RL78::BTBF_memr, {0xA5U, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_NZ, OPT::memHL, OPT::imm2}}},
    // BF [HL].3,$addr20
    {0x31U, {RL78::BTBF_memr, {0xB5U, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_NZ, OPT::memHL, OPT::imm3}}},
    // BF [HL].4,$addr20
    {0x31U, {RL78::BTBF_memr, {0xC5U, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_NZ, OPT::memHL, OPT::imm4}}},
    // BF [HL].5,$addr20
    {0x31U, {RL78::BTBF_memr, {0xD5U, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_NZ, OPT::memHL, OPT::imm5}}},
    // BF [HL].6,$addr20
    {0x31U, {RL78::BTBF_memr, {0xE5U, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_NZ, OPT::memHL, OPT::imm6}}},
    // BF [HL].7,$addr20
    {0x31U, {RL78::BTBF_memr, {0xF5U, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_NZ, OPT::memHL, OPT::imm7}}},
    // BF A.0,$addr20
    {0x31U, {RL78::BTBF_A, {0x5U, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_NZ, RL78::R1, OPT::imm0}}},
    // BF A.1,$addr20
    {0x31U, {RL78::BTBF_A, {0x15U, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_NZ, RL78::R1, OPT::imm1}}},
    // BF A.2,$addr20
    {0x31U, {RL78::BTBF_A, {0x25U, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_NZ, RL78::R1, OPT::imm2}}},
    // BF A.3,$addr20
    {0x31U, {RL78::BTBF_A, {0x35U, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_NZ, RL78::R1, OPT::imm3}}},
    // BF A.4,$addr20
    {0x31U, {RL78::BTBF_A, {0x45U, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_NZ, RL78::R1, OPT::imm4}}},
    // BF A.5,$addr20
    {0x31U, {RL78::BTBF_A, {0x55U, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_NZ, RL78::R1, OPT::imm5}}},
    // BF A.6,$addr20
    {0x31U, {RL78::BTBF_A, {0x65U, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_NZ, RL78::R1, OPT::imm6}}},
    // BF A.7,$addr20
    {0x31U, {RL78::BTBF_A, {0x75U, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_NZ, RL78::R1, OPT::imm7}}},
    // BF saddr.0,$addr20
    {0x31U, {RL78::BTBF_saddr, {0x4U, SBP::saddr, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_NZ, OPT::saddr, OPT::imm0}}},
    // BF saddr.1,$addr20
    {0x31U, {RL78::BTBF_saddr, {0x14U, SBP::saddr, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_NZ, OPT::saddr, OPT::imm1}}},
    // BF saddr.2,$addr20
    {0x31U, {RL78::BTBF_saddr, {0x24U, SBP::saddr, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_NZ, OPT::saddr, OPT::imm2}}},
    // BF saddr.3,$addr20
    {0x31U, {RL78::BTBF_saddr, {0x34U, SBP::saddr, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_NZ, OPT::saddr, OPT::imm3}}},
    // BF saddr.4,$addr20
    {0x31U, {RL78::BTBF_saddr, {0x44U, SBP::saddr, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_NZ, OPT::saddr, OPT::imm4}}},
    // BF saddr.5,$addr20
    {0x31U, {RL78::BTBF_saddr, {0x54U, SBP::saddr, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_NZ, OPT::saddr, OPT::imm5}}},
    // BF saddr.6,$addr20
    {0x31U, {RL78::BTBF_saddr, {0x64U, SBP::saddr, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_NZ, OPT::saddr, OPT::imm6}}},
    // BF saddr.7,$addr20
    {0x31U, {RL78::BTBF_saddr, {0x74U, SBP::saddr, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_NZ, OPT::saddr, OPT::imm7}}},
    // BF ES:[HL].0,$addr20
    {0x11U, {RL78::BTBF_esmemr, {0x31U, 0x85U, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_NZ, OPT::ES_memHL, OPT::imm0}}},
    // BF ES:[HL].1,$addr20
    {0x11U, {RL78::BTBF_esmemr, {0x31U, 0x95U, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_NZ, OPT::ES_memHL, OPT::imm1}}},
    // BF ES:[HL].2,$addr20
    {0x11U, {RL78::BTBF_esmemr, {0x31U, 0xA5U, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_NZ, OPT::ES_memHL, OPT::imm2}}},
    // BF ES:[HL].3,$addr20
    {0x11U, {RL78::BTBF_esmemr, {0x31U, 0xB5U, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_NZ, OPT::ES_memHL, OPT::imm3}}},
    // BF ES:[HL].4,$addr20
    {0x11U, {RL78::BTBF_esmemr, {0x31U, 0xC5U, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_NZ, OPT::ES_memHL, OPT::imm4}}},
    // BF ES:[HL].5,$addr20
    {0x11U, {RL78::BTBF_esmemr, {0x31U, 0xD5U, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_NZ, OPT::ES_memHL, OPT::imm5}}},
    // BF ES:[HL].6,$addr20
    {0x11U, {RL78::BTBF_esmemr, {0x31U, 0xE5U, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_NZ, OPT::ES_memHL, OPT::imm6}}},
    // BF ES:[HL].7,$addr20
    {0x11U, {RL78::BTBF_esmemr, {0x31U, 0xF5U, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_NZ, OPT::ES_memHL, OPT::imm7}}},
    // BF PSW.0,$addr20
    {0x31U, {RL78::BTBF_PSWi_addr, {0x84U, 0xFAU, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_NZ, RL78::PSW, OPT::imm0}}},
    // BF PSW.1,$addr20
    {0x31U, {RL78::BTBF_PSWi_addr, {0x94U, 0xFAU, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_NZ, RL78::PSW, OPT::imm1}}},
    // BF PSW.2,$addr20
    {0x31U, {RL78::BTBF_PSWi_addr, {0xA4U, 0xFAU, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_NZ, RL78::PSW, OPT::imm2}}},
    // BF PSW.3,$addr20
    {0x31U, {RL78::BTBF_PSWi_addr, {0xB4U, 0xFAU, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_NZ, RL78::PSW, OPT::imm3}}},
    // BF PSW.4,$addr20
    {0x31U, {RL78::BTBF_PSWi_addr, {0xC4U, 0xFAU, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_NZ, RL78::PSW, OPT::imm4}}},
    // BF PSW.5,$addr20
    {0x31U, {RL78::BTBF_PSWi_addr, {0xD4U, 0xFAU, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_NZ, RL78::PSW, OPT::imm5}}},
    // BF PSW.6,$addr20
    {0x31U, {RL78::BTBF_PSWi_addr, {0xE4U, 0xFAU, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_NZ, RL78::PSW, OPT::imm6}}},
    // BF PSW.7,$addr20
    {0x31U, {RL78::BTBF_PSWi_addr, {0xF4U, 0xFAU, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_NZ, RL78::PSW, OPT::imm7}}},
    // BF sfr.0,$addr20
    {0x31U, {RL78::BTBF_sfri_addr, {0x84U, SBP::sfr, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_NZ, OPT::sfr, OPT::imm0}}},
    // BF sfr.1,$addr20
    {0x31U, {RL78::BTBF_sfri_addr, {0x94U, SBP::sfr, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_NZ, OPT::sfr, OPT::imm1}}},
    // BF sfr.2,$addr20
    {0x31U, {RL78::BTBF_sfri_addr, {0xA4U, SBP::sfr, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_NZ, OPT::sfr, OPT::imm2}}},
    // BF sfr.3,$addr20
    {0x31U, {RL78::BTBF_sfri_addr, {0xB4U, SBP::sfr, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_NZ, OPT::sfr, OPT::imm3}}},
    // BF sfr.4,$addr20
    {0x31U, {RL78::BTBF_sfri_addr, {0xC4U, SBP::sfr, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_NZ, OPT::sfr, OPT::imm4}}},
    // BF sfr.5,$addr20
    {0x31U, {RL78::BTBF_sfri_addr, {0xD4U, SBP::sfr, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_NZ, OPT::sfr, OPT::imm5}}},
    // BF sfr.6,$addr20
    {0x31U, {RL78::BTBF_sfri_addr, {0xE4U, SBP::sfr, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_NZ, OPT::sfr, OPT::imm6}}},
    // BF sfr.7,$addr20
    {0x31U, {RL78::BTBF_sfri_addr, {0xF4U, SBP::sfr, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_NZ, OPT::sfr, OPT::imm7}}},
    // BH $addr20
    {0x61U, {RL78::B_cc, {0xC3U, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_H}}},
    // BNC $addr20
    {0xDEU, {RL78::B_cc, {SBP::adr}, {OPT::S_addr20, OPT::RL78CC_NC}}},
    // BNH $addr20
    {0x61U, {RL78::B_cc, {0xD3U, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_NH}}},
    // BNZ $addr20
    {0xDFU, {RL78::B_cc, {SBP::adr}, {OPT::S_addr20, OPT::RL78CC_NZ}}},
    // BR !addr16
    {0xEDU, {RL78::BR_addr16, {SBP::adrl, SBP::adrh}, {OPT::I_addr16}}},
    // BR AX*/ 
    {0x61U, {RL78::BR_AX, {0xCBU}, {RL78::RP0}}},
    // BR $!addr20
    {0xEEU, {RL78::BR_rel16, {SBP::adrl, SBP::adrh}, {OPT::SI_addr20}}},
    // BR $addr20*/ 
    {0xEFU, {RL78::BR_rel8, {SBP::adr}, {OPT::S_addr20}}},
    // BR !!addr20
    {0xECU, {RL78::BR_addr20, {SBP::adrl, SBP::adrh, SBP::adrs}, {OPT::II_addr20}}},
    // BRK nan*/ 
    {0x61U, {RL78::BRK, {0xCCU}, {}}},
    // BT [HL].0,$addr20
    {0x31U, {RL78::BTBF_memr, {0x83U, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_Z, OPT::memHL, OPT::imm0}}},
    // BT [HL].1,$addr20
    {0x31U, {RL78::BTBF_memr, {0x93U, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_Z, OPT::memHL, OPT::imm1}}},
    // BT [HL].2,$addr20
    {0x31U, {RL78::BTBF_memr, {0xA3U, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_Z, OPT::memHL, OPT::imm2}}},
    // BT [HL].3,$addr20
    {0x31U, {RL78::BTBF_memr, {0xB3U, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_Z, OPT::memHL, OPT::imm3}}},
    // BT [HL].4,$addr20
    {0x31U, {RL78::BTBF_memr, {0xC3U, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_Z, OPT::memHL, OPT::imm4}}},
    // BT [HL].5,$addr20
    {0x31U, {RL78::BTBF_memr, {0xD3U, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_Z, OPT::memHL, OPT::imm5}}},
    // BT [HL].6,$addr20
    {0x31U, {RL78::BTBF_memr, {0xE3U, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_Z, OPT::memHL, OPT::imm6}}},
    // BT [HL].7,$addr20
    {0x31U, {RL78::BTBF_memr, {0xF3U, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_Z, OPT::memHL, OPT::imm7}}},
    // BT A.0,$addr20
    {0x31U, {RL78::BTBF_A, {0x3U, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_Z, RL78::R1, OPT::imm0}}},
    // BT A.1,$addr20
    {0x31U, {RL78::BTBF_A, {0x13U, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_Z, RL78::R1, OPT::imm1}}},
