ksekimoto/llvm-project/llvm/lib/Target/RL78/Disassembler/RL78Disassembler.cpp
    // BT A.2,$addr20
    {0x31U, {RL78::BTBF_A, {0x23U, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_Z, RL78::R1, OPT::imm2}}},
    // BT A.3,$addr20
    {0x31U, {RL78::BTBF_A, {0x33U, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_Z, RL78::R1, OPT::imm3}}},
    // BT A.4,$addr20
    {0x31U, {RL78::BTBF_A, {0x43U, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_Z, RL78::R1, OPT::imm4}}},
    // BT A.5,$addr20
    {0x31U, {RL78::BTBF_A, {0x53U, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_Z, RL78::R1, OPT::imm5}}},
    // BT A.6,$addr20
    {0x31U, {RL78::BTBF_A, {0x63U, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_Z, RL78::R1, OPT::imm6}}},
    // BT A.7,$addr20
    {0x31U, {RL78::BTBF_A, {0x73U, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_Z, RL78::R1, OPT::imm7}}},
    // BT saddr.0,$addr20
    {0x31U, {RL78::BTBF_saddr, {0x2U, SBP::saddr, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_Z, OPT::saddr, OPT::imm0}}},
    // BT saddr.1,$addr20
    {0x31U, {RL78::BTBF_saddr, {0x12U, SBP::saddr, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_Z, OPT::saddr, OPT::imm1}}},
    // BT saddr.2,$addr20
    {0x31U, {RL78::BTBF_saddr, {0x22U, SBP::saddr, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_Z, OPT::saddr, OPT::imm2}}},
    // BT saddr.3,$addr20
    {0x31U, {RL78::BTBF_saddr, {0x32U, SBP::saddr, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_Z, OPT::saddr, OPT::imm3}}},
    // BT saddr.4,$addr20
    {0x31U, {RL78::BTBF_saddr, {0x42U, SBP::saddr, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_Z, OPT::saddr, OPT::imm4}}},
    // BT saddr.5,$addr20
    {0x31U, {RL78::BTBF_saddr, {0x52U, SBP::saddr, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_Z, OPT::saddr, OPT::imm5}}},
    // BT saddr.6,$addr20
    {0x31U, {RL78::BTBF_saddr, {0x62U, SBP::saddr, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_Z, OPT::saddr, OPT::imm6}}},
    // BT saddr.7,$addr20
    {0x31U, {RL78::BTBF_saddr, {0x72U, SBP::saddr, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_Z, OPT::saddr, OPT::imm7}}},
    // BT ES:[HL].0,$addr20
    {0x11U, {RL78::BTBF_esmemr, {0x31U, 0x83U, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_Z, OPT::ES_memHL, OPT::imm0}}},
    // BT ES:[HL].1,$addr20
    {0x11U, {RL78::BTBF_esmemr, {0x31U, 0x93U, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_Z, OPT::ES_memHL, OPT::imm1}}},
    // BT ES:[HL].2,$addr20
    {0x11U, {RL78::BTBF_esmemr, {0x31U, 0xA3U, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_Z, OPT::ES_memHL, OPT::imm2}}},
    // BT ES:[HL].3,$addr20
    {0x11U, {RL78::BTBF_esmemr, {0x31U, 0xB3U, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_Z, OPT::ES_memHL, OPT::imm3}}},
    // BT ES:[HL].4,$addr20
    {0x11U, {RL78::BTBF_esmemr, {0x31U, 0xC3U, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_Z, OPT::ES_memHL, OPT::imm4}}},
    // BT ES:[HL].5,$addr20
    {0x11U, {RL78::BTBF_esmemr, {0x31U, 0xD3U, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_Z, OPT::ES_memHL, OPT::imm5}}},
    // BT ES:[HL].6,$addr20
    {0x11U, {RL78::BTBF_esmemr, {0x31U, 0xE3U, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_Z, OPT::ES_memHL, OPT::imm6}}},
    // BT ES:[HL].7,$addr20
    {0x11U, {RL78::BTBF_esmemr, {0x31U, 0xF3U, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_Z, OPT::ES_memHL, OPT::imm7}}},
    // BT PSW.0,$addr20
    {0x31U, {RL78::BTBF_PSWi_addr, {0x82U, 0xFAU, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_Z, RL78::PSW, OPT::imm0}}},
    // BT PSW.1,$addr20
    {0x31U, {RL78::BTBF_PSWi_addr, {0x92U, 0xFAU, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_Z, RL78::PSW, OPT::imm1}}},
    // BT PSW.2,$addr20
    {0x31U, {RL78::BTBF_PSWi_addr, {0xA2U, 0xFAU, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_Z, RL78::PSW, OPT::imm2}}},
    // BT PSW.3,$addr20
    {0x31U, {RL78::BTBF_PSWi_addr, {0xB2U, 0xFAU, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_Z, RL78::PSW, OPT::imm3}}},
    // BT PSW.4,$addr20
    {0x31U, {RL78::BTBF_PSWi_addr, {0xC2U, 0xFAU, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_Z, RL78::PSW, OPT::imm4}}},
    // BT PSW.5,$addr20
    {0x31U, {RL78::BTBF_PSWi_addr, {0xD2U, 0xFAU, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_Z, RL78::PSW, OPT::imm5}}},
    // BT PSW.6,$addr20
    {0x31U, {RL78::BTBF_PSWi_addr, {0xE2U, 0xFAU, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_Z, RL78::PSW, OPT::imm6}}},
    // BT PSW.7,$addr20
    {0x31U, {RL78::BTBF_PSWi_addr, {0xF2U, 0xFAU, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_Z, RL78::PSW, OPT::imm7}}},
    // BT sfr.0,$addr20
    {0x31U, {RL78::BTBF_sfri_addr, {0x82U, SBP::sfr, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_Z, OPT::sfr, OPT::imm0}}},
    // BT sfr.1,$addr20
    {0x31U, {RL78::BTBF_sfri_addr, {0x92U, SBP::sfr, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_Z, OPT::sfr, OPT::imm1}}},
    // BT sfr.2,$addr20
    {0x31U, {RL78::BTBF_sfri_addr, {0xA2U, SBP::sfr, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_Z, OPT::sfr, OPT::imm2}}},
    // BT sfr.3,$addr20
    {0x31U, {RL78::BTBF_sfri_addr, {0xB2U, SBP::sfr, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_Z, OPT::sfr, OPT::imm3}}},
    // BT sfr.4,$addr20
    {0x31U, {RL78::BTBF_sfri_addr, {0xC2U, SBP::sfr, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_Z, OPT::sfr, OPT::imm4}}},
    // BT sfr.5,$addr20
    {0x31U, {RL78::BTBF_sfri_addr, {0xD2U, SBP::sfr, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_Z, OPT::sfr, OPT::imm5}}},
    // BT sfr.6,$addr20
    {0x31U, {RL78::BTBF_sfri_addr, {0xE2U, SBP::sfr, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_Z, OPT::sfr, OPT::imm6}}},
    // BT sfr.7,$addr20
    {0x31U, {RL78::BTBF_sfri_addr, {0xF2U, SBP::sfr, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_Z, OPT::sfr, OPT::imm7}}},
    // BTCLR [HL].0,$addr20
    {0x31U, {RL78::BTCLR_memr, {0x81U, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_Z, OPT::memHL, OPT::imm0}}},
    // BTCLR [HL].1,$addr20
    {0x31U, {RL78::BTCLR_memr, {0x91U, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_Z, OPT::memHL, OPT::imm1}}},
    // BTCLR [HL].2,$addr20
    {0x31U, {RL78::BTCLR_memr, {0xA1U, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_Z, OPT::memHL, OPT::imm2}}},
    // BTCLR [HL].3,$addr20
    {0x31U, {RL78::BTCLR_memr, {0xB1U, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_Z, OPT::memHL, OPT::imm3}}},
    // BTCLR [HL].4,$addr20
    {0x31U, {RL78::BTCLR_memr, {0xC1U, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_Z, OPT::memHL, OPT::imm4}}},
    // BTCLR [HL].5,$addr20
    {0x31U, {RL78::BTCLR_memr, {0xD1U, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_Z, OPT::memHL, OPT::imm5}}},
    // BTCLR [HL].6,$addr20
    {0x31U, {RL78::BTCLR_memr, {0xE1U, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_Z, OPT::memHL, OPT::imm6}}},
    // BTCLR [HL].7,$addr20
    {0x31U, {RL78::BTCLR_memr, {0xF1U, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_Z, OPT::memHL, OPT::imm7}}},
    // BTCLR A.0,$addr20
    {0x31U, {RL78::BTCLR_A, {0x1U, SBP::adr}, {RL78::R1, OPT::S_addr20, OPT::RL78CC_Z, RL78::R1, OPT::imm0}}},
    // BTCLR A.1,$addr20
    {0x31U, {RL78::BTCLR_A, {0x11U, SBP::adr}, {RL78::R1, OPT::S_addr20, OPT::RL78CC_Z, RL78::R1, OPT::imm1}}},
    // BTCLR A.2,$addr20
    {0x31U, {RL78::BTCLR_A, {0x21U, SBP::adr}, {RL78::R1, OPT::S_addr20, OPT::RL78CC_Z, RL78::R1, OPT::imm2}}},
    // BTCLR A.3,$addr20
    {0x31U, {RL78::BTCLR_A, {0x31U, SBP::adr}, {RL78::R1, OPT::S_addr20, OPT::RL78CC_Z, RL78::R1, OPT::imm3}}},
    // BTCLR A.4,$addr20
    {0x31U, {RL78::BTCLR_A, {0x41U, SBP::adr}, {RL78::R1, OPT::S_addr20, OPT::RL78CC_Z, RL78::R1, OPT::imm4}}},
    // BTCLR A.5,$addr20
    {0x31U, {RL78::BTCLR_A, {0x51U, SBP::adr}, {RL78::R1, OPT::S_addr20, OPT::RL78CC_Z, RL78::R1, OPT::imm5}}},
    // BTCLR A.6,$addr20
    {0x31U, {RL78::BTCLR_A, {0x61U, SBP::adr}, {RL78::R1, OPT::S_addr20, OPT::RL78CC_Z, RL78::R1, OPT::imm6}}},
    // BTCLR A.7,$addr20
    {0x31U, {RL78::BTCLR_A, {0x71U, SBP::adr}, {RL78::R1, OPT::S_addr20, OPT::RL78CC_Z, RL78::R1, OPT::imm7}}},
    // BTCLR saddr.0,$addr20
    {0x31U, {RL78::BTCLR_saddr, {0x0U, SBP::saddr, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_Z, OPT::saddr, OPT::imm0}}},
    // BTCLR saddr.1,$addr20
    {0x31U, {RL78::BTCLR_saddr, {0x10U, SBP::saddr, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_Z, OPT::saddr, OPT::imm1}}},
    // BTCLR saddr.2,$addr20
    {0x31U, {RL78::BTCLR_saddr, {0x20U, SBP::saddr, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_Z, OPT::saddr, OPT::imm2}}},
    // BTCLR saddr.3,$addr20
    {0x31U, {RL78::BTCLR_saddr, {0x30U, SBP::saddr, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_Z, OPT::saddr, OPT::imm3}}},
    // BTCLR saddr.4,$addr20
    {0x31U, {RL78::BTCLR_saddr, {0x40U, SBP::saddr, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_Z, OPT::saddr, OPT::imm4}}},
    // BTCLR saddr.5,$addr20
    {0x31U, {RL78::BTCLR_saddr, {0x50U, SBP::saddr, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_Z, OPT::saddr, OPT::imm5}}},
    // BTCLR saddr.6,$addr20
    {0x31U, {RL78::BTCLR_saddr, {0x60U, SBP::saddr, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_Z, OPT::saddr, OPT::imm6}}},
    // BTCLR saddr.7,$addr20
    {0x31U, {RL78::BTCLR_saddr, {0x70U, SBP::saddr, SBP::adr}, {OPT::S_addr20, OPT::RL78CC_Z, OPT::saddr, OPT::imm7}}},
    // BTCLR ES:[HL].0,$addr20
    {0x11U, {RL78::BTCLR_esmemr, {0x31U, 0x81U, SBP::adr}, {OPT::S_addr20, OPT::ES_memHL, OPT::imm0}}},
    // BTCLR ES:[HL].1,$addr20
    {0x11U, {RL78::BTCLR_esmemr, {0x31U, 0x91U, SBP::adr}, {OPT::S_addr20, OPT::ES_memHL, OPT::imm1}}},
    // BTCLR ES:[HL].2,$addr20
    {0x11U, {RL78::BTCLR_esmemr, {0x31U, 0xA1U, SBP::adr}, {OPT::S_addr20, OPT::ES_memHL, OPT::imm2}}},
    // BTCLR ES:[HL].3,$addr20
    {0x11U, {RL78::BTCLR_esmemr, {0x31U, 0xB1U, SBP::adr}, {OPT::S_addr20, OPT::ES_memHL, OPT::imm3}}},
    // BTCLR ES:[HL].4,$addr20
    {0x11U, {RL78::BTCLR_esmemr, {0x31U, 0xC1U, SBP::adr}, {OPT::S_addr20, OPT::ES_memHL, OPT::imm4}}},
    // BTCLR ES:[HL].5,$addr20
    {0x11U, {RL78::BTCLR_esmemr, {0x31U, 0xD1U, SBP::adr}, {OPT::S_addr20, OPT::ES_memHL, OPT::imm5}}},
    // BTCLR ES:[HL].6,$addr20
    {0x11U, {RL78::BTCLR_esmemr, {0x31U, 0xE1U, SBP::adr}, {OPT::S_addr20, OPT::ES_memHL, OPT::imm6}}},
    // BTCLR ES:[HL].7,$addr20
    {0x11U, {RL78::BTCLR_esmemr, {0x31U, 0xF1U, SBP::adr}, {OPT::S_addr20, OPT::ES_memHL, OPT::imm7}}},
    // BTCLR PSW.0,$addr20
    {0x31U, {RL78::BTCLR_PSWi_addr, {0x80U, 0xFAU, SBP::adr}, {OPT::S_addr20, RL78::PSW, OPT::imm0}}},
    // BTCLR PSW.1,$addr20
    {0x31U, {RL78::BTCLR_PSWi_addr, {0x90U, 0xFAU, SBP::adr}, {OPT::S_addr20, RL78::PSW, OPT::imm1}}},
    // BTCLR PSW.2,$addr20
    {0x31U, {RL78::BTCLR_PSWi_addr, {0xA0U, 0xFAU, SBP::adr}, {OPT::S_addr20, RL78::PSW, OPT::imm2}}},
    // BTCLR PSW.3,$addr20
    {0x31U, {RL78::BTCLR_PSWi_addr, {0xB0U, 0xFAU, SBP::adr}, {OPT::S_addr20, RL78::PSW, OPT::imm3}}},
    // BTCLR PSW.4,$addr20
    {0x31U, {RL78::BTCLR_PSWi_addr, {0xC0U, 0xFAU, SBP::adr}, {OPT::S_addr20, RL78::PSW, OPT::imm4}}},
    // BTCLR PSW.5,$addr20
    {0x31U, {RL78::BTCLR_PSWi_addr, {0xD0U, 0xFAU, SBP::adr}, {OPT::S_addr20, RL78::PSW, OPT::imm5}}},
    // BTCLR PSW.6,$addr20
    {0x31U, {RL78::BTCLR_PSWi_addr, {0xE0U, 0xFAU, SBP::adr}, {OPT::S_addr20, RL78::PSW, OPT::imm6}}},
    // BTCLR PSW.7,$addr20
    {0x31U, {RL78::BTCLR_PSWi_addr, {0xF0U, 0xFAU, SBP::adr}, {OPT::S_addr20, RL78::PSW, OPT::imm7}}},
    // BTCLR sfr.0,$addr20
    {0x31U, {RL78::BTCLR_sfri_addr, {0x80U, SBP::sfr, SBP::adr}, {OPT::S_addr20, OPT::sfr, OPT::imm0}}},
    // BTCLR sfr.1,$addr20
    {0x31U, {RL78::BTCLR_sfri_addr, {0x90U, SBP::sfr, SBP::adr}, {OPT::S_addr20, OPT::sfr, OPT::imm1}}},
    // BTCLR sfr.2,$addr20
    {0x31U, {RL78::BTCLR_sfri_addr, {0xA0U, SBP::sfr, SBP::adr}, {OPT::S_addr20, OPT::sfr, OPT::imm2}}},
    // BTCLR sfr.3,$addr20
    {0x31U, {RL78::BTCLR_sfri_addr, {0xB0U, SBP::sfr, SBP::adr}, {OPT::S_addr20, OPT::sfr, OPT::imm3}}},
    // BTCLR sfr.4,$addr20
    {0x31U, {RL78::BTCLR_sfri_addr, {0xC0U, SBP::sfr, SBP::adr}, {OPT::S_addr20, OPT::sfr, OPT::imm4}}},
    // BTCLR sfr.5,$addr20
    {0x31U, {RL78::BTCLR_sfri_addr, {0xD0U, SBP::sfr, SBP::adr}, {OPT::S_addr20, OPT::sfr, OPT::imm5}}},
    // BTCLR sfr.6,$addr20
    {0x31U, {RL78::BTCLR_sfri_addr, {0xE0U, SBP::sfr, SBP::adr}, {OPT::S_addr20, OPT::sfr, OPT::imm6}}},
    // BTCLR sfr.7,$addr20
    {0x31U, {RL78::BTCLR_sfri_addr, {0xF0U, SBP::sfr, SBP::adr}, {OPT::S_addr20, OPT::sfr, OPT::imm7}}},
    // BZ $addr20
    {0xDDU, {RL78::B_cc, {SBP::adr}, {OPT::S_addr20, OPT::RL78CC_Z}}},
    // CALL !addr16
    {0xFDU, {RL78::CALL_addr16, {SBP::adrl, SBP::adrh}, {OPT::I_addr16}}},
    // CALL $!addr20
    {0xFEU, {RL78::CALL_addr16rel, {SBP::adrl, SBP::adrh}, {OPT::SI_addr20}}},
    // CALL !!addr20
    {0xFCU, {RL78::CALL_addr20, {SBP::adrl, SBP::adrh, SBP::adrs}, {OPT::II_addr20}}},
    // CALL AX*/ 
    {0x61U, {RL78::CALL_rp, {0xCAU}, {RL78::RP0}}},
    // CALL BC*/ 
    {0x61U, {RL78::CALL_rp, {0xDAU}, {RL78::RP2}}},
    // CALL DE*/ 
    {0x61U, {RL78::CALL_rp, {0xEAU}, {RL78::RP4}}},
    // CALL HL*/ 
    {0x61U, {RL78::CALL_rp, {0xFAU}, {RL78::RP6}}},
    // CALLT [0080h]
    {0x61U, {RL78::CALLT_addr5, {SBP::adr}, {OPT::mem_addr5}}},
    // CLR1 !addr16.0
    {0x71U, {RL78::CLR1_abs16, {0x8U, SBP::adrl, SBP::adrh}, {OPT::I_addr16, OPT::imm0}}},
    // CLR1 !addr16.1
    {0x71U, {RL78::CLR1_abs16, {0x18U, SBP::adrl, SBP::adrh}, {OPT::I_addr16, OPT::imm1}}},
    // CLR1 !addr16.2
    {0x71U, {RL78::CLR1_abs16, {0x28U, SBP::adrl, SBP::adrh}, {OPT::I_addr16, OPT::imm2}}},
    // CLR1 !addr16.3
    {0x71U, {RL78::CLR1_abs16, {0x38U, SBP::adrl, SBP::adrh}, {OPT::I_addr16, OPT::imm3}}},
    // CLR1 !addr16.4
    {0x71U, {RL78::CLR1_abs16, {0x48U, SBP::adrl, SBP::adrh}, {OPT::I_addr16, OPT::imm4}}},
    // CLR1 !addr16.5
    {0x71U, {RL78::CLR1_abs16, {0x58U, SBP::adrl, SBP::adrh}, {OPT::I_addr16, OPT::imm5}}},
    // CLR1 !addr16.6
    {0x71U, {RL78::CLR1_abs16, {0x68U, SBP::adrl, SBP::adrh}, {OPT::I_addr16, OPT::imm6}}},
    // CLR1 !addr16.7
    {0x71U, {RL78::CLR1_abs16, {0x78U, SBP::adrl, SBP::adrh}, {OPT::I_addr16, OPT::imm7}}},
    // CLR1 [HL].0
    {0x71U, {RL78::CLR1_memr, {0x83U}, {OPT::memHL, OPT::imm0}}},
    // CLR1 [HL].1
    {0x71U, {RL78::CLR1_memr, {0x93U}, {OPT::memHL, OPT::imm1}}},
    // CLR1 [HL].2
    {0x71U, {RL78::CLR1_memr, {0xA3U}, {OPT::memHL, OPT::imm2}}},
    // CLR1 [HL].3
    {0x71U, {RL78::CLR1_memr, {0xB3U}, {OPT::memHL, OPT::imm3}}},
    // CLR1 [HL].4
    {0x71U, {RL78::CLR1_memr, {0xC3U}, {OPT::memHL, OPT::imm4}}},
    // CLR1 [HL].5
    {0x71U, {RL78::CLR1_memr, {0xD3U}, {OPT::memHL, OPT::imm5}}},
    // CLR1 [HL].6
    {0x71U, {RL78::CLR1_memr, {0xE3U}, {OPT::memHL, OPT::imm6}}},
    // CLR1 [HL].7
    {0x71U, {RL78::CLR1_memr, {0xF3U}, {OPT::memHL, OPT::imm7}}},
    // CLR1 A.0
    {0x71U, {RL78::CLR1_A, {0x8BU}, {RL78::R1, RL78::R1, OPT::imm0}}},
    // CLR1 A.1
    {0x71U, {RL78::CLR1_A, {0x9BU}, {RL78::R1, RL78::R1, OPT::imm1}}},
    // CLR1 A.2
    {0x71U, {RL78::CLR1_A, {0xABU}, {RL78::R1, RL78::R1, OPT::imm2}}},
    // CLR1 A.3
    {0x71U, {RL78::CLR1_A, {0xBBU}, {RL78::R1, RL78::R1, OPT::imm3}}},
    // CLR1 A.4
    {0x71U, {RL78::CLR1_A, {0xCBU}, {RL78::R1, RL78::R1, OPT::imm4}}},
    // CLR1 A.5
    {0x71U, {RL78::CLR1_A, {0xDBU}, {RL78::R1, RL78::R1, OPT::imm5}}},
    // CLR1 A.6
    {0x71U, {RL78::CLR1_A, {0xEBU}, {RL78::R1, RL78::R1, OPT::imm6}}},
    // CLR1 A.7
    {0x71U, {RL78::CLR1_A, {0xFBU}, {RL78::R1, RL78::R1, OPT::imm7}}},
    // CLR1 saddr.0
    {0x71U, {RL78::CLR1_saddr, {0x3U, SBP::saddr}, {OPT::saddr, OPT::imm0}}},
    // CLR1 saddr.1
    {0x71U, {RL78::CLR1_saddr, {0x13U, SBP::saddr}, {OPT::saddr, OPT::imm1}}},
    // CLR1 saddr.2
    {0x71U, {RL78::CLR1_saddr, {0x23U, SBP::saddr}, {OPT::saddr, OPT::imm2}}},
    // CLR1 saddr.3
    {0x71U, {RL78::CLR1_saddr, {0x33U, SBP::saddr}, {OPT::saddr, OPT::imm3}}},
    // CLR1 saddr.4
    {0x71U, {RL78::CLR1_saddr, {0x43U, SBP::saddr}, {OPT::saddr, OPT::imm4}}},
    // CLR1 saddr.5
    {0x71U, {RL78::CLR1_saddr, {0x53U, SBP::saddr}, {OPT::saddr, OPT::imm5}}},
    // CLR1 saddr.6
    {0x71U, {RL78::CLR1_saddr, {0x63U, SBP::saddr}, {OPT::saddr, OPT::imm6}}},
    // CLR1 saddr.7
    {0x71U, {RL78::CLR1_saddr, {0x73U, SBP::saddr}, {OPT::saddr, OPT::imm7}}},
    // CLR1 ES:!addr16.0
    {0x11U, {RL78::CLR1_esaddr16, {0x71U, 0x8U, SBP::adrl, SBP::adrh}, {OPT::ES_I_addr16,OPT::imm0}}},
    // CLR1 ES:!addr16.1
    {0x11U, {RL78::CLR1_esaddr16, {0x71U, 0x18U, SBP::adrl, SBP::adrh}, {OPT::ES_I_addr16,OPT::imm1}}},
    // CLR1 ES:!addr16.2
    {0x11U, {RL78::CLR1_esaddr16, {0x71U, 0x28U, SBP::adrl, SBP::adrh}, {OPT::ES_I_addr16,OPT::imm2}}},
    // CLR1 ES:!addr16.3
    {0x11U, {RL78::CLR1_esaddr16, {0x71U, 0x38U, SBP::adrl, SBP::adrh}, {OPT::ES_I_addr16,OPT::imm3}}},
    // CLR1 ES:!addr16.4
    {0x11U, {RL78::CLR1_esaddr16, {0x71U, 0x48U, SBP::adrl, SBP::adrh}, {OPT::ES_I_addr16,OPT::imm4}}},
    // CLR1 ES:!addr16.5
    {0x11U, {RL78::CLR1_esaddr16, {0x71U, 0x58U, SBP::adrl, SBP::adrh}, {OPT::ES_I_addr16,OPT::imm5}}},
    // CLR1 ES:!addr16.6
    {0x11U, {RL78::CLR1_esaddr16, {0x71U, 0x68U, SBP::adrl, SBP::adrh}, {OPT::ES_I_addr16,OPT::imm6}}},
    // CLR1 ES:!addr16.7
    {0x11U, {RL78::CLR1_esaddr16, {0x71U, 0x78U, SBP::adrl, SBP::adrh}, {OPT::ES_I_addr16,OPT::imm7}}},
    // CLR1 ES:[HL].0
    {0x11U, {RL78::CLR1_esmemr, {0x71U, 0x83U}, {OPT::ES_memHL,OPT::imm0}}},
    // CLR1 ES:[HL].1
    {0x11U, {RL78::CLR1_esmemr, {0x71U, 0x93U}, {OPT::ES_memHL,OPT::imm1}}},
    // CLR1 ES:[HL].2
    {0x11U, {RL78::CLR1_esmemr, {0x71U, 0xA3U}, {OPT::ES_memHL,OPT::imm2}}},
    // CLR1 ES:[HL].3
    {0x11U, {RL78::CLR1_esmemr, {0x71U, 0xB3U}, {OPT::ES_memHL,OPT::imm3}}},
    // CLR1 ES:[HL].4
    {0x11U, {RL78::CLR1_esmemr, {0x71U, 0xC3U}, {OPT::ES_memHL,OPT::imm4}}},
    // CLR1 ES:[HL].5
    {0x11U, {RL78::CLR1_esmemr, {0x71U, 0xD3U}, {OPT::ES_memHL,OPT::imm5}}},
    // CLR1 ES:[HL].6
    {0x11U, {RL78::CLR1_esmemr, {0x71U, 0xE3U}, {OPT::ES_memHL,OPT::imm6}}},
    // CLR1 ES:[HL].7
    {0x11U, {RL78::CLR1_esmemr, {0x71U, 0xF3U}, {OPT::ES_memHL,OPT::imm7}}},
    // CLR1 CY
    {0x71U, {RL78::CLR1_cy, {0x88U}, {RL78::CY}}},
    // CLR1 PSW.0
    {0x71U, {RL78::CLR1_PSW, {0x0BU, 0xFAU}, {RL78::PSW, RL78::PSW, OPT::imm0}}},
    // CLR1 PSW.1
    {0x71U, {RL78::CLR1_PSW, {0x1BU, 0xFAU}, {RL78::PSW, RL78::PSW, OPT::imm1}}},
    // CLR1 PSW.2
    {0x71U, {RL78::CLR1_PSW, {0x2BU, 0xFAU}, {RL78::PSW, RL78::PSW, OPT::imm2}}},
    // CLR1 PSW.3
    {0x71U, {RL78::CLR1_PSW, {0x3BU, 0xFAU}, {RL78::PSW, RL78::PSW, OPT::imm3}}},
    // CLR1 PSW.4
    {0x71U, {RL78::CLR1_PSW, {0x4BU, 0xFAU}, {RL78::PSW, RL78::PSW, OPT::imm4}}},
    // CLR1 PSW.5
    {0x71U, {RL78::CLR1_PSW, {0x5BU, 0xFAU}, {RL78::PSW, RL78::PSW, OPT::imm5}}},
    // CLR1 PSW.6
    {0x71U, {RL78::CLR1_PSW, {0x6BU, 0xFAU}, {RL78::PSW, RL78::PSW, OPT::imm6}}},
    // CLR1 PSW.7
    //{0x71U, {RL78::CLR1_PSW, {0x7BU, 0xFAU}, {RL78::PSW, RL78::PSW, OPT::imm7}}}, - we print DI instead
    // CLR1 sfr.0
    {0x71U, {RL78::CLR1_sfr, {0x0BU, SBP::sfr}, {OPT::sfr,OPT::imm0}}},
    // CLR1 sfr.1
    {0x71U, {RL78::CLR1_sfr, {0x1BU, SBP::sfr}, {OPT::sfr,OPT::imm1}}},
    // CLR1 sfr.2
    {0x71U, {RL78::CLR1_sfr, {0x2BU, SBP::sfr}, {OPT::sfr,OPT::imm2}}},
    // CLR1 sfr.3
    {0x71U, {RL78::CLR1_sfr, {0x3BU, SBP::sfr}, {OPT::sfr,OPT::imm3}}},
    // CLR1 sfr.4
    {0x71U, {RL78::CLR1_sfr, {0x4BU, SBP::sfr}, {OPT::sfr,OPT::imm4}}},
    // CLR1 sfr.5
    {0x71U, {RL78::CLR1_sfr, {0x5BU, SBP::sfr}, {OPT::sfr,OPT::imm5}}},
    // CLR1 sfr.6
    {0x71U, {RL78::CLR1_sfr, {0x6BU, SBP::sfr}, {OPT::sfr,OPT::imm6}}},
    // CLR1 sfr.7
    {0x71U, {RL78::CLR1_sfr, {0x7BU, SBP::sfr}, {OPT::sfr,OPT::imm7}}},
    // CLRB !addr16
    {0xF5U, {RL78::CLRB_abs16, {SBP::adrl, SBP::adrh}, {OPT::I_addr16}}},
    // CLRB X*/ 
    {0xF0U, {RL78::CLRB_r, {}, {RL78::R0}}},
    // CLRB A*/ 
    {0xF1U, {RL78::CLRB_r, {}, {RL78::R1}}},
    // CLRB C*/ 
    {0xF2U, {RL78::CLRB_r, {}, {RL78::R2}}},
    // CLRB B*/ 
    {0xF3U, {RL78::CLRB_r, {}, {RL78::R3}}},
    // CLRB saddr*/ 
    {0xF4U, {RL78::CLRB_saddr, {SBP::saddr}, {OPT::saddr}}},
    // CLRB ES:!addr16
    {0x11U, {RL78::CLRB_esaddr16, {0xF5U, SBP::adrl, SBP::adrh}, {OPT::ES_I_addr16}}},
    // CLRW AX*/ 
    {0xF6U, {RL78::CLRW_rp, {}, {RL78::RP0}}},
    // CLRW BC*/ 
    {0xF7U, {RL78::CLRW_rp, {}, {RL78::RP2}}},
    // CMP !addr16,#byte
    {0x40U, {RL78::CMP_abs16_imm, {SBP::adrl, SBP::adrh, SBP::data}, {OPT::I_addr16, OPT::byte}}},
    // CMP A,!addr16
    {0x4FU, {RL78::CMP_r_abs16, {SBP::adrl, SBP::adrh}, {RL78::R1, OPT::I_addr16}}},
    // CMP saddr,#byte
    {0x4AU, {RL78::CMP_saddr_imm, {SBP::saddr, SBP::data}, {OPT::saddr, OPT::byte}}},
    // CMP A,#byte
    {0x4CU, {RL78::CMP_r_imm, {SBP::data}, {RL78::R1, OPT::byte}}},
    // CMP A,[HL]*/ 
    {0x4DU, {RL78::CMP_r_memri, {}, {RL78::R1, OPT::memHL0}}},
    // CMP A,[HL+byte]
    {0x4EU, {RL78::CMP_r_memri, {SBP::adr}, {RL78::R1, OPT::memHL_byte}}},
    // CMP A,[HL+B]
    {0x61U, {RL78::CMP_r_memrr, {0xC0U}, {RL78::R1, OPT::memHL_B}}},
    // CMP A,[HL+C]
    {0x61U, {RL78::CMP_r_memrr, {0xC2U}, {RL78::R1, OPT::memHL_C}}},
    // CMP A,A*/ 
    {0x61U, {RL78::CMP_r_r, {0x41U}, {RL78::R1, RL78::R1}}},
    // CMP A,B*/ 
    {0x61U, {RL78::CMP_r_r, {0x4BU}, {RL78::R1, RL78::R3}}},
    // CMP A,C*/ 
    {0x61U, {RL78::CMP_r_r, {0x4AU}, {RL78::R1, RL78::R2}}},
    // CMP A,D*/ 
    {0x61U, {RL78::CMP_r_r, {0x4DU}, {RL78::R1, RL78::R5}}},
    // CMP A,E*/ 
    {0x61U, {RL78::CMP_r_r, {0x4CU}, {RL78::R1, RL78::R4}}},
    // CMP A,H*/ 
    {0x61U, {RL78::CMP_r_r, {0x4FU}, {RL78::R1, RL78::R7}}},
    // CMP A,L*/ 
    {0x61U, {RL78::CMP_r_r, {0x4EU}, {RL78::R1, RL78::R6}}},
    // CMP A,X*/ 
    {0x61U, {RL78::CMP_r_r, {0x48U}, {RL78::R1, RL78::R0}}},
    // CMP B,A*/ 
    {0x61U, {RL78::CMP_r_r, {0x43U}, {RL78::R3, RL78::R1}}},
    // CMP C,A*/ 
    {0x61U, {RL78::CMP_r_r, {0x42U}, {RL78::R2, RL78::R1}}},
    // CMP D,A*/ 
    {0x61U, {RL78::CMP_r_r, {0x45U}, {RL78::R5, RL78::R1}}},
    // CMP E,A*/ 
    {0x61U, {RL78::CMP_r_r, {0x44U}, {RL78::R4, RL78::R1}}},
    // CMP H,A*/ 
    {0x61U, {RL78::CMP_r_r, {0x47U}, {RL78::R7, RL78::R1}}},
    // CMP L,A*/ 
    {0x61U, {RL78::CMP_r_r, {0x46U}, {RL78::R6, RL78::R1}}},
    // CMP X,A*/ 
    {0x61U, {RL78::CMP_r_r, {0x40U}, {RL78::R0, RL78::R1}}},
    // CMP A,saddr
    {0x4BU, {RL78::CMP_r_saddr, {SBP::saddr}, {RL78::R1, OPT::saddr}}},
    // CMP A,ES:!addr16
    {0x11U, {RL78::CMP_r_esaddr16, {0x4FU, SBP::adrl, SBP::adrh}, {RL78::R1,OPT::ES_I_addr16}}},
    // CMP A,ES:[HL]
    {0x11U, {RL78::CMP_r_esmemHL, {0x4DU}, {RL78::R1,OPT::ES_memHL0}}},
    // CMP A,ES:[HL+B]
    {0x11U, {RL78::CMP_r_esmemRpr, {0x61U, 0xC0U}, {RL78::R1,OPT::ES_memHL_B}}},
    // CMP A,ES:[HL+byte]
    {0x11U, {RL78::CMP_r_esmemHLi, {0x4EU, SBP::adr}, {RL78::R1,OPT::ES_memHL_byte}}},
    // CMP A,ES:[HL+C]
    {0x11U, {RL78::CMP_r_esmemRpr, {0x61U, 0xC2U}, {RL78::R1,OPT::ES_memHL_C}}},
    // CMP ES:!addr16,#byte
    {0x11U, {RL78::CMP_esaddr16_imm, {0x40U, SBP::adrl, SBP::adrh, SBP::data}, {OPT::ES_I_addr16,OPT::byte}}},
    // CMP0 !addr16
    {0xD5U, {RL78::CMP0_abs16, {SBP::adrl, SBP::adrh}, {OPT::I_addr16}}},
    // CMP0 X*/ 
    {0xD0U, {RL78::CMP0_r, {}, {RL78::R0}}},
    // CMP0 A*/ 
    {0xD1U, {RL78::CMP0_r, {}, {RL78::R1}}},
    // CMP0 C*/ 
    {0xD2U, {RL78::CMP0_r, {}, {RL78::R2}}},
    // CMP0 B*/ 
    {0xD3U, {RL78::CMP0_r, {}, {RL78::R3}}},
    // CMP0 saddr*/ 
    {0xD4U, {RL78::CMP0_saddr, {SBP::saddr}, {OPT::saddr}}},
    // CMP0 ES:!addr16
    {0x11U, {RL78::CMP0_esaddr16, {0xD5U, SBP::adrl, SBP::adrh}, {OPT::ES_I_addr16}}},
    // CMPS X,[HL+byte]
    {0x61U, {RL78::CMPS_r_memri, {0xDEU, SBP::adr}, {RL78::R0, OPT::memHL_byte}}},
    // CMPS X,ES:[HL+byte]
    {0x11U, {RL78::CMPS_rp_memri, {0x61U, 0xDEU, SBP::adr}, {RL78::R0,OPT::ES_memHL_byte}}},
    // CMPW AX,!addr16
    {0x42U, {RL78::CMPW_rp_abs16, {SBP::adrl, SBP::adrh}, {RL78::RP0, OPT::I_addr16}}},
    // CMPW AX,#word
    {0x44U, {RL78::CMPW_rp_imm, {SBP::datal, SBP::datah}, {RL78::RP0, OPT::word}}},
    // CMPW AX,[HL+byte]
