ksekimoto/llvm-project/llvm/lib/Target/RL78/Disassembler/RL78Disassembler.cpp
    {0x61U, {RL78::CMPW_rp_memri, {0x49U, SBP::adr}, {RL78::RP0, OPT::memHL_byte}}},
    // CMPW AX,BC
    {0x43U, {RL78::CMPW_rp_rp, {}, {RL78::RP0, RL78::RP2}}},
    // CMPW AX,DE
    {0x45U, {RL78::CMPW_rp_rp, {}, {RL78::RP0, RL78::RP4}}},
    // CMPW AX,saddrp
    {0x46U, {RL78::CMPW_rp_saddr, {SBP::saddr}, {RL78::RP0, OPT::saddrp}}},
    // CMPW AX,HL*/ 
    {0x47U, {RL78::CMPW_rp_rp, {}, {RL78::RP0, RL78::RP6}}},
    // CMPW AX,ES:!addr16
    {0x11U, {RL78::CMPW_rp_esaddr16, {0x42U, SBP::adrl, SBP::adrh}, {RL78::RP0,OPT::ES_I_addr16}}},
    // CMPW AX,ES:[HL+byte]
    {0x11U, {RL78::CMPW_rp_esmemHLi, {0x61U, 0x49U, SBP::adr}, {RL78::RP0,OPT::ES_memHL_byte}}},
    // DEC !addr16
    {0xB0U, {RL78::DEC_abs16, {SBP::adrl, SBP::adrh}, {OPT::I_addr16}}},
    // DEC [HL+byte]
    {0x61U, {RL78::DEC_memri, {0x69U, SBP::adr}, {OPT::memHL_byte}}},
    // DEC X
    {0x90U, {RL78::DEC_r, {}, {RL78::R0}}},
    // DEC A
    {0x91U, {RL78::DEC_r, {}, {RL78::R1}}},
    // DEC C
    {0x92U, {RL78::DEC_r, {}, {RL78::R2}}},
    // DEC B
    {0x93U, {RL78::DEC_r, {}, {RL78::R3}}},
    // DEC E
    {0x94U, {RL78::DEC_r, {}, {RL78::R4}}},
    // DEC D
    {0x95U, {RL78::DEC_r, {}, {RL78::R5}}},
    // DEC L
    {0x96U, {RL78::DEC_r, {}, {RL78::R6}}},
    // DEC H
    {0x97U, {RL78::DEC_r, {}, {RL78::R7}}},
    // DEC saddr
    {0xB4U, {RL78::DEC_saddr, {SBP::saddr}, {OPT::saddr}}},
    // DEC ES:!addr16
    {0x11U, {RL78::DEC_esaddr16, {0xB0U, SBP::adrl, SBP::adrh}, {OPT::ES_I_addr16}}},
    // DEC ES:[HL+byte]
    {0x11U, {RL78::DEC_esmemHLi, {0x61U, 0x69U, SBP::adr}, {OPT::ES_memHL_byte}}},
    // DECW !addr16
    {0xB2U, {RL78::DECW_abs16, {SBP::adrl, SBP::adrh}, {OPT::I_addr16}}},
    // DECW [HL+byte]
    {0x61U, {RL78::DECW_memri, {0x89U, SBP::adr}, {OPT::memHL_byte}}},
    // DECW AX*/ 
    {0xB1U, {RL78::DECW_rp, {}, {RL78::RP0}}},
    // DECW BC*/ 
    {0xB3U, {RL78::DECW_rp, {}, {RL78::RP2}}},
    // DECW DE*/ 
    {0xB5U, {RL78::DECW_rp, {}, {RL78::RP4}}},
    // DECW saddrp*/ 
    {0xB6U, {RL78::DECW_saddr, {SBP::saddr}, {OPT::saddrp}}},
    // DECW HL*/ 
    {0xB7U, {RL78::DECW_rp, {}, {RL78::RP6}}},
    // DECW ES:!addr16
    {0x11U, {RL78::DECW_esaddr16, {0xB2U, SBP::adrl, SBP::adrh}, {OPT::ES_I_addr16}}},
    // DECW ES:[HL+byte]
    {0x11U, {RL78::DECW_esmemHLi, {0x61U, 0x89U, SBP::adr}, {OPT::ES_memHL_byte}}},
    // DI nan
    {0x71U, {RL78::DI, {0x7BU, 0xFAU}, {}}},
    // EI nan
    {0x71U, {RL78::EI, {0x7AU, 0xFAU}, {}}},
    // HALT nan*/ 
    {0x61U, {RL78::HALT, {0xEDU}, {}}},
    // INC !addr16
    {0xA0U, {RL78::INC_abs16, {SBP::adrl, SBP::adrh}, {OPT::I_addr16}}},
    // INC [HL+byte]
    {0x61U, {RL78::INC_memri, {0x59U, SBP::adr}, {OPT::memHL_byte}}},
    // INC X*/ 
    {0x80U, {RL78::INC_r, {}, {RL78::R0}}},
    // INC A*/ 
    {0x81U, {RL78::INC_r, {}, {RL78::R1}}},
    // INC C*/ 
    {0x82U, {RL78::INC_r, {}, {RL78::R2}}},
    // INC B*/ 
    {0x83U, {RL78::INC_r, {}, {RL78::R3}}},
    // INC E*/ 
    {0x84U, {RL78::INC_r, {}, {RL78::R4}}},
    // INC D*/ 
    {0x85U, {RL78::INC_r, {}, {RL78::R5}}},
    // INC L*/ 
    {0x86U, {RL78::INC_r, {}, {RL78::R6}}},
    // INC H*/ 
    {0x87U, {RL78::INC_r, {}, {RL78::R7}}},
    // INC saddr
    {0xA4U, {RL78::INC_saddr, {SBP::saddr}, {OPT::saddr}}},
    // INC ES:!addr16
    {0x11U, {RL78::INC_esaddr16, {0xA0U, SBP::adrl, SBP::adrh}, {OPT::ES_I_addr16}}},
    // INC ES:[HL+byte]
    {0x11U, {RL78::INC_esmemHLi, {0x61U, 0x59U, SBP::adr}, {OPT::ES_memHL_byte}}},
    // INCW !addr16
    {0xA2U, {RL78::INCW_abs16, {SBP::adrl, SBP::adrh}, {OPT::I_addr16}}},
    // INCW [HL+byte]
    {0x61U, {RL78::INCW_memri, {0x79U, SBP::adr}, {OPT::memHL_byte}}},
    // INCW AX*/ 
    {0xA1U, {RL78::INCW_rp, {}, {RL78::RP0}}},
    // INCW BC*/ 
    {0xA3U, {RL78::INCW_rp, {}, {RL78::RP2}}},
    // INCW DE*/ 
    {0xA5U, {RL78::INCW_rp, {}, {RL78::RP4}}},
    // INCW saddrp*/ 
    {0xA6U, {RL78::INCW_saddr, {SBP::saddr}, {OPT::saddrp}}},
    // INCW HL*/ 
    {0xA7U, {RL78::INCW_rp, {}, {RL78::RP6}}},
    // INCW ES:!addr16
    {0x11U, {RL78::INCW_esaddr16, {0xA2U, SBP::adrl, SBP::adrh}, {OPT::ES_I_addr16}}},
    // INCW ES:[HL+byte]
    {0x11U, {RL78::INCW_esmemHLi, {0x61U, 0x79U, SBP::adr}, {OPT::ES_memHL_byte}}},
    // MOV A,!addr16
    {0x8FU, {RL78::LOAD8_r_abs16, {SBP::adrl, SBP::adrh}, {RL78::R1, OPT::I_addr16}}},
    // MOV X,!addr16
    {0xD9U, {RL78::LOAD8_r_abs16, {SBP::adrl, SBP::adrh}, {RL78::R0, OPT::I_addr16}}},
    // MOV B,!addr16
    {0xE9U, {RL78::LOAD8_r_abs16, {SBP::adrl, SBP::adrh}, {RL78::R3, OPT::I_addr16}}},
    // MOV C,!addr16
    {0xF9U, {RL78::LOAD8_r_abs16, {SBP::adrl, SBP::adrh}, {RL78::R2, OPT::I_addr16}}},
    // MOV A,[HL+B]
    {0x61U, {RL78::LOAD8_r_memrr, {0xC9U}, {RL78::R1, OPT::memHL_B}}},
    // MOV A,[HL+C]
    {0x61U, {RL78::LOAD8_r_memrr, {0xE9U}, {RL78::R1, OPT::memHL_C}}},
    // MOV A,word[BC]
    {0x49U, {RL78::LOAD8_r_ri, {SBP::adrl, SBP::adrh}, {RL78::R1, OPT::word_memBC}}},
    // MOV A,[DE]*/ 
    {0x89U, {RL78::LOAD8_r_memDE, {}, {RL78::R1, OPT::memDE}}},
    // MOV A,[DE+byte]
    {0x8AU, {RL78::LOAD8_r_memDEi, {SBP::adr}, {RL78::R1, OPT::memDE_byte}}},
    // MOV A,[HL]*/ 
    {0x8BU, {RL78::LOAD8_r_memHL, {}, {RL78::R1, OPT::memHL0}}},
    // MOV A,[HL+byte]
    {0x8CU, {RL78::LOAD8_r_memHLi, {SBP::adr}, {RL78::R1, OPT::memHL_byte}}},
    // MOV A,[SP+byte]
    {0x88U, {RL78::LOAD8_r_stack_slot, {SBP::adr}, {RL78::R1, OPT::memSP_byte}}},
    // MOV A,CS*/ 
    {0x8EU, {RL78::MOV_A_cs, {0xFCU}, {RL78::R1, RL78::CS}}},
    // MOV A,ES*/ 
    {0x8EU, {RL78::MOV_A_es, {0xFDU}, {RL78::R1, RL78::ES}}},
    // MOV A,X*/ 
    {0x60U, {RL78::MOV_A_r, {}, {RL78::R1, RL78::R0}}},
    // MOV A,C*/ 
    {0x62U, {RL78::MOV_A_r, {}, {RL78::R1, RL78::R2}}},
    // MOV A,B*/ 
    {0x63U, {RL78::MOV_A_r, {}, {RL78::R1, RL78::R3}}},
    // MOV A,E
    {0x64U, {RL78::MOV_A_r, {}, {RL78::R1, RL78::R4}}},
    // MOV A,D
    {0x65U, {RL78::MOV_A_r, {}, {RL78::R1, RL78::R5}}},
    // MOV A,L
    {0x66U, {RL78::MOV_A_r, {}, {RL78::R1, RL78::R6}}},
    // MOV A,H
    {0x67U, {RL78::MOV_A_r, {}, {RL78::R1, RL78::R7}}},
    // MOV CS,A
    {0x9EU, {RL78::MOV_cs_A, {0xFCU}, {RL78::CS, RL78::R1}}},
    // MOV ES,A
    {0x9EU, {RL78::MOV_es_A, {0xFDU}, {RL78::ES, RL78::R1}}},
    // MOV ES,#byte
    {0x41U, {RL78::MOV_es_imm, {SBP::data}, {RL78::ES, OPT::byte}}},
    // MOV X,A*/ 
    {0x70U, {RL78::MOV_r_A, {}, {RL78::R0, RL78::R1}}},
    // MOV C,A*/ 
    {0x72U, {RL78::MOV_r_A, {}, {RL78::R2, RL78::R1}}},
    // MOV B,A
    {0x73U, {RL78::MOV_r_A, {}, {RL78::R3, RL78::R1}}},
    // MOV E,A
    {0x74U, {RL78::MOV_r_A, {}, {RL78::R4, RL78::R1}}},
    // MOV D,A
    {0x75U, {RL78::MOV_r_A, {}, {RL78::R5, RL78::R1}}},
    // MOV L,A
    {0x76U, {RL78::MOV_r_A, {}, {RL78::R6, RL78::R1}}},
    // MOV H,A
    {0x77U, {RL78::MOV_r_A, {}, {RL78::R7, RL78::R1}}},
    // MOV X,#byte
    {0x50U, {RL78::MOV_r_imm, {SBP::data}, {RL78::R0, OPT::byte}}},
    // MOV A,#byte
    {0x51U, {RL78::MOV_r_imm, {SBP::data}, {RL78::R1, OPT::byte}}},
    // MOV C,#byte
    {0x52U, {RL78::MOV_r_imm, {SBP::data}, {RL78::R2, OPT::byte}}},
    // MOV B,#byte
    {0x53U, {RL78::MOV_r_imm, {SBP::data}, {RL78::R3, OPT::byte}}},
    // MOV E,#byte
    {0x54U, {RL78::MOV_r_imm, {SBP::data}, {RL78::R4, OPT::byte}}},
    // MOV D,#byte
    {0x55U, {RL78::MOV_r_imm, {SBP::data}, {RL78::R5, OPT::byte}}},
    // MOV L,#byte
    {0x56U, {RL78::MOV_r_imm, {SBP::data}, {RL78::R6, OPT::byte}}},
    // MOV H,#byte
    {0x57U, {RL78::MOV_r_imm, {SBP::data}, {RL78::R7, OPT::byte}}},
    // MOV saddr,#byte
    {0xCDU, {RL78::STORE8_saddr_imm, {SBP::saddr, SBP::data}, {OPT::saddr, OPT::byte}}},
    // MOV A,saddr
    {0x8DU, {RL78::LOAD8_rlo_saddr, {SBP::saddr}, {RL78::R1, OPT::saddr}}},
    // MOV X,saddr
    {0xD8U, {RL78::LOAD8_rlo_saddr, {SBP::saddr}, {RL78::R0, OPT::saddr}}},
    // MOV B,saddr
    {0xE8U, {RL78::LOAD8_rlo_saddr, {SBP::saddr}, {RL78::R3, OPT::saddr}}},
    // MOV C,saddr
    {0xF8U, {RL78::LOAD8_rlo_saddr, {SBP::saddr}, {RL78::R2, OPT::saddr}}},
    // MOV saddr,A
    {0x9DU, {RL78::STORE8_saddr_A, {SBP::saddr}, {OPT::saddr, RL78::R1}}},
    // MOV !addr16,#byte
    {0xCFU, {RL78::STORE8_abs16_imm, {SBP::adrl, SBP::adrh, SBP::data}, {OPT::I_addr16, OPT::byte}}},
    // MOV !addr16,A
    {0x9FU, {RL78::STORE8_abs16_r, {SBP::adrl, SBP::adrh}, {OPT::I_addr16, RL78::R1}}},
    // MOV [HL+B],A
    {0x61U, {RL78::STORE8_memrr_r, {0xD9U}, {OPT::memHL_B, RL78::R1}}},
    // MOV [HL+C],A
    {0x61U, {RL78::STORE8_memrr_r, {0xF9U}, {OPT::memHL_C, RL78::R1}}},
    // MOV word[BC],#byte
    {0x39U, {RL78::STORE8_ri_imm, {SBP::adrl, SBP::adrh, SBP::data}, {OPT::word_memBC, OPT::byte}}},
    // MOV [DE+byte],#byte
    {0xCAU, {RL78::STORE8_memDEi_imm, {SBP::adr, SBP::data}, {OPT::memDE_byte, OPT::byte}}},
    // MOV [HL+byte],#byte
    {0xCCU, {RL78::STORE8_memHLi_imm, {SBP::adr, SBP::data}, {OPT::memHL_byte, OPT::byte}}},
    // MOV word[BC],A
    {0x48U, {RL78::STORE8_ri_r, {SBP::adrl, SBP::adrh}, {OPT::word_memBC, RL78::R1}}},
    // MOV [DE],A*/ 
    {0x99U, {RL78::STORE8_memDE_r, {}, {OPT::memDE, RL78::R1}}},
    // MOV [DE+byte],A
    {0x9AU, {RL78::STORE8_memDEi_r, {SBP::adr}, {OPT::memDE_byte, RL78::R1}}},
    // MOV [HL],A*/ 
    {0x9BU, {RL78::STORE8_memHL_r, {}, {OPT::memHL0, RL78::R1}}},
    // MOV [HL+byte],A
    {0x9CU, {RL78::STORE8_memHLi_r, {SBP::adr}, {OPT::memHL_byte, RL78::R1}}},
    // MOV [SP+byte],#byte
    {0xC8U, {RL78::STORE8_stack_slot_imm, {SBP::adr, SBP::data}, {OPT::memSP_byte, OPT::byte}}},
    // MOV [SP+byte],A
    {0x98U, {RL78::STORE8_stack_slot_r, {SBP::adr}, {OPT::memSP_byte, RL78::R1}}},
    // MOV A,word[B]
    {0x9U, {RL78::LOAD8_r_ri, {SBP::adrl, SBP::adrh}, {RL78::R1,OPT::word_memB}}},
    // MOV A,ES:!addr16
    {0x11U, {RL78::MOV_r_esaddr16, {0x8FU, SBP::adrl, SBP::adrh}, {RL78::R1,OPT::ES_I_addr16}}},
    // MOV A,ES:[DE]
    {0x11U, {RL78::LOAD8_a_esmemDE, {0x89U}, {RL78::R1,OPT::ES_memDE}}},
    // MOV A,ES:[DE+byte]
    {0x11U, {RL78::LOAD8_a_esmemDEi, {0x8AU, SBP::adr}, {RL78::R1,OPT::ES_memDE_byte}}},
    // MOV A,ES:[HL]
    {0x11U, {RL78::LOAD8_rp_esmemHL, {0x8BU}, {RL78::R1,OPT::ES_memHL0}}},
    // MOV A,ES:[HL+B]
    {0x11U, {RL78::LOAD8_a_esmemRpr, {0x61U, 0xC9U}, {RL78::R1,OPT::ES_memHL_B}}},
    // MOV A,ES:[HL+byte]
    {0x11U, {RL78::LOAD8_a_esmemHLi, {0x8CU, SBP::adr}, {RL78::R1,OPT::ES_memHL_byte}}},
    // MOV A,ES:[HL+C]
    {0x11U, {RL78::LOAD8_a_esmemRpr, {0x61U, 0xE9U}, {RL78::R1,OPT::ES_memHL_C}}},
    // MOV A,ES:word[B]
    {0x11U, {RL78::LOAD8_a_esrborci, {0x9U, SBP::adrl, SBP::adrh}, {RL78::R1,OPT::ES_word_memB}}},
    // MOV A,ES:word[BC]
    {0x11U, {RL78::LOAD8_r_esrpi, {0x49U, SBP::adrl, SBP::adrh}, {RL78::R1,OPT::ES_word_memBC}}},
    // MOV A,ES:word[C]
    {0x11U, {RL78::LOAD8_a_esrborci, {0x29U, SBP::adrl, SBP::adrh}, {RL78::R1,OPT::ES_word_memC}}},
    // MOV B,ES:!addr16
    {0x11U, {RL78::MOV_r_esaddr16, {0xE9U, SBP::adrl, SBP::adrh}, {RL78::R3,OPT::ES_I_addr16}}},
    // MOV C,ES:!addr16
    {0x11U, {RL78::MOV_r_esaddr16, {0xF9U, SBP::adrl, SBP::adrh}, {RL78::R2,OPT::ES_I_addr16}}},
    // MOV ES:!addr16,#byte
    {0x11U, {RL78::MOV_esaddr16_imm, {0xCFU, SBP::adrl, SBP::adrh, SBP::data}, {OPT::ES_I_addr16,OPT::byte}}},
    // MOV ES:!addr16,A
    {0x11U, {RL78::MOV_esaddr16_a, {0x9FU, SBP::adrl, SBP::adrh}, {OPT::ES_I_addr16,RL78::R1}}},
    // MOV ES:[DE],A
    {0x11U, {RL78::STORE8_esmemDE_r, {0x99U}, {OPT::ES_memDE,RL78::R1}}},
    // MOV ES:[DE+byte],#byte
    {0x11U, {RL78::STORE8_esmemDEi_imm, {0xCAU, SBP::adr, SBP::data}, {OPT::ES_memDE_byte,OPT::byte}}},
    // MOV ES:[DE+byte],A
    {0x11U, {RL78::STORE8_esmemDEi_a, {0x9AU, SBP::adr}, {OPT::ES_memDE_byte,RL78::R1}}},
    // MOV ES:[HL],A
    {0x11U, {RL78::STORE8_esmemHL_a, {0x9BU}, {OPT::ES_memHL0,RL78::R1}}},
    // MOV ES:[HL+B],A
    {0x11U, {RL78::STORE8_esmemRpr_a, {0x61U, 0xD9U}, {OPT::ES_memHL_B,RL78::R1}}},
    // MOV ES:[HL+byte],#byte
    {0x11U, {RL78::STORE8_esmemHLi_imm, {0xCCU, SBP::adr, SBP::data}, {OPT::ES_memHL_byte,OPT::byte}}},
    // MOV ES:[HL+byte],A
    {0x11U, {RL78::STORE8_esmemHLi_a, {0x9CU, SBP::adr}, {OPT::ES_memHL_byte,RL78::R1}}},
    // MOV ES:[HL+C],A
    {0x11U, {RL78::STORE8_esmemRpr_a, {0x61U, 0xF9U}, {OPT::ES_memHL_C,RL78::R1}}},
    // MOV ES:word[B],#byte
    {0x11U, {RL78::STORE8_esmemBCi_imm, {0x19U, SBP::adrl, SBP::adrh, SBP::data}, {OPT::ES_word_memB,OPT::byte}}},
    // MOV ES:word[B],A
    {0x11U, {RL78::STORE8_esrborci_r, {0x18U, SBP::adrl, SBP::adrh}, {OPT::ES_word_memB,RL78::R1}}},
    // MOV ES:word[BC],#byte
    {0x11U, {RL78::STORE8_esmemBCi_imm, {0x39U, SBP::adrl, SBP::adrh, SBP::data}, {OPT::ES_word_memBC,OPT::byte}}},
    // MOV ES:word[BC],A
    {0x11U, {RL78::STORE8_esrpi_r, {0x48U, SBP::adrl, SBP::adrh}, {OPT::ES_word_memBC,RL78::R1}}},
    // MOV ES:word[C],#byte
    {0x11U, {RL78::STORE8_esmemBorCi_imm, {0x38U, SBP::adrl, SBP::adrh, SBP::data}, {OPT::ES_word_memC,OPT::byte}}},
    // MOV ES:word[C],A
    {0x11U, {RL78::STORE8_esrborci_r, {0x28U, SBP::adrl, SBP::adrh}, {OPT::ES_word_memC,RL78::R1}}},
    // MOV X,ES:!addr16
    {0x11U, {RL78::MOV_r_esaddr16, {0xD9U, SBP::adrl, SBP::adrh}, {RL78::R0,OPT::ES_I_addr16}}},
    // MOV word[B],A
    {0x18U, {RL78::STORE8_ri_r, {SBP::adrl, SBP::adrh}, {OPT::word_memB,RL78::R1}}},
    // MOV word[B],#byte
    {0x19U, {RL78::STORE8_ri_imm, {SBP::adrl, SBP::adrh, SBP::data}, {OPT::word_memB,OPT::byte}}},
    // MOV word[C],A
    {0x28U, {RL78::STORE8_ri_r, {SBP::adrl, SBP::adrh}, {OPT::word_memC,RL78::R1}}},
    // MOV A,word[C]
    {0x29U, {RL78::LOAD8_r_ri, {SBP::adrl, SBP::adrh}, {RL78::R1,OPT::word_memC}}},
    // MOV word[C],#byte
    {0x38U, {RL78::STORE8_ri_imm, {SBP::adrl, SBP::adrh, SBP::data}, {OPT::word_memC,OPT::byte}}},
    // MOV ES,saddr
    {0x61U, {RL78::MOV_es_saddr, {0xB8U, SBP::saddr}, {RL78::ES,OPT::saddr}}},
    // MOV A,PSW
    {0x8EU, {RL78::MOV_A_PSW, {0xFAU}, {RL78::R1}}},
    // MOV A,sfr
    {0x8EU, {RL78::LOAD8_r_sfr, {SBP::sfr}, {RL78::R1,OPT::sfr}}},
    // MOV PSW,A
    {0x9EU, {RL78::MOV_PSW_A, {0xFAU}, {RL78::R1}}},
    // MOV sfr,A
    {0x9EU, {RL78::STORE8_sfr_r, {SBP::sfr}, {OPT::sfr,RL78::R1}}},
    // MOV CS,#byte
    {0xCEU, {RL78::MOV_cs_imm, {0xFCU, SBP::data}, {RL78::CS, OPT::byte}}},
    // MOV PSW,#byte
    {0xCEU, {RL78::MOV_psw_imm, {0xFAU, SBP::data}, {RL78::PSW, OPT::byte}}},
    // MOV sfr,#byte
    {0xCEU, {RL78::STORE8_sfr_imm, {SBP::sfr, SBP::data}, {OPT::sfr, OPT::byte}}},
    // MOV1 CY,[HL].0
    {0x71U, {RL78::MOV1_cy_memr, {0x84U}, {OPT::memHL, OPT::imm0}}},
    // MOV1 CY,[HL].1
    {0x71U, {RL78::MOV1_cy_memr, {0x94U}, {OPT::memHL, OPT::imm1}}},
    // MOV1 CY,[HL].2
    {0x71U, {RL78::MOV1_cy_memr, {0xA4U}, {OPT::memHL, OPT::imm2}}},
    // MOV1 CY,[HL].3
    {0x71U, {RL78::MOV1_cy_memr, {0xB4U}, {OPT::memHL, OPT::imm3}}},
    // MOV1 CY,[HL].4
    {0x71U, {RL78::MOV1_cy_memr, {0xC4U}, {OPT::memHL, OPT::imm4}}},
    // MOV1 CY,[HL].5
    {0x71U, {RL78::MOV1_cy_memr, {0xD4U}, {OPT::memHL, OPT::imm5}}},
    // MOV1 CY,[HL].6
    {0x71U, {RL78::MOV1_cy_memr, {0xE4U}, {OPT::memHL, OPT::imm6}}},
    // MOV1 CY,[HL].7
    {0x71U, {RL78::MOV1_cy_memr, {0xF4U}, {OPT::memHL, OPT::imm7}}},
    // MOV1 CY,PSW.0*/ 
    {0x71U, {RL78::MOV1_cy_psw, {0x0CU, 0xFAU}, {RL78::PSW, OPT::imm0}}},
    // MOV1 CY,PSW.1*/ 
    {0x71U, {RL78::MOV1_cy_psw, {0x1CU, 0xFAU}, {RL78::PSW,OPT::imm1}}},
    // MOV1 CY,PSW.2*/ 
    {0x71U, {RL78::MOV1_cy_psw, {0x2CU, 0xFAU}, {RL78::PSW,OPT::imm2}}},
    // MOV1 CY,PSW.3*/ 
    {0x71U, {RL78::MOV1_cy_psw, {0x3CU, 0xFAU}, {RL78::PSW,OPT::imm3}}},
    // MOV1 CY,PSW.4*/ 
    {0x71U, {RL78::MOV1_cy_psw, {0x4CU, 0xFAU}, {RL78::PSW,OPT::imm4}}},
    // MOV1 CY,PSW.5*/ 
    {0x71U, {RL78::MOV1_cy_psw, {0x5CU, 0xFAU}, {RL78::PSW,OPT::imm5}}},
    // MOV1 CY,PSW.6*/ 
    {0x71U, {RL78::MOV1_cy_psw, {0x6CU, 0xFAU}, {RL78::PSW,OPT::imm6}}},
    // MOV1 CY,PSW.7*/ 
    {0x71U, {RL78::MOV1_cy_psw, {0x7CU, 0xFAU}, {RL78::PSW,OPT::imm7}}},
    // MOV1 CY,A.0*/ 
    {0x71U, {RL78::MOV1_cy_r, {0x8CU}, {RL78::R1, OPT::imm0}}},
    // MOV1 CY,A.1*/ 
    {0x71U, {RL78::MOV1_cy_r, {0x9CU}, {RL78::R1, OPT::imm1}}},
    // MOV1 CY,A.2
    {0x71U, {RL78::MOV1_cy_r, {0xACU}, {RL78::R1, OPT::imm2}}},
    // MOV1 CY,A.3
    {0x71U, {RL78::MOV1_cy_r, {0xBCU}, {RL78::R1, OPT::imm3}}},
    // MOV1 CY,A.4
    {0x71U, {RL78::MOV1_cy_r, {0xCCU}, {RL78::R1, OPT::imm4}}},
    // MOV1 CY,A.5
    {0x71U, {RL78::MOV1_cy_r, {0xDCU}, {RL78::R1, OPT::imm5}}},
    // MOV1 CY,A.6
    {0x71U, {RL78::MOV1_cy_r, {0xECU}, {RL78::R1, OPT::imm6}}},
    // MOV1 CY,A.7
    {0x71U, {RL78::MOV1_cy_r, {0xFCU}, {RL78::R1, OPT::imm7}}},
    // MOV1 CY,saddr.0
    {0x71U, {RL78::MOV1_cy_saddr, {0x4U, SBP::saddr}, {OPT::saddr, OPT::imm0}}},
    // MOV1 CY,saddr.1
    {0x71U, {RL78::MOV1_cy_saddr, {0x14U, SBP::saddr}, {OPT::saddr, OPT::imm1}}},
    // MOV1 CY,saddr.2
    {0x71U, {RL78::MOV1_cy_saddr, {0x24U, SBP::saddr}, {OPT::saddr, OPT::imm2}}},
    // MOV1 CY,saddr.3
    {0x71U, {RL78::MOV1_cy_saddr, {0x34U, SBP::saddr}, {OPT::saddr, OPT::imm3}}},
    // MOV1 CY,saddr.4
    {0x71U, {RL78::MOV1_cy_saddr, {0x44U, SBP::saddr}, {OPT::saddr, OPT::imm4}}},
    // MOV1 CY,saddr.5
    {0x71U, {RL78::MOV1_cy_saddr, {0x54U, SBP::saddr}, {OPT::saddr, OPT::imm5}}},
    // MOV1 CY,saddr.6
    {0x71U, {RL78::MOV1_cy_saddr, {0x64U, SBP::saddr}, {OPT::saddr, OPT::imm6}}},
    // MOV1 CY,saddr.7
    {0x71U, {RL78::MOV1_cy_saddr, {0x74U, SBP::saddr}, {OPT::saddr, OPT::imm7}}},
    // MOV1 [HL].0,CY
    {0x71U, {RL78::MOV1_memr_cy, {0x81U}, {OPT::memHL, OPT::imm0}}},
    // MOV1 [HL].1,CY
    {0x71U, {RL78::MOV1_memr_cy, {0x91U}, {OPT::memHL, OPT::imm1}}},
    // MOV1 [HL].2,CY
    {0x71U, {RL78::MOV1_memr_cy, {0xA1U}, {OPT::memHL, OPT::imm2}}},
    // MOV1 [HL].3,CY
    {0x71U, {RL78::MOV1_memr_cy, {0xB1U}, {OPT::memHL, OPT::imm3}}},
    // MOV1 [HL].4,CY
    {0x71U, {RL78::MOV1_memr_cy, {0xC1U}, {OPT::memHL, OPT::imm4}}},
    // MOV1 [HL].5,CY
    {0x71U, {RL78::MOV1_memr_cy, {0xD1U}, {OPT::memHL, OPT::imm5}}},
    // MOV1 [HL].6,CY
    {0x71U, {RL78::MOV1_memr_cy, {0xE1U}, {OPT::memHL, OPT::imm6}}},
    // MOV1 [HL].7,CY
    {0x71U, {RL78::MOV1_memr_cy, {0xF1U}, {OPT::memHL, OPT::imm7}}},
    // MOV1 PSW.0,CY
    {0x71U, {RL78::MOV1_psw_cy, {0x9U, 0xFAU},  {RL78::PSW, OPT::imm0}}},
    // MOV1 PSW.1,CY
    {0x71U, {RL78::MOV1_psw_cy, {0x19U, 0xFAU}, {RL78::PSW, OPT::imm1}}},
    // MOV1 PSW.2,CY
    {0x71U, {RL78::MOV1_psw_cy, {0x29U, 0xFAU}, {RL78::PSW, OPT::imm2}}},
    // MOV1 PSW.3,CY
    {0x71U, {RL78::MOV1_psw_cy, {0x39U, 0xFAU}, {RL78::PSW, OPT::imm3}}},
    // MOV1 PSW.4,CY
    {0x71U, {RL78::MOV1_psw_cy, {0x49U, 0xFAU}, {RL78::PSW, OPT::imm4}}},
    // MOV1 PSW.5,CY
    {0x71U, {RL78::MOV1_psw_cy, {0x59U, 0xFAU}, {RL78::PSW, OPT::imm5}}},
    // MOV1 PSW.6,CY
    {0x71U, {RL78::MOV1_psw_cy, {0x69U, 0xFAU}, {RL78::PSW, OPT::imm6}}},
    // MOV1 PSW.7,CY
    {0x71U, {RL78::MOV1_psw_cy, {0x79U, 0xFAU}, {RL78::PSW, OPT::imm7}}},
    // MOV1 A.0,CY
    {0x71U, {RL78::MOV1_r_cy, {0x89U}, {RL78::R1, RL78::R1, OPT::imm0}}},
    // MOV1 A.1,CY
    {0x71U, {RL78::MOV1_r_cy, {0x99U}, {RL78::R1, RL78::R1, OPT::imm1}}},
    // MOV1 A.2,CY
    {0x71U, {RL78::MOV1_r_cy, {0xA9U}, {RL78::R1, RL78::R1, OPT::imm2}}},
    // MOV1 A.3,CY
    {0x71U, {RL78::MOV1_r_cy, {0xB9U}, {RL78::R1, RL78::R1, OPT::imm3}}},
    // MOV1 A.4,CY
    {0x71U, {RL78::MOV1_r_cy, {0xC9U}, {RL78::R1, RL78::R1, OPT::imm4}}},
    // MOV1 A.5,CY
    {0x71U, {RL78::MOV1_r_cy, {0xD9U}, {RL78::R1, RL78::R1, OPT::imm5}}},
    // MOV1 A.6,CY
    {0x71U, {RL78::MOV1_r_cy, {0xE9U}, {RL78::R1, RL78::R1, OPT::imm6}}},
    // MOV1 A.7,CY
    {0x71U, {RL78::MOV1_r_cy, {0xF9U}, {RL78::R1, RL78::R1, OPT::imm7}}},
    // MOV1 saddr.0,CY
    {0x71U, {RL78::MOV1_saddr_cy, {0x1U, SBP::saddr}, {OPT::saddr, OPT::imm0}}},
    // MOV1 saddr.1,CY
    {0x71U, {RL78::MOV1_saddr_cy, {0x11U, SBP::saddr}, {OPT::saddr, OPT::imm1}}},
    // MOV1 saddr.2,CY
    {0x71U, {RL78::MOV1_saddr_cy, {0x21U, SBP::saddr}, {OPT::saddr,  OPT::imm2}}},
    // MOV1 saddr.3,CY
    {0x71U, {RL78::MOV1_saddr_cy, {0x31U, SBP::saddr}, {OPT::saddr,  OPT::imm3}}},
    // MOV1 saddr.4,CY
    {0x71U, {RL78::MOV1_saddr_cy, {0x41U, SBP::saddr}, {OPT::saddr,  OPT::imm4}}},
    // MOV1 saddr.5,CY
    {0x71U, {RL78::MOV1_saddr_cy, {0x51U, SBP::saddr}, {OPT::saddr,  OPT::imm5}}},
    // MOV1 saddr.6,CY
    {0x71U, {RL78::MOV1_saddr_cy, {0x61U, SBP::saddr}, {OPT::saddr,  OPT::imm6}}},
    // MOV1 saddr.7,CY
    {0x71U, {RL78::MOV1_saddr_cy, {0x71U, SBP::saddr}, {OPT::saddr,  OPT::imm7}}},
    // MOV1 CY,ES:[HL].0
    {0x11U, {RL78::MOV1_cy_esmemr, {0x71U, 0x84U}, {RL78::CY, OPT::ES_memHL,OPT::imm0}}},
    // MOV1 CY,ES:[HL].1
    {0x11U, {RL78::MOV1_cy_esmemr, {0x71U, 0x94U}, {RL78::CY, OPT::ES_memHL,OPT::imm1}}},
    // MOV1 CY,ES:[HL].2
    {0x11U, {RL78::MOV1_cy_esmemr, {0x71U, 0xA4U}, {RL78::CY, OPT::ES_memHL,OPT::imm2}}},
    // MOV1 CY,ES:[HL].3
    {0x11U, {RL78::MOV1_cy_esmemr, {0x71U, 0xB4U}, {RL78::CY, OPT::ES_memHL,OPT::imm3}}},
    // MOV1 CY,ES:[HL].4
    {0x11U, {RL78::MOV1_cy_esmemr, {0x71U, 0xC4U}, {RL78::CY, OPT::ES_memHL,OPT::imm4}}},
    // MOV1 CY,ES:[HL].5
    {0x11U, {RL78::MOV1_cy_esmemr, {0x71U, 0xD4U}, {RL78::CY, OPT::ES_memHL,OPT::imm5}}},
    // MOV1 CY,ES:[HL].6
    {0x11U, {RL78::MOV1_cy_esmemr, {0x71U, 0xE4U}, {RL78::CY, OPT::ES_memHL,OPT::imm6}}},
    // MOV1 CY,ES:[HL].7
    {0x11U, {RL78::MOV1_cy_esmemr, {0x71U, 0xF4U}, {RL78::CY, OPT::ES_memHL,OPT::imm7}}},
    // MOV1 ES:[HL].0,CY
    {0x11U, {RL78::MOV1_esmemr_cy, {0x71U, 0x81U}, {OPT::ES_memHL,OPT::imm0, RL78::CY}}},
    // MOV1 ES:[HL].1,CY
    {0x11U, {RL78::MOV1_esmemr_cy, {0x71U, 0x91U}, {OPT::ES_memHL,OPT::imm1, RL78::CY}}},
    // MOV1 ES:[HL].2,CY
    {0x11U, {RL78::MOV1_esmemr_cy, {0x71U, 0xA1U}, {OPT::ES_memHL,OPT::imm2, RL78::CY}}},
    // MOV1 ES:[HL].3,CY
    {0x11U, {RL78::MOV1_esmemr_cy, {0x71U, 0xB1U}, {OPT::ES_memHL,OPT::imm3, RL78::CY}}},
    // MOV1 ES:[HL].4,CY
    {0x11U, {RL78::MOV1_esmemr_cy, {0x71U, 0xC1U}, {OPT::ES_memHL,OPT::imm4, RL78::CY}}},
    // MOV1 ES:[HL].5,CY
    {0x11U, {RL78::MOV1_esmemr_cy, {0x71U, 0xD1U}, {OPT::ES_memHL,OPT::imm5, RL78::CY}}},
    // MOV1 ES:[HL].6,CY
    {0x11U, {RL78::MOV1_esmemr_cy, {0x71U, 0xE1U}, {OPT::ES_memHL,OPT::imm6, RL78::CY}}},
    // MOV1 ES:[HL].7,CY
    {0x11U, {RL78::MOV1_esmemr_cy, {0x71U, 0xF1U}, {OPT::ES_memHL,OPT::imm7, RL78::CY}}},
    // MOV1 CY,sfr.0
    {0x71U, {RL78::MOV1_cy_sfr, {0x0CU, SBP::sfr}, {OPT::sfr,OPT::imm0}}},
    // MOV1 CY,sfr.1
    {0x71U, {RL78::MOV1_cy_sfr, {0x1CU, SBP::sfr}, {OPT::sfr,OPT::imm1}}},
    // MOV1 CY,sfr.2
    {0x71U, {RL78::MOV1_cy_sfr, {0x2CU, SBP::sfr}, {OPT::sfr,OPT::imm2}}},
    // MOV1 CY,sfr.3
    {0x71U, {RL78::MOV1_cy_sfr, {0x3CU, SBP::sfr}, {OPT::sfr,OPT::imm3}}},
    // MOV1 CY,sfr.4
    {0x71U, {RL78::MOV1_cy_sfr, {0x4CU, SBP::sfr}, {OPT::sfr,OPT::imm4}}},
    // MOV1 CY,sfr.5
    {0x71U, {RL78::MOV1_cy_sfr, {0x5CU, SBP::sfr}, {OPT::sfr,OPT::imm5}}},
    // MOV1 CY,sfr.6
    {0x71U, {RL78::MOV1_cy_sfr, {0x6CU, SBP::sfr}, {OPT::sfr,OPT::imm6}}},
    // MOV1 CY,sfr.7
    {0x71U, {RL78::MOV1_cy_sfr, {0x7CU, SBP::sfr}, {OPT::sfr,OPT::imm7}}},
    // MOV1 sfr.0,CY
    {0x71U, {RL78::MOV1_sfr_cy, {0x9U, SBP::sfr}, {OPT::sfr,OPT::imm0}}},
    // MOV1 sfr.1,CY
    {0x71U, {RL78::MOV1_sfr_cy, {0x19U, SBP::sfr}, {OPT::sfr,OPT::imm1}}},
    // MOV1 sfr.2,CY
    {0x71U, {RL78::MOV1_sfr_cy, {0x29U, SBP::sfr}, {OPT::sfr,OPT::imm2}}},
    // MOV1 sfr.3,CY
