ksekimoto/llvm-project/llvm/lib/Target/RL78/Disassembler/RL78Disassembler.cpp
    {0x71U, {RL78::MOV1_sfr_cy, {0x39U, SBP::sfr}, {OPT::sfr,OPT::imm3}}},
    // MOV1 sfr.4,CY
    {0x71U, {RL78::MOV1_sfr_cy, {0x49U, SBP::sfr}, {OPT::sfr,OPT::imm4}}},
    // MOV1 sfr.5,CY
    {0x71U, {RL78::MOV1_sfr_cy, {0x59U, SBP::sfr}, {OPT::sfr,OPT::imm5}}},
    // MOV1 sfr.6,CY
    {0x71U, {RL78::MOV1_sfr_cy, {0x69U, SBP::sfr}, {OPT::sfr,OPT::imm6}}},
    // MOV1 sfr.7,CY
    {0x71U, {RL78::MOV1_sfr_cy, {0x79U, SBP::sfr}, {OPT::sfr,OPT::imm7}}},
    // MOVS [HL+byte],X
    {0x61U, {RL78::MOVS_memri_r, {0xCEU, SBP::adr}, {OPT::memHL_byte, RL78::R0}}},
    // MOVS ES:[HL+byte],X
    {0x11U, {RL78::MOVS_Esmemri_r, {0x61U, 0xCEU, SBP::adr}, {OPT::ES_memHL_byte,RL78::R0}}},
    // MOVW AX,!addr16
    {0xAFU, {RL78::LOAD16_rp_abs16, {SBP::adrl, SBP::adrh}, {RL78::RP0, OPT::I_addr16}}},
    // MOVW BC,!addr16
    {0xDBU, {RL78::LOAD16_rp_abs16, {SBP::adrl, SBP::adrh}, {RL78::RP2, OPT::I_addr16}}},
    // MOVW DE,!addr16
    {0xEBU, {RL78::LOAD16_rp_abs16, {SBP::adrl, SBP::adrh}, {RL78::RP4, OPT::I_addr16}}},
    // MOVW HL,!addr16
    {0xFBU, {RL78::LOAD16_rp_abs16, {SBP::adrl, SBP::adrh}, {RL78::RP6, OPT::I_addr16}}},
    // MOVW AX,ES:word[BC]
    {0x11U, {RL78::LOAD16_rp_esrpi, {0x79U, SBP::adrl, SBP::adrh}, {RL78::RP0, OPT::ES_word_memBC}}},
    // MOVW AX,word[BC]
    {0x79U, {RL78::LOAD16_rp_rpi, {SBP::adrl, SBP::adrh}, {RL78::RP0, OPT::word_memBC}}},
    // MOVW AX,[DE]
    {0xA9U, {RL78::LOAD16_rp_rpi, {}, {RL78::RP0, OPT::memDE}}},
    // MOVW AX,[DE+byte]
    {0xAAU, {RL78::LOAD16_rp_rpi, {SBP::adr}, {RL78::RP0, OPT::memDE_byte}}},
    // MOVW AX,[HL]
    {0xABU, {RL78::LOAD16_rp_rpi, {}, {RL78::RP0, OPT::memHL0}}},
    // MOVW AX,[HL+byte]
    {0xACU, {RL78::LOAD16_rp_rpi, {SBP::adr}, {RL78::RP0, OPT::memHL_byte}}},
    // MOVW AX,[SP+byte]
    {0xA8U, {RL78::LOAD16_rp_stack_slot, {SBP::adr}, {RL78::RP0, OPT::memSP_byte}}},
    // MOVW AX,BC*/ 
    {0x13U, {RL78::MOVW_AX_rp, {}, {RL78::RP0, RL78::RP2}}},
    // MOVW AX,DE*/ 
    {0x15U, {RL78::MOVW_AX_rp, {}, {RL78::RP0, RL78::RP4}}},
    // MOVW AX,HL*/ 
    {0x17U, {RL78::MOVW_AX_rp, {}, {RL78::RP0, RL78::RP6}}},
    // MOVW AX,saddrp
    {0xADU, {RL78::LOAD16_rp_saddrp, {SBP::saddr}, {RL78::RP0, OPT::saddrp}}},
    // MOVW BC,AX*/ 
    {0x12U, {RL78::MOVW_rp_AX, {}, {RL78::RP2, RL78::RP0}}},
    // MOVW DE,AX*/ 
    {0x14U, {RL78::MOVW_rp_AX, {}, {RL78::RP4, RL78::RP0}}},
    // MOVW HL,AX*/ 
    {0x16U, {RL78::MOVW_rp_AX, {}, {RL78::RP6, RL78::RP0}}},
    // MOVW AX,#word
    {0x30U, {RL78::MOVW_rp_imm, {SBP::datal, SBP::datah}, {RL78::RP0, OPT::word}}},
    // MOVW BC,#word
    {0x32U, {RL78::MOVW_rp_imm, {SBP::datal, SBP::datah}, {RL78::RP2, OPT::word}}},
    // MOVW DE,#word
    {0x34U, {RL78::MOVW_rp_imm, {SBP::datal, SBP::datah}, {RL78::RP4, OPT::word}}},
    // MOVW HL,#word
    {0x36U, {RL78::MOVW_rp_imm, {SBP::datal, SBP::datah}, {RL78::RP6, OPT::word}}},
    // MOVW saddrp,#word
    {0xC9U, {RL78::MOVW_saddrp_imm, {SBP::saddr, SBP::datal, SBP::datah}, {OPT::saddrp, OPT::word}}},
    // MOVW BC,saddrp
    {0xDAU, {RL78::LOAD16_rp_saddrp, {SBP::saddr}, {RL78::RP2, OPT::saddrp}}},
    // MOVW DE,saddrp
    {0xEAU, {RL78::LOAD16_rp_saddrp, {SBP::saddr}, {RL78::RP4, OPT::saddrp}}},
    // MOVW HL,saddrp
    {0xFAU, {RL78::LOAD16_rp_saddrp, {SBP::saddr}, {RL78::RP6, OPT::saddrp}}},
    // MOVW AX,SP
    {0xAEU, {RL78::MOVW_rp_sp, {0xF8U}, {RL78::RP0, RL78::SPreg}}},
    // MOVW BC,SP
    {0xDBU, {RL78::MOVW_rp_sp, {0xF8U, 0xF9U}, {RL78::RP2, RL78::SPreg}}},
    // MOVW DE,SP
    {0xEBU, {RL78::MOVW_rp_sp, {0xF8U, 0xF9U}, {RL78::RP4, RL78::SPreg}}},
    // MOVW HL,SP
    {0xFBU, {RL78::MOVW_rp_sp, {0xF8U, 0xF9U}, {RL78::RP6, RL78::SPreg}}},
    // MOVW saddrp,AX
    {0xBDU, {RL78::STORE16_saddrp_rp, {SBP::saddr}, {OPT::saddrp, RL78::RP0}}},
    // MOVW SP,#word
    {0xCBU, {RL78::MOVW_sp_imm, {0xF8U, SBP::datal, SBP::datah}, {RL78::SPreg, OPT::word}}},
    // MOVW SP,AX
    {0xBEU, {RL78::MOVW_sp_rp, {0xF8U}, {RL78::SPreg, RL78::RP0}}},
    // MOVW !addr16,AX
    {0xBFU, {RL78::STORE16_abs16_rp, {SBP::adrl, SBP::adrh}, {OPT::I_addr16, RL78::RP0}}},
    // MOVW ES:word[BC],AX
    {0x11U, {RL78::STORE16_esrpi_rp, {0x78U, SBP::adrl, SBP::adrh}, {OPT::ES_word_memBC, RL78::RP0}}},
    // MOVW word[BC],AX
    {0x78U, {RL78::STORE16_rpi_rp, {SBP::adrl, SBP::adrh}, {OPT::word_memBC, RL78::RP0}}},
    // MOVW [DE],AX
    {0xB9U, {RL78::STORE16_rpi_rp, {}, {OPT::memDE, RL78::RP0}}},
    // MOVW [DE+byte],AX
    {0xBAU, {RL78::STORE16_rpi_rp, {SBP::adr}, {OPT::memDE_byte, RL78::RP0}}},
    // MOVW [HL],AX
    {0xBBU, {RL78::STORE16_rpi_rp, {}, {OPT::memHL0, RL78::RP0}}},
    // MOVW [HL+byte],AX
    {0xBCU, {RL78::STORE16_rpi_rp, {SBP::adr}, {OPT::memHL_byte, RL78::RP0}}},
    // MOVW [SP+byte],AX
    {0xB8U, {RL78::STORE16_stack_slot_rp, {SBP::adr}, {OPT::memSP_byte, RL78::RP0}}},
    // MOVW AX,ES:!addr16
    {0x11U, {RL78::LOAD16_rp_esaddr16, {0xAFU, SBP::adrl, SBP::adrh}, {RL78::RP0,OPT::ES_I_addr16}}},
    // MOVW AX,ES:[DE]
    {0x11U, {RL78::LOAD16_rp_esmemDE, {0xA9U}, {RL78::RP0,OPT::ES_memDE}}},
    // MOVW AX,ES:[DE+byte]
    {0x11U, {RL78::LOAD16_rp_esmemDEi, {0xAAU, SBP::adr}, {RL78::RP0,OPT::ES_memDE_byte}}},
    // MOVW AX,ES:[HL]
    {0x11U, {RL78::LOAD16_rp_esmemHL, {0xABU}, {RL78::RP0,OPT::ES_memHL0}}},
    // MOVW AX,ES:[HL+byte]
    {0x11U, {RL78::LOAD16_rp_esmemHLi, {0xACU, SBP::adr}, {RL78::RP0,OPT::ES_memHL_byte}}},
    // MOVW AX,ES:word[B]
    {0x11U, {RL78::LOAD16_rp_esrbci, {0x59U, SBP::adrl, SBP::adrh}, {RL78::RP0,OPT::ES_word_memB}}},
    // MOVW AX,ES:word[C]
    {0x11U, {RL78::LOAD16_rp_esrbci, {0x69U, SBP::adrl, SBP::adrh}, {RL78::RP0,OPT::ES_word_memC}}},
    // MOVW BC,ES:!addr16
    {0x11U, {RL78::LOAD16_rp_esaddr16, {0xDBU, SBP::adrl, SBP::adrh}, {RL78::RP2,OPT::ES_I_addr16}}},
    // MOVW DE,ES:!addr16
    {0x11U, {RL78::LOAD16_rp_esaddr16, {0xEBU, SBP::adrl, SBP::adrh}, {RL78::RP4,OPT::ES_I_addr16}}},
    // MOVW ES:!addr16,AX
    {0x11U, {RL78::STORE16_esaddr16_rp, {0xBFU, SBP::adrl, SBP::adrh}, {OPT::ES_I_addr16,RL78::RP0}}},
    // MOVW ES:[DE],AX
    {0x11U, {RL78::STORE16_esmemDE_rp, {0xB9U}, {OPT::ES_memDE,RL78::RP0}}},
    // MOVW ES:[DE+byte],AX
    {0x11U, {RL78::STORE16_esmemDEi_rp, {0xBAU, SBP::adr}, {OPT::ES_memDE_byte,RL78::RP0}}},
    // MOVW ES:[HL],AX
    {0x11U, {RL78::STORE16_esmemHL_rp, {0xBBU}, {OPT::ES_memHL0,RL78::RP0}}},
    // MOVW ES:[HL+byte],AX
    {0x11U, {RL78::STORE16_esmemHLi_rp, {0xBCU, SBP::adr}, {OPT::ES_memHL_byte,RL78::RP0}}},
    // MOVW ES:word[B],AX
    {0x11U, {RL78::STORE16_esrbci_rp, {0x58U, SBP::adrl, SBP::adrh}, {OPT::ES_word_memB,RL78::RP0}}},
    // MOVW ES:word[C],AX
    {0x11U, {RL78::STORE16_esrbci_rp, {0x68U, SBP::adrl, SBP::adrh}, {OPT::ES_word_memC,RL78::RP0}}},
    // MOVW HL,ES:!addr16
    {0x11U, {RL78::LOAD16_rp_esaddr16, {0xFBU, SBP::adrl, SBP::adrh}, {RL78::RP6,OPT::ES_I_addr16}}},
    // MOVW word[B],AX
    {0x58U, {RL78::STORE16_rbci_rp, {SBP::adrl, SBP::adrh}, {OPT::word_memB,RL78::RP0}}},
    // MOVW AX,word[B]
    {0x59U, {RL78::LOAD16_rp_rbci, {SBP::adrl, SBP::adrh}, {RL78::RP0,OPT::word_memB}}},
    // MOVW word[C],AX
    {0x68U, {RL78::STORE16_rbci_rp, {SBP::adrl, SBP::adrh}, {OPT::word_memC,RL78::RP0}}},
    // MOVW AX,word[C]
    {0x69U, {RL78::LOAD16_rp_rbci, {SBP::adrl, SBP::adrh}, {RL78::RP0,OPT::word_memC}}},
    // MOVW AX,sfrp
    {0xAEU, {RL78::LOAD16_rp_sfrp, {SBP::sfr}, {RL78::RP0,OPT::sfrp}}},
    // MOVW sfrp,AX
    {0xBEU, {RL78::STORE16_sfrp_rp, {SBP::sfr}, {OPT::sfrp,RL78::RP0}}},
    // MOVW sfrp,#word
    {0xCBU, {RL78::STORE16_sfrp_imm, {SBP::sfr, SBP::datal, SBP::datah}, {OPT::sfrp,OPT::word}}},
    // MULU X*/ 
    {0xD6U, {RL78::MULU_r, {}, {RL78::R0}}},
    // NOP nan*/ 
    {0x0U, {RL78::NOP, {}, {}}},
    // NOT1 CY*/ 
    {0x71U, {RL78::NOT1_cy, {0xC0U}, {}}},
    // ONEB !addr16
    {0xE5U, {RL78::ONEB_abs16, {SBP::adrl, SBP::adrh}, {OPT::I_addr16}}},
    // ONEB X*/ 
    {0xE0U, {RL78::ONEB_r, {}, {RL78::R0}}},
    // ONEB A*/ 
    {0xE1U, {RL78::ONEB_r, {}, {RL78::R1}}},
    // ONEB C*/ 
    {0xE2U, {RL78::ONEB_r, {}, {RL78::R2}}},
    // ONEB B*/ 
    {0xE3U, {RL78::ONEB_r, {}, {RL78::R3}}},
    // ONEB saddr*/ 
    {0xE4U, {RL78::ONEB_saddr, {SBP::saddr}, {OPT::saddr}}},
    // ONEB ES:!addr16
    {0x11U, {RL78::ONEB_esaddr16, {0xE5U, SBP::adrl, SBP::adrh}, {OPT::ES_I_addr16}}},
    // ONEW AX*/ 
    {0xE6U, {RL78::ONEW_rp, {}, {RL78::RP0}}},
    // ONEW BC*/ 
    {0xE7U, {RL78::ONEW_rp, {}, {RL78::RP2}}},
    // OR A,!addr16
    {0x6FU, {RL78::OR_r_abs16, {SBP::adrl, SBP::adrh}, {RL78::R1, RL78::R1, OPT::I_addr16}}},
    // OR saddr,#byte
    {0x6AU, {RL78::OR_saddr_imm, {SBP::saddr, SBP::data}, {OPT::saddr, OPT::byte}}},
    // OR A,#byte
    {0x6CU, {RL78::OR_r_imm, {SBP::data}, {RL78::R1, RL78::R1, OPT::byte}}},
    // OR A,[HL]
    {0x6DU, {RL78::OR_r_memri, {}, {RL78::R1, RL78::R1, OPT::memHL0}}},
    // OR A,[HL+byte]
    {0x6EU, {RL78::OR_r_memri, {SBP::adr}, {RL78::R1, RL78::R1, OPT::memHL_byte}}},
    // OR A,[HL+B]
    {0x61U, {RL78::OR_r_memrr, {0xE0U}, {RL78::R1, RL78::R1, OPT::memHL_B}}},
    // OR A,[HL+C]
    {0x61U, {RL78::OR_r_memrr, {0xE2U}, {RL78::R1, RL78::R1, OPT::memHL_C}}},
    // OR A,A*/ 
    {0x61U, {RL78::OR_r_r, {0x61U}, {RL78::R1, RL78::R1, RL78::R1}}},
    // OR A,B*/ 
    {0x61U, {RL78::OR_r_r, {0x6BU}, {RL78::R1, RL78::R1, RL78::R3}}},
    // OR A,C*/ 
    {0x61U, {RL78::OR_r_r, {0x6AU}, {RL78::R1, RL78::R1, RL78::R2}}},
    // OR A,D*/ 
    {0x61U, {RL78::OR_r_r, {0x6DU}, {RL78::R1, RL78::R1, RL78::R5}}},
    // OR A,E*/ 
    {0x61U, {RL78::OR_r_r, {0x6CU}, {RL78::R1, RL78::R1, RL78::R4}}},
    // OR A,H
    {0x61U, {RL78::OR_r_r, {0x6FU}, {RL78::R1, RL78::R1, RL78::R7}}},
    // OR A,L
    {0x61U, {RL78::OR_r_r, {0x6EU}, {RL78::R1, RL78::R1, RL78::R6}}},
    // OR A,X
    {0x61U, {RL78::OR_r_r, {0x68U}, {RL78::R1, RL78::R1, RL78::R0}}},
    // OR B,A
    {0x61U, {RL78::OR_r_r, {0x63U}, {RL78::R3, RL78::R3, RL78::R1}}},
    // OR C,A
    {0x61U, {RL78::OR_r_r, {0x62U}, {RL78::R2, RL78::R2, RL78::R1}}},
    // OR D,A
    {0x61U, {RL78::OR_r_r, {0x65U}, {RL78::R5, RL78::R5, RL78::R1}}},
    // OR E,A
    {0x61U, {RL78::OR_r_r, {0x64U}, {RL78::R4, RL78::R4, RL78::R1}}},
    // OR H,A
    {0x61U, {RL78::OR_r_r, {0x67U}, {RL78::R7, RL78::R7, RL78::R1}}},
    // OR L,A
    {0x61U, {RL78::OR_r_r, {0x66U}, {RL78::R6, RL78::R6, RL78::R1}}},
    // OR X,A
    {0x61U, {RL78::OR_r_r, {0x60U}, {RL78::R0, RL78::R0, RL78::R1}}},
    // OR A,saddr
    {0x6BU, {RL78::OR_r_saddr, {SBP::saddr}, {RL78::R1, RL78::R1, OPT::saddr}}},
    // OR A,ES:!addr16
    {0x11U, {RL78::OR_r_esaddr16, {0x6FU, SBP::adrl, SBP::adrh}, {RL78::R1,RL78::R1,OPT::ES_I_addr16}}},
    // OR A,ES:[HL]
    {0x11U, {RL78::OR_r_esmemHL, {0x6DU}, {RL78::R1,RL78::R1,OPT::ES_memHL0}}},
    // OR A,ES:[HL+B]
    {0x11U, {RL78::OR_r_esmemRpr, {0x61U, 0xE0U}, {RL78::R1,RL78::R1,OPT::ES_memHL_B}}},
    // OR A,ES:[HL+byte]
    {0x11U, {RL78::OR_r_esmemHLi, {0x6EU, SBP::adr}, {RL78::R1,RL78::R1,OPT::ES_memHL_byte}}},
    // OR A,ES:[HL+C]
    {0x11U, {RL78::OR_r_esmemRpr, {0x61U, 0xE2U}, {RL78::R1,RL78::R1,OPT::ES_memHL_C}}},
    // OR1 CY,[HL].0
    {0x71U, {RL78::OR1_cy_memr, {0x86U}, {OPT::memHL, OPT::imm0}}},
    // OR1 CY,[HL].1
    {0x71U, {RL78::OR1_cy_memr, {0x96U}, {OPT::memHL, OPT::imm1}}},
    // OR1 CY,[HL].2
    {0x71U, {RL78::OR1_cy_memr, {0xA6U}, {OPT::memHL, OPT::imm2}}},
    // OR1 CY,[HL].3
    {0x71U, {RL78::OR1_cy_memr, {0xB6U}, {OPT::memHL, OPT::imm3}}},
    // OR1 CY,[HL].4
    {0x71U, {RL78::OR1_cy_memr, {0xC6U}, {OPT::memHL, OPT::imm4}}},
    // OR1 CY,[HL].5
    {0x71U, {RL78::OR1_cy_memr, {0xD6U}, {OPT::memHL, OPT::imm5}}},
    // OR1 CY,[HL].6
    {0x71U, {RL78::OR1_cy_memr, {0xE6U}, {OPT::memHL, OPT::imm6}}},
    // OR1 CY,[HL].7
    {0x71U, {RL78::OR1_cy_memr, {0xF6U}, {OPT::memHL, OPT::imm7}}},
    // OR1 CY,A.0*/ 
    {0x71U, {RL78::OR1_cy_r, {0x8EU}, {RL78::R1, OPT::imm0}}},
    // OR1 CY,A.1
    {0x71U, {RL78::OR1_cy_r, {0x9EU}, {RL78::R1, OPT::imm1}}},
    // OR1 CY,A.2
    {0x71U, {RL78::OR1_cy_r, {0xAEU}, {RL78::R1, OPT::imm2}}},
    // OR1 CY,A.3
    {0x71U, {RL78::OR1_cy_r, {0xBEU}, {RL78::R1, OPT::imm3}}},
    // OR1 CY,A.4
    {0x71U, {RL78::OR1_cy_r, {0xCEU}, {RL78::R1, OPT::imm4}}},
    // OR1 CY,A.5
    {0x71U, {RL78::OR1_cy_r, {0xDEU}, {RL78::R1, OPT::imm5}}},
    // OR1 CY,A.6
    {0x71U, {RL78::OR1_cy_r, {0xEEU}, {RL78::R1, OPT::imm6}}},
    // OR1 CY,A.7
    {0x71U, {RL78::OR1_cy_r, {0xFEU}, {RL78::R1, OPT::imm7}}},
    // OR1 CY,saddr.0
    {0x71U, {RL78::OR1_cy_saddrx, {0x6U, SBP::saddr}, {OPT::saddr, OPT::imm0}}},
    // OR1 CY,saddr.1
    {0x71U, {RL78::OR1_cy_saddrx, {0x16U, SBP::saddr}, {OPT::saddr, OPT::imm1}}},
    // OR1 CY,saddr.2
    {0x71U, {RL78::OR1_cy_saddrx, {0x26U, SBP::saddr}, {OPT::saddr, OPT::imm2}}},
    // OR1 CY,saddr.3
    {0x71U, {RL78::OR1_cy_saddrx, {0x36U, SBP::saddr}, {OPT::saddr, OPT::imm3}}},
    // OR1 CY,saddr.4
    {0x71U, {RL78::OR1_cy_saddrx, {0x46U, SBP::saddr}, {OPT::saddr, OPT::imm4}}},
    // OR1 CY,saddr.5
    {0x71U, {RL78::OR1_cy_saddrx, {0x56U, SBP::saddr}, {OPT::saddr, OPT::imm5}}},
    // OR1 CY,saddr.6
    {0x71U, {RL78::OR1_cy_saddrx, {0x66U, SBP::saddr}, {OPT::saddr, OPT::imm6}}},
    // OR1 CY,saddr.7
    {0x71U, {RL78::OR1_cy_saddrx, {0x76U, SBP::saddr}, {OPT::saddr, OPT::imm7}}},
    // OR1 CY,ES:[HL].0
    {0x11U, {RL78::OR1_esmemr, {0x71U, 0x86U}, {RL78::CY, OPT::ES_memHL,OPT::imm0}}},
    // OR1 CY,ES:[HL].1
    {0x11U, {RL78::OR1_esmemr, {0x71U, 0x96U}, {RL78::CY, OPT::ES_memHL,OPT::imm1}}},
    // OR1 CY,ES:[HL].2
    {0x11U, {RL78::OR1_esmemr, {0x71U, 0xA6U}, {RL78::CY, OPT::ES_memHL,OPT::imm2}}},
    // OR1 CY,ES:[HL].3
    {0x11U, {RL78::OR1_esmemr, {0x71U, 0xB6U}, {RL78::CY, OPT::ES_memHL,OPT::imm3}}},
    // OR1 CY,ES:[HL].4
    {0x11U, {RL78::OR1_esmemr, {0x71U, 0xC6U}, {RL78::CY, OPT::ES_memHL,OPT::imm4}}},
    // OR1 CY,ES:[HL].5
    {0x11U, {RL78::OR1_esmemr, {0x71U, 0xD6U}, {RL78::CY, OPT::ES_memHL,OPT::imm5}}},
    // OR1 CY,ES:[HL].6
    {0x11U, {RL78::OR1_esmemr, {0x71U, 0xE6U}, {RL78::CY, OPT::ES_memHL,OPT::imm6}}},
    // OR1 CY,ES:[HL].7
    {0x11U, {RL78::OR1_esmemr, {0x71U, 0xF6U}, {RL78::CY, OPT::ES_memHL,OPT::imm7}}},
    // OR1 CY,PSW.0
    {0x71U, {RL78::OR1_cy_PSW, {0x0EU, 0xFAU}, {RL78::PSW, OPT::imm0}}},
    // OR1 CY,PSW.1
    {0x71U, {RL78::OR1_cy_PSW, {0x1EU, 0xFAU}, {RL78::PSW, OPT::imm1}}},
    // OR1 CY,PSW.2
    {0x71U, {RL78::OR1_cy_PSW, {0x2EU, 0xFAU}, {RL78::PSW, OPT::imm2}}},
    // OR1 CY,PSW.3
    {0x71U, {RL78::OR1_cy_PSW, {0x3EU, 0xFAU}, {RL78::PSW, OPT::imm3}}},
    // OR1 CY,PSW.4
    {0x71U, {RL78::OR1_cy_PSW, {0x4EU, 0xFAU}, {RL78::PSW, OPT::imm4}}},
    // OR1 CY,PSW.5
    {0x71U, {RL78::OR1_cy_PSW, {0x5EU, 0xFAU}, {RL78::PSW, OPT::imm5}}},
    // OR1 CY,PSW.6
    {0x71U, {RL78::OR1_cy_PSW, {0x6EU, 0xFAU}, {RL78::PSW, OPT::imm6}}},
    // OR1 CY,PSW.7
    {0x71U, {RL78::OR1_cy_PSW, {0x7EU, 0xFAU}, {RL78::PSW, OPT::imm7}}},
    // OR1 CY,sfr.0
    {0x71U, {RL78::OR1_cy_sfr, {0x0EU, SBP::sfr}, {OPT::sfr,OPT::imm0}}},
    // OR1 CY,sfr.1
    {0x71U, {RL78::OR1_cy_sfr, {0x1EU, SBP::sfr}, {OPT::sfr,OPT::imm1}}},
    // OR1 CY,sfr.2
    {0x71U, {RL78::OR1_cy_sfr, {0x2EU, SBP::sfr}, {OPT::sfr,OPT::imm2}}},
    // OR1 CY,sfr.3
    {0x71U, {RL78::OR1_cy_sfr, {0x3EU, SBP::sfr}, {OPT::sfr,OPT::imm3}}},
    // OR1 CY,sfr.4
    {0x71U, {RL78::OR1_cy_sfr, {0x4EU, SBP::sfr}, {OPT::sfr,OPT::imm4}}},
    // OR1 CY,sfr.5
    {0x71U, {RL78::OR1_cy_sfr, {0x5EU, SBP::sfr}, {OPT::sfr,OPT::imm5}}},
    // OR1 CY,sfr.6
    {0x71U, {RL78::OR1_cy_sfr, {0x6EU, SBP::sfr}, {OPT::sfr,OPT::imm6}}},
    // OR1 CY,sfr.7
    {0x71U, {RL78::OR1_cy_sfr, {0x7EU, SBP::sfr}, {OPT::sfr,OPT::imm7}}},
    // POP PSW
    {0x61U, {RL78::POP_cc, {0xCDU}, {}}},
    // POP AX
    {0xC0U, {RL78::POP_rp, {}, {RL78::RP0}}},
    // POP BC
    {0xC2U, {RL78::POP_rp, {}, {RL78::RP2}}},
    // POP DE
    {0xC4U, {RL78::POP_rp, {}, {RL78::RP4}}},
    // POP HL
    {0xC6U, {RL78::POP_rp, {}, {RL78::RP6}}},
    // PREFIX nan
    {0x11U, {RL78::PREFIX, {}, {}}},
    // PUSH PSW
    {0x61U, {RL78::PUSH_cc, {0xDDU}, {}}},
    // PUSH AX
    {0xC1U, {RL78::PUSH_rp, {}, {RL78::RP0}}},
    // PUSH BC
    {0xC3U, {RL78::PUSH_rp, {}, {RL78::RP2}}},
    // PUSH DE
    {0xC5U, {RL78::PUSH_rp, {}, {RL78::RP4}}},
    // PUSH HL
    {0xC7U, {RL78::PUSH_rp, {}, {RL78::RP6}}},
    // RET nan
    {0xD7U, {RL78::RET, {}, {}}},
    // RETB nan
    {0x61U, {RL78::RETB, {0xECU}, {}}},
    // RETI nan
    {0x61U, {RL78::RETI, {0xFCU}, {}}},
    // ROL A,1
    {0x61U, {RL78::ROL_r_1, {0xEBU}, {RL78::R1, OPT::imm1}}},
    // ROLC A,1
    {0x61U, {RL78::ROLC_r_1, {0xDCU}, {RL78::R1, OPT::imm1}}},
    // ROLWC AX,1
    {0x61U, {RL78::ROLWC_rp_1, {0xEEU}, {RL78::RP0, OPT::imm1}}},
    // ROLWC BC,1
    {0x61U, {RL78::ROLWC_rp_1, {0xFEU}, {RL78::RP2, OPT::imm1}}},
    // ROR A,1
    {0x61U, {RL78::ROR_r_1, {0xDBU}, {RL78::R1, OPT::imm1}}},
    // RORC A,1
    {0x61U, {RL78::RORC_r_1, {0xFBU}, {RL78::R1, OPT::imm1}}},
    // SAR A,1
    {0x31U, {RL78::SAR_r_i, {0x1BU}, {RL78::R1, RL78::R1, OPT::imm1}}},
    // SAR A,2
    {0x31U, {RL78::SAR_r_i, {0x2BU}, {RL78::R1, RL78::R1, OPT::imm2}}},
    // SAR A,3
    {0x31U, {RL78::SAR_r_i, {0x3BU}, {RL78::R1, RL78::R1, OPT::imm3}}},
    // SAR A,4
    {0x31U, {RL78::SAR_r_i, {0x4BU}, {RL78::R1, RL78::R1, OPT::imm4}}},
    // SAR A,5
    {0x31U, {RL78::SAR_r_i, {0x5BU}, {RL78::R1, RL78::R1, OPT::imm5}}},
    // SAR A,6
    {0x31U, {RL78::SAR_r_i, {0x6BU}, {RL78::R1, RL78::R1, OPT::imm6}}},
    // SAR A,7
    {0x31U, {RL78::SAR_r_i, {0x7BU}, {RL78::R1, RL78::R1, OPT::imm7}}},
    // SARW AX,1
    {0x31U, {RL78::SARW_rp_i, {0x1FU}, {RL78::RP0, RL78::RP0, OPT::imm1}}},
    // SARW AX,10
    {0x31U, {RL78::SARW_rp_i, {0xAFU}, {RL78::RP0, RL78::RP0, OPT::imm10}}},
    // SARW AX,11
    {0x31U, {RL78::SARW_rp_i, {0xBFU}, {RL78::RP0, RL78::RP0, OPT::imm11}}},
    // SARW AX,12
    {0x31U, {RL78::SARW_rp_i, {0xCFU}, {RL78::RP0, RL78::RP0, OPT::imm12}}},
    // SARW AX,13
    {0x31U, {RL78::SARW_rp_i, {0xDFU}, {RL78::RP0, RL78::RP0, OPT::imm13}}},
    // SARW AX,14
    {0x31U, {RL78::SARW_rp_i, {0xEFU}, {RL78::RP0, RL78::RP0, OPT::imm14}}},
    // SARW AX,15
    {0x31U, {RL78::SARW_rp_i, {0xFFU}, {RL78::RP0, RL78::RP0, OPT::imm15}}},
    // SARW AX,2
    {0x31U, {RL78::SARW_rp_i, {0x2FU}, {RL78::RP0, RL78::RP0, OPT::imm2}}},
    // SARW AX,3
    {0x31U, {RL78::SARW_rp_i, {0x3FU}, {RL78::RP0, RL78::RP0, OPT::imm3}}},
    // SARW AX,4
    {0x31U, {RL78::SARW_rp_i, {0x4FU}, {RL78::RP0, RL78::RP0, OPT::imm4}}},
    // SARW AX,5
    {0x31U, {RL78::SARW_rp_i, {0x5FU}, {RL78::RP0, RL78::RP0, OPT::imm5}}},
    // SARW AX,6
    {0x31U, {RL78::SARW_rp_i, {0x6FU}, {RL78::RP0, RL78::RP0, OPT::imm6}}},
    // SARW AX,7
    {0x31U, {RL78::SARW_rp_i, {0x7FU}, {RL78::RP0, RL78::RP0, OPT::imm7}}},
    // SARW AX,8
    {0x31U, {RL78::SARW_rp_i, {0x8FU}, {RL78::RP0, RL78::RP0, OPT::imm8}}},
    // SARW AX,9
    {0x31U, {RL78::SARW_rp_i, {0x9FU}, {RL78::RP0, RL78::RP0, OPT::imm9}}},
    // SELNote RB0
    {0x61U, {RL78::SEL, {0xCFU}, {OPT::RB0}}},
    // SELNote RB1
    {0x61U, {RL78::SEL, {0xDFU}, {OPT::RB1}}},
    // SELNote RB2
    {0x61U, {RL78::SEL, {0xEFU}, {OPT::RB2}}},
    // SELNote RB3
    {0x61U, {RL78::SEL, {0xFFU}, {OPT::RB3}}},
    // SET1 !addr16.0
    {0x71U, {RL78::SET1_abs16, {0x0U, SBP::adrl, SBP::adrh}, {OPT::I_addr16, OPT::imm0}}},
    // SET1 !addr16.1
    {0x71U, {RL78::SET1_abs16, {0x10U, SBP::adrl, SBP::adrh}, {OPT::I_addr16, OPT::imm1}}},
    // SET1 !addr16.2
    {0x71U, {RL78::SET1_abs16, {0x20U, SBP::adrl, SBP::adrh}, {OPT::I_addr16, OPT::imm2}}},
    // SET1 !addr16.3
    {0x71U, {RL78::SET1_abs16, {0x30U, SBP::adrl, SBP::adrh}, {OPT::I_addr16, OPT::imm3}}},
    // SET1 !addr16.4
    {0x71U, {RL78::SET1_abs16, {0x40U, SBP::adrl, SBP::adrh}, {OPT::I_addr16, OPT::imm4}}},
    // SET1 !addr16.5
    {0x71U, {RL78::SET1_abs16, {0x50U, SBP::adrl, SBP::adrh}, {OPT::I_addr16, OPT::imm5}}},
    // SET1 !addr16.6
    {0x71U, {RL78::SET1_abs16, {0x60U, SBP::adrl, SBP::adrh}, {OPT::I_addr16, OPT::imm6}}},
    // SET1 !addr16.7
    {0x71U, {RL78::SET1_abs16, {0x70U, SBP::adrl, SBP::adrh}, {OPT::I_addr16, OPT::imm7}}},
    // SET1 [HL].0
    {0x71U, {RL78::SET1_memr, {0x82U}, {OPT::memHL, OPT::imm0}}},
    // SET1 [HL].1
    {0x71U, {RL78::SET1_memr, {0x92U}, {OPT::memHL, OPT::imm1}}},
    // SET1 [HL].2
    {0x71U, {RL78::SET1_memr, {0xA2U}, {OPT::memHL, OPT::imm2}}},
    // SET1 [HL].3
    {0x71U, {RL78::SET1_memr, {0xB2U}, {OPT::memHL, OPT::imm3}}},
    // SET1 [HL].4
    {0x71U, {RL78::SET1_memr, {0xC2U}, {OPT::memHL, OPT::imm4}}},
    // SET1 [HL].5
    {0x71U, {RL78::SET1_memr, {0xD2U}, {OPT::memHL, OPT::imm5}}},
    // SET1 [HL].6
    {0x71U, {RL78::SET1_memr, {0xE2U}, {OPT::memHL, OPT::imm6}}},
    // SET1 [HL].7
    {0x71U, {RL78::SET1_memr, {0xF2U}, {OPT::memHL, OPT::imm7}}},
    // SET1 A.0
    {0x71U, {RL78::SET1_A, {0x8AU}, {RL78::R1, RL78::R1, OPT::imm0}}},
    // SET1 A.1
    {0x71U, {RL78::SET1_A, {0x9AU}, {RL78::R1, RL78::R1, OPT::imm1}}},
    // SET1 A.2
    {0x71U, {RL78::SET1_A, {0xAAU}, {RL78::R1, RL78::R1, OPT::imm2}}},
    // SET1 A.3
    {0x71U, {RL78::SET1_A, {0xBAU}, {RL78::R1, RL78::R1, OPT::imm3}}},
    // SET1 A.4
    {0x71U, {RL78::SET1_A, {0xCAU}, {RL78::R1, RL78::R1, OPT::imm4}}},
    // SET1 A.5
    {0x71U, {RL78::SET1_A, {0xDAU}, {RL78::R1, RL78::R1, OPT::imm5}}},
    // SET1 A.6
    {0x71U, {RL78::SET1_A, {0xEAU}, {RL78::R1, RL78::R1, OPT::imm6}}},
    // SET1 A.7
    {0x71U, {RL78::SET1_A, {0xFAU}, {RL78::R1, RL78::R1, OPT::imm7}}},
    // SET1 saddr.0
    {0x71U, {RL78::SET1_saddr, {0x2U, SBP::saddr}, {OPT::saddr, OPT::imm0}}},
    // SET1 saddr.1
    {0x71U, {RL78::SET1_saddr, {0x12U, SBP::saddr}, {OPT::saddr, OPT::imm1}}},
    // SET1 saddr.2
    {0x71U, {RL78::SET1_saddr, {0x22U, SBP::saddr}, {OPT::saddr, OPT::imm2}}},
    // SET1 saddr.3
    {0x71U, {RL78::SET1_saddr, {0x32U, SBP::saddr}, {OPT::saddr, OPT::imm3}}},
    // SET1 saddr.4
    {0x71U, {RL78::SET1_saddr, {0x42U, SBP::saddr}, {OPT::saddr, OPT::imm4}}},
    // SET1 saddr.5
    {0x71U, {RL78::SET1_saddr, {0x52U, SBP::saddr}, {OPT::saddr, OPT::imm5}}},
    // SET1 saddr.6
    {0x71U, {RL78::SET1_saddr, {0x62U, SBP::saddr}, {OPT::saddr, OPT::imm6}}},
    // SET1 saddr.7
    {0x71U, {RL78::SET1_saddr, {0x72U, SBP::saddr}, {OPT::saddr, OPT::imm7}}},
    // SET1 ES:!addr16.0
    {0x11U, {RL78::SET1_esaddr16, {0x71U, 0x0U, SBP::adrl, SBP::adrh}, {OPT::ES_I_addr16,OPT::imm0}}},
    // SET1 ES:!addr16.1
    {0x11U, {RL78::SET1_esaddr16, {0x71U, 0x10U, SBP::adrl, SBP::adrh}, {OPT::ES_I_addr16,OPT::imm1}}},
    // SET1 ES:!addr16.2
    {0x11U, {RL78::SET1_esaddr16, {0x71U, 0x20U, SBP::adrl, SBP::adrh}, {OPT::ES_I_addr16,OPT::imm2}}},
    // SET1 ES:!addr16.3
    {0x11U, {RL78::SET1_esaddr16, {0x71U, 0x30U, SBP::adrl, SBP::adrh}, {OPT::ES_I_addr16,OPT::imm3}}},
    // SET1 ES:!addr16.4
    {0x11U, {RL78::SET1_esaddr16, {0x71U, 0x40U, SBP::adrl, SBP::adrh}, {OPT::ES_I_addr16,OPT::imm4}}},
    // SET1 ES:!addr16.5
    {0x11U, {RL78::SET1_esaddr16, {0x71U, 0x50U, SBP::adrl, SBP::adrh}, {OPT::ES_I_addr16,OPT::imm5}}},
    // SET1 ES:!addr16.6
    {0x11U, {RL78::SET1_esaddr16, {0x71U, 0x60U, SBP::adrl, SBP::adrh}, {OPT::ES_I_addr16,OPT::imm6}}},
    // SET1 ES:!addr16.7
    {0x11U, {RL78::SET1_esaddr16, {0x71U, 0x70U, SBP::adrl, SBP::adrh}, {OPT::ES_I_addr16,OPT::imm7}}},
    // SET1 ES:[HL].0
    {0x11U, {RL78::SET1_esmemr, {0x71U, 0x82U}, {OPT::ES_memHL,OPT::imm0}}},
    // SET1 ES:[HL].1
