ksekimoto/llvm-project/llvm/lib/Target/RL78/Disassembler/RL78Disassembler.cpp
    {0x11U, {RL78::SET1_esmemr, {0x71U, 0x92U}, {OPT::ES_memHL,OPT::imm1}}},
    // SET1 ES:[HL].2
    {0x11U, {RL78::SET1_esmemr, {0x71U, 0xA2U}, {OPT::ES_memHL,OPT::imm2}}},
    // SET1 ES:[HL].3
    {0x11U, {RL78::SET1_esmemr, {0x71U, 0xB2U}, {OPT::ES_memHL,OPT::imm3}}},
    // SET1 ES:[HL].4
    {0x11U, {RL78::SET1_esmemr, {0x71U, 0xC2U}, {OPT::ES_memHL,OPT::imm4}}},
    // SET1 ES:[HL].5
    {0x11U, {RL78::SET1_esmemr, {0x71U, 0xD2U}, {OPT::ES_memHL,OPT::imm5}}},
    // SET1 ES:[HL].6
    {0x11U, {RL78::SET1_esmemr, {0x71U, 0xE2U}, {OPT::ES_memHL,OPT::imm6}}},
    // SET1 ES:[HL].7
    {0x11U, {RL78::SET1_esmemr, {0x71U, 0xF2U}, {OPT::ES_memHL,OPT::imm7}}},
    // SET1 CY
    {0x71U, {RL78::SET1_cy, {0x80U}, {RL78::CY}}},
    // SET1 PSW.0
    {0x71U, {RL78::SET1_PSW, {0x0AU, 0xFAU}, {RL78::PSW, RL78::PSW, OPT::imm0}}},
    // SET1 PSW.1
    {0x71U, {RL78::SET1_PSW, {0x1AU, 0xFAU}, {RL78::PSW, RL78::PSW, OPT::imm1}}},
    // SET1 PSW.2
    {0x71U, {RL78::SET1_PSW, {0x2AU, 0xFAU}, {RL78::PSW, RL78::PSW, OPT::imm2}}},
    // SET1 PSW.3
    {0x71U, {RL78::SET1_PSW, {0x3AU, 0xFAU}, {RL78::PSW, RL78::PSW, OPT::imm3}}},
    // SET1 PSW.4
    {0x71U, {RL78::SET1_PSW, {0x4AU, 0xFAU}, {RL78::PSW, RL78::PSW, OPT::imm4}}},
    // SET1 PSW.5
    {0x71U, {RL78::SET1_PSW, {0x5AU, 0xFAU}, {RL78::PSW, RL78::PSW, OPT::imm5}}},
    // SET1 PSW.6
    {0x71U, {RL78::SET1_PSW, {0x6AU, 0xFAU}, {RL78::PSW, RL78::PSW, OPT::imm6}}},
    // SET1 PSW.7
    //{0x71U, {RL78::SET1_PSW, {0x7AU, 0xFAU}, {RL78::PSW, RL78::PSW, OPT::imm7}}}, - we print EI instead
    // SET1 sfr.0
    {0x71U, {RL78::SET1_sfr, {0x0AU, SBP::sfr}, {OPT::sfr,OPT::imm0}}},
    // SET1 sfr.1
    {0x71U, {RL78::SET1_sfr, {0x1AU, SBP::sfr}, {OPT::sfr,OPT::imm1}}},
    // SET1 sfr.2
    {0x71U, {RL78::SET1_sfr, {0x2AU, SBP::sfr}, {OPT::sfr,OPT::imm2}}},
    // SET1 sfr.3
    {0x71U, {RL78::SET1_sfr, {0x3AU, SBP::sfr}, {OPT::sfr,OPT::imm3}}},
    // SET1 sfr.4
    {0x71U, {RL78::SET1_sfr, {0x4AU, SBP::sfr}, {OPT::sfr,OPT::imm4}}},
    // SET1 sfr.5
    {0x71U, {RL78::SET1_sfr, {0x5AU, SBP::sfr}, {OPT::sfr,OPT::imm5}}},
    // SET1 sfr.6
    {0x71U, {RL78::SET1_sfr, {0x6AU, SBP::sfr}, {OPT::sfr,OPT::imm6}}},
    // SET1 sfr.7
    {0x71U, {RL78::SET1_sfr, {0x7AU, SBP::sfr}, {OPT::sfr,OPT::imm7}}},
    // SHL A,1
    {0x31U, {RL78::SHL_r_imm, {0x19U}, {RL78::R1, RL78::R1, OPT::imm1}}},
    // SHL A,2
    {0x31U, {RL78::SHL_r_imm, {0x29U}, {RL78::R1, RL78::R1, OPT::imm2}}},
    // SHL A,3
    {0x31U, {RL78::SHL_r_imm, {0x39U}, {RL78::R1, RL78::R1, OPT::imm3}}},
    // SHL A,4
    {0x31U, {RL78::SHL_r_imm, {0x49U}, {RL78::R1, RL78::R1, OPT::imm4}}},
    // SHL A,5
    {0x31U, {RL78::SHL_r_imm, {0x59U}, {RL78::R1, RL78::R1, OPT::imm5}}},
    // SHL A,6
    {0x31U, {RL78::SHL_r_imm, {0x69U}, {RL78::R1, RL78::R1, OPT::imm6}}},
    // SHL A,7
    {0x31U, {RL78::SHL_r_imm, {0x79U}, {RL78::R1, RL78::R1, OPT::imm7}}},
    // SHL B,1
    {0x31U, {RL78::SHL_r_imm, {0x18U}, {RL78::R3, RL78::R3, OPT::imm1}}},
    // SHL B,2
    {0x31U, {RL78::SHL_r_imm, {0x28U}, {RL78::R3, RL78::R3, OPT::imm2}}},
    // SHL B,3
    {0x31U, {RL78::SHL_r_imm, {0x38U}, {RL78::R3, RL78::R3, OPT::imm3}}},
    // SHL B,4
    {0x31U, {RL78::SHL_r_imm, {0x48U}, {RL78::R3, RL78::R3, OPT::imm4}}},
    // SHL B,5
    {0x31U, {RL78::SHL_r_imm, {0x58U}, {RL78::R3, RL78::R3, OPT::imm5}}},
    // SHL B,6
    {0x31U, {RL78::SHL_r_imm, {0x68U}, {RL78::R3, RL78::R3, OPT::imm6}}},
    // SHL B,7
    {0x31U, {RL78::SHL_r_imm, {0x78U}, {RL78::R3, RL78::R3, OPT::imm7}}},
    // SHL C,1
    {0x31U, {RL78::SHL_r_imm, {0x17U}, {RL78::R2, RL78::R2, OPT::imm1}}},
    // SHL C,2
    {0x31U, {RL78::SHL_r_imm, {0x27U}, {RL78::R2, RL78::R2, OPT::imm2}}},
    // SHL C,3
    {0x31U, {RL78::SHL_r_imm, {0x37U}, {RL78::R2, RL78::R2, OPT::imm3}}},
    // SHL C,4
    {0x31U, {RL78::SHL_r_imm, {0x47U}, {RL78::R2, RL78::R2, OPT::imm4}}},
    // SHL C,5
    {0x31U, {RL78::SHL_r_imm, {0x57U}, {RL78::R2, RL78::R2, OPT::imm5}}},
    // SHL C,6
    {0x31U, {RL78::SHL_r_imm, {0x67U}, {RL78::R2, RL78::R2, OPT::imm6}}},
    // SHL C,7
    {0x31U, {RL78::SHL_r_imm, {0x77U}, {RL78::R2, RL78::R2, OPT::imm7}}},
    // SHLW AX,1
    {0x31U, {RL78::SHLW_rp_imm, {0x1DU}, {RL78::RP0, RL78::RP0, OPT::imm1}}},
    // SHLW AX,10
    {0x31U, {RL78::SHLW_rp_imm, {0xADU}, {RL78::RP0, RL78::RP0, OPT::imm10}}},
    // SHLW AX,11
    {0x31U, {RL78::SHLW_rp_imm, {0xBDU}, {RL78::RP0, RL78::RP0, OPT::imm11}}},
    // SHLW AX,12
    {0x31U, {RL78::SHLW_rp_imm, {0xCDU}, {RL78::RP0, RL78::RP0, OPT::imm12}}},
    // SHLW AX,13
    {0x31U, {RL78::SHLW_rp_imm, {0xDDU}, {RL78::RP0, RL78::RP0, OPT::imm13}}},
    // SHLW AX,14
    {0x31U, {RL78::SHLW_rp_imm, {0xEDU}, {RL78::RP0, RL78::RP0, OPT::imm14}}},
    // SHLW AX,15
    {0x31U, {RL78::SHLW_rp_imm, {0xFDU}, {RL78::RP0, RL78::RP0, OPT::imm15}}},
    // SHLW AX,2
    {0x31U, {RL78::SHLW_rp_imm, {0x2DU}, {RL78::RP0, RL78::RP0, OPT::imm2}}},
    // SHLW AX,3
    {0x31U, {RL78::SHLW_rp_imm, {0x3DU}, {RL78::RP0, RL78::RP0, OPT::imm3}}},
    // SHLW AX,4
    {0x31U, {RL78::SHLW_rp_imm, {0x4DU}, {RL78::RP0, RL78::RP0, OPT::imm4}}},
    // SHLW AX,5
    {0x31U, {RL78::SHLW_rp_imm, {0x5DU}, {RL78::RP0, RL78::RP0, OPT::imm5}}},
    // SHLW AX,6
    {0x31U, {RL78::SHLW_rp_imm, {0x6DU}, {RL78::RP0, RL78::RP0, OPT::imm6}}},
    // SHLW AX,7
    {0x31U, {RL78::SHLW_rp_imm, {0x7DU}, {RL78::RP0, RL78::RP0, OPT::imm7}}},
    // SHLW AX,8
    {0x31U, {RL78::SHLW_rp_imm, {0x8DU}, {RL78::RP0, RL78::RP0, OPT::imm8}}},
    // SHLW AX,9
    {0x31U, {RL78::SHLW_rp_imm, {0x9DU}, {RL78::RP0, RL78::RP0, OPT::imm9}}},
    // SHLW BC,1
    {0x31U, {RL78::SHLW_rp_imm, {0x1CU}, {RL78::RP2, RL78::RP2, OPT::imm1}}},
    // SHLW BC,10
    {0x31U, {RL78::SHLW_rp_imm, {0xACU}, {RL78::RP2, RL78::RP2, OPT::imm10}}},
    // SHLW BC,11
    {0x31U, {RL78::SHLW_rp_imm, {0xBCU}, {RL78::RP2, RL78::RP2, OPT::imm11}}},
    // SHLW BC,12
    {0x31U, {RL78::SHLW_rp_imm, {0xCCU}, {RL78::RP2, RL78::RP2, OPT::imm12}}},
    // SHLW BC,13
    {0x31U, {RL78::SHLW_rp_imm, {0xDCU}, {RL78::RP2, RL78::RP2, OPT::imm13}}},
    // SHLW BC,14
    {0x31U, {RL78::SHLW_rp_imm, {0xECU}, {RL78::RP2, RL78::RP2, OPT::imm14}}},
    // SHLW BC,15
    {0x31U, {RL78::SHLW_rp_imm, {0xFCU}, {RL78::RP2, RL78::RP2, OPT::imm15}}},
    // SHLW BC,2
    {0x31U, {RL78::SHLW_rp_imm, {0x2CU}, {RL78::RP2, RL78::RP2, OPT::imm2}}},
    // SHLW BC,3
    {0x31U, {RL78::SHLW_rp_imm, {0x3CU}, {RL78::RP2, RL78::RP2, OPT::imm3}}},
    // SHLW BC,4
    {0x31U, {RL78::SHLW_rp_imm, {0x4CU}, {RL78::RP2, RL78::RP2, OPT::imm4}}},
    // SHLW BC,5
    {0x31U, {RL78::SHLW_rp_imm, {0x5CU}, {RL78::RP2, RL78::RP2, OPT::imm5}}},
    // SHLW BC,6
    {0x31U, {RL78::SHLW_rp_imm, {0x6CU}, {RL78::RP2, RL78::RP2, OPT::imm6}}},
    // SHLW BC,7
    {0x31U, {RL78::SHLW_rp_imm, {0x7CU}, {RL78::RP2, RL78::RP2, OPT::imm7}}},
    // SHLW BC,8
    {0x31U, {RL78::SHLW_rp_imm, {0x8CU}, {RL78::RP2, RL78::RP2, OPT::imm8}}},
    // SHLW BC,9
    {0x31U, {RL78::SHLW_rp_imm, {0x9CU}, {RL78::RP2, RL78::RP2, OPT::imm9}}},
    // SHR A,1
    {0x31U, {RL78::SHR_r_i, {0x1AU}, {RL78::R1, RL78::R1, OPT::imm1}}},
    // SHR A,2
    {0x31U, {RL78::SHR_r_i, {0x2AU}, {RL78::R1, RL78::R1, OPT::imm2}}},
    // SHR A,3
    {0x31U, {RL78::SHR_r_i, {0x3AU}, {RL78::R1, RL78::R1, OPT::imm3}}},
    // SHR A,4
    {0x31U, {RL78::SHR_r_i, {0x4AU}, {RL78::R1, RL78::R1, OPT::imm4}}},
    // SHR A,5
    {0x31U, {RL78::SHR_r_i, {0x5AU}, {RL78::R1, RL78::R1, OPT::imm5}}},
    // SHR A,6
    {0x31U, {RL78::SHR_r_i, {0x6AU}, {RL78::R1, RL78::R1, OPT::imm6}}},
    // SHR A,7
    {0x31U, {RL78::SHR_r_i, {0x7AU}, {RL78::R1, RL78::R1, OPT::imm7}}},
    // SHRW AX,1
    {0x31U, {RL78::SHRW_rp_i, {0x1EU}, {RL78::RP0, RL78::RP0, OPT::imm1}}},
    // SHRW AX,10
    {0x31U, {RL78::SHRW_rp_i, {0xAEU}, {RL78::RP0, RL78::RP0, OPT::imm10}}},
    // SHRW AX,11
    {0x31U, {RL78::SHRW_rp_i, {0xBEU}, {RL78::RP0, RL78::RP0, OPT::imm11}}},
    // SHRW AX,12
    {0x31U, {RL78::SHRW_rp_i, {0xCEU}, {RL78::RP0, RL78::RP0, OPT::imm12}}},
    // SHRW AX,13
    {0x31U, {RL78::SHRW_rp_i, {0xDEU}, {RL78::RP0, RL78::RP0, OPT::imm13}}},
    // SHRW AX,14
    {0x31U, {RL78::SHRW_rp_i, {0xEEU}, {RL78::RP0, RL78::RP0, OPT::imm14}}},
    // SHRW AX,15
    {0x31U, {RL78::SHRW_rp_i, {0xFEU}, {RL78::RP0, RL78::RP0, OPT::imm15}}},
    // SHRW AX,2
    {0x31U, {RL78::SHRW_rp_i, {0x2EU}, {RL78::RP0, RL78::RP0, OPT::imm2}}},
    // SHRW AX,3
    {0x31U, {RL78::SHRW_rp_i, {0x3EU}, {RL78::RP0, RL78::RP0, OPT::imm3}}},
    // SHRW AX,4
    {0x31U, {RL78::SHRW_rp_i, {0x4EU}, {RL78::RP0, RL78::RP0, OPT::imm4}}},
    // SHRW AX,5
    {0x31U, {RL78::SHRW_rp_i, {0x5EU}, {RL78::RP0, RL78::RP0, OPT::imm5}}},
    // SHRW AX,6
    {0x31U, {RL78::SHRW_rp_i, {0x6EU}, {RL78::RP0, RL78::RP0, OPT::imm6}}},
    // SHRW AX,7
    {0x31U, {RL78::SHRW_rp_i, {0x7EU}, {RL78::RP0, RL78::RP0, OPT::imm7}}},
    // SHRW AX,8
    {0x31U, {RL78::SHRW_rp_i, {0x8EU}, {RL78::RP0, RL78::RP0, OPT::imm8}}},
    // SHRW AX,9
    {0x31U, {RL78::SHRW_rp_i, {0x9EU}, {RL78::RP0, RL78::RP0, OPT::imm9}}},
    // SKC nan
    {0x61U, {RL78::SK_cc_nodst, {0xC8U}, {OPT::RL78CC_C}}},
    // SKH nan
    {0x61U, {RL78::SK_cc_nodst, {0xE3U}, {OPT::RL78CC_H}}},
    // SKNC nan
    {0x61U, {RL78::SK_cc_nodst, {0xD8U}, {OPT::RL78CC_NC}}},
    // SKNH nan
    {0x61U, {RL78::SK_cc_nodst, {0xF3U}, {OPT::RL78CC_NH}}},
    // SKNZ nan
    {0x61U, {RL78::SK_cc_nodst, {0xF8U}, {OPT::RL78CC_NZ}}},
    // SKZ nan
    {0x61U, {RL78::SK_cc_nodst, {0xE8U}, {OPT::RL78CC_Z}}},
    // STOP nan
    {0x61U, {RL78::STOP, {0xFDU}, {}}},
    // SUB A,!addr16
    {0x2FU, {RL78::SUB_r_abs16, {SBP::adrl, SBP::adrh}, {RL78::R1, RL78::R1, OPT::I_addr16}}},
    // SUB saddr,#byte
    {0x2AU, {RL78::SUB_saddr_imm, {SBP::saddr, SBP::data}, {OPT::saddr, OPT::byte}}},
    // SUB A,#byte
    {0x2CU, {RL78::SUB_r_imm, {SBP::data}, {RL78::R1, RL78::R1, OPT::byte}}},
    // SUB A,[HL]
    {0x2DU, {RL78::SUB_r_memri, {}, {RL78::R1, RL78::R1, OPT::memHL0}}},
    // SUB A,[HL+byte]
    {0x2EU, {RL78::SUB_r_memri, {SBP::adr}, {RL78::R1, RL78::R1, OPT::memHL_byte}}},
    // SUB A,[HL+B]
    {0x61U, {RL78::SUB_r_memrr, {0xA0U}, {RL78::R1, RL78::R1, OPT::memHL_B}}},
    // SUB A,[HL+C]
    {0x61U, {RL78::SUB_r_memrr, {0xA2U}, {RL78::R1, RL78::R1, OPT::memHL_C}}},
    // SUB A,A
    {0x61U, {RL78::SUB_r_r, {0x21U}, {RL78::R1, RL78::R1, RL78::R1}}},
    // SUB A,B
    {0x61U, {RL78::SUB_r_r, {0x2BU}, {RL78::R1, RL78::R1, RL78::R3}}},
    // SUB A,C
    {0x61U, {RL78::SUB_r_r, {0x2AU}, {RL78::R1, RL78::R1, RL78::R2}}},
    // SUB A,D
    {0x61U, {RL78::SUB_r_r, {0x2DU}, {RL78::R1, RL78::R1, RL78::R5}}},
    // SUB A,E
    {0x61U, {RL78::SUB_r_r, {0x2CU}, {RL78::R1, RL78::R1, RL78::R4}}},
    // SUB A,H
    {0x61U, {RL78::SUB_r_r, {0x2FU}, {RL78::R1, RL78::R1, RL78::R7}}},
    // SUB A,L
    {0x61U, {RL78::SUB_r_r, {0x2EU}, {RL78::R1, RL78::R1, RL78::R6}}},
    // SUB A,X
    {0x61U, {RL78::SUB_r_r, {0x28U}, {RL78::R1, RL78::R1, RL78::R0}}},
    // SUB B,A
    {0x61U, {RL78::SUB_r_r, {0x23U}, {RL78::R3, RL78::R3, RL78::R1}}},
    // SUB C,A
    {0x61U, {RL78::SUB_r_r, {0x22U}, {RL78::R2, RL78::R2, RL78::R1}}},
    // SUB D,A
    {0x61U, {RL78::SUB_r_r, {0x25U}, {RL78::R5, RL78::R5, RL78::R1}}},
    // SUB E,A
    {0x61U, {RL78::SUB_r_r, {0x24U}, {RL78::R4, RL78::R4, RL78::R1}}},
    // SUB H,A
    {0x61U, {RL78::SUB_r_r, {0x27U}, {RL78::R7, RL78::R7, RL78::R1}}},
    // SUB L,A
    {0x61U, {RL78::SUB_r_r, {0x26U}, {RL78::R6, RL78::R6, RL78::R1}}},
    // SUB X,A
    {0x61U, {RL78::SUB_r_r, {0x20U}, {RL78::R0, RL78::R0, RL78::R1}}},
    // SUB A,saddr
    {0x2BU, {RL78::SUB_r_saddr, {SBP::saddr}, {RL78::R1, RL78::R1, OPT::saddr}}},
    // SUB A,ES:!addr16
    {0x11U, {RL78::SUB_r_esaddr16, {0x2FU, SBP::adrl, SBP::adrh}, {RL78::R1,RL78::R1,OPT::ES_I_addr16}}},
    // SUB A,ES:[HL]
    {0x11U, {RL78::SUB_r_esmemHL, {0x2DU}, {RL78::R1,RL78::R1,OPT::ES_memHL0}}},
    // SUB A,ES:[HL+B]
    {0x11U, {RL78::SUB_r_esmemRpr, {0x61U, 0xA0U}, {RL78::R1,RL78::R1,OPT::ES_memHL_B}}},
    // SUB A,ES:[HL+byte]
    {0x11U, {RL78::SUB_r_esmemHLi, {0x2EU, SBP::adr}, {RL78::R1,RL78::R1,OPT::ES_memHL_byte}}},
    // SUB A,ES:[HL+C]
    {0x11U, {RL78::SUB_r_esmemRpr, {0x61U, 0xA2U}, {RL78::R1,RL78::R1,OPT::ES_memHL_C}}},
    // SUBC A,!addr16
    {0x3FU, {RL78::SUBC_r_abs16, {SBP::adrl, SBP::adrh}, {RL78::R1, RL78::R1, OPT::I_addr16}}},
    // SUBC saddr,#byte
    {0x3AU, {RL78::SUBC_saddr_imm, {SBP::saddr, SBP::data}, {OPT::saddr, OPT::byte}}},
    // SUBC A,#byte
    {0x3CU, {RL78::SUBC_A_imm, {SBP::data}, {RL78::R1, RL78::R1, OPT::byte}}},
    // SUBC A,[HL]
    {0x3DU, {RL78::SUBC_r_memri, {}, {RL78::R1, RL78::R1, OPT::memHL0}}},
    // SUBC A,[HL+byte]
    {0x3EU, {RL78::SUBC_r_memri, {SBP::adr}, {RL78::R1, RL78::R1, OPT::memHL_byte}}},
    // SUBC A,[HL+B]
    {0x61U, {RL78::SUBC_r_memrr, {0xB0U}, {RL78::R1, RL78::R1, OPT::memHL_B}}},
    // SUBC A,[HL+C]
    {0x61U, {RL78::SUBC_r_memrr, {0xB2U}, {RL78::R1, RL78::R1, OPT::memHL_C}}},
    // SUBC A,A
    {0x61U, {RL78::SUBC_r_r, {0x31U}, {RL78::R1, RL78::R1, RL78::R1}}},
    // SUBC A,B
    {0x61U, {RL78::SUBC_r_r, {0x3BU}, {RL78::R1, RL78::R1, RL78::R3}}},
    // SUBC A,C
    {0x61U, {RL78::SUBC_r_r, {0x3AU}, {RL78::R1, RL78::R1, RL78::R2}}},
    // SUBC A,D
    {0x61U, {RL78::SUBC_r_r, {0x3DU}, {RL78::R1, RL78::R1, RL78::R5}}},
    // SUBC A,E
    {0x61U, {RL78::SUBC_r_r, {0x3CU}, {RL78::R1, RL78::R1, RL78::R4}}},
    // SUBC A,H
    {0x61U, {RL78::SUBC_r_r, {0x3FU}, {RL78::R1, RL78::R1, RL78::R7}}},
    // SUBC A,L
    {0x61U, {RL78::SUBC_r_r, {0x3EU}, {RL78::R1, RL78::R1, RL78::R6}}},
    // SUBC A,X
    {0x61U, {RL78::SUBC_r_r, {0x38U}, {RL78::R1, RL78::R1, RL78::R0}}},
    // SUBC B,A
    {0x61U, {RL78::SUBC_r_r, {0x33U}, {RL78::R3, RL78::R3, RL78::R1}}},
    // SUBC C,A
    {0x61U, {RL78::SUBC_r_r, {0x32U}, {RL78::R2, RL78::R2, RL78::R1}}},
    // SUBC D,A
    {0x61U, {RL78::SUBC_r_r, {0x35U}, {RL78::R5, RL78::R5, RL78::R1}}},
    // SUBC E,A
    {0x61U, {RL78::SUBC_r_r, {0x34U}, {RL78::R4, RL78::R4, RL78::R1}}},
    // SUBC H,A
    {0x61U, {RL78::SUBC_r_r, {0x37U}, {RL78::R7, RL78::R7, RL78::R1}}},
    // SUBC L,A
    {0x61U, {RL78::SUBC_r_r, {0x36U}, {RL78::R6, RL78::R6, RL78::R1}}},
    // SUBC X,A
    {0x61U, {RL78::SUBC_r_r, {0x30U}, {RL78::R0, RL78::R0, RL78::R1}}},
    // SUBC A,saddr
    {0x3BU, {RL78::SUBC_r_saddr, {SBP::saddr}, {RL78::R1, RL78::R1, OPT::saddr}}},
    // SUBC A,ES:!addr16
    {0x11U, {RL78::SUBC_r_esaddr16, {0x3FU, SBP::adrl, SBP::adrh}, {RL78::R1,RL78::R1,OPT::ES_I_addr16}}},
    // SUBC A,ES:[HL]
    {0x11U, {RL78::SUBC_r_esmemHL, {0x3DU}, {RL78::R1,RL78::R1,OPT::ES_memHL0}}},
    // SUBC A,ES:[HL+B]
    {0x11U, {RL78::SUBC_r_esmemRpr, {0x61U, 0xB0U}, {RL78::R1,RL78::R1,OPT::ES_memHL_B}}},
    // SUBC A,ES:[HL+byte]
    {0x11U, {RL78::SUBC_r_esmemHLi, {0x3EU, SBP::adr}, {RL78::R1,RL78::R1,OPT::ES_memHL_byte}}},
    // SUBC A,ES:[HL+C]
    {0x11U, {RL78::SUBC_r_esmemRpr, {0x61U, 0xB2U}, {RL78::R1,RL78::R1,OPT::ES_memHL_C}}},
    // SUBW AX,#word
    {0x24U, {RL78::SUBW_rp_imm, {SBP::datal, SBP::datah}, {RL78::RP0, RL78::RP0, OPT::word}}},
    // SUBW AX,!addr16
    {0x22U, {RL78::SUBW_rp_abs16, {SBP::adrl, SBP::adrh}, {RL78::RP0, RL78::RP0, OPT::I_addr16}}},
    // SUBW AX,[HL+byte]
    {0x61U, {RL78::SUBW_rp_memri, {0x29U, SBP::adr}, {RL78::RP0, RL78::RP0, OPT::memHL_byte}}},
    // SUBW AX,BC
    {0x23U, {RL78::SUBW_rp_rp, {}, {RL78::RP0, RL78::RP0, RL78::RP2}}},
    // SUBW AX,DE
    {0x25U, {RL78::SUBW_rp_rp, {}, {RL78::RP0, RL78::RP0, RL78::RP4}}},
    // SUBW AX,saddrp
    {0x26U, {RL78::SUBW_rp_saddr, {SBP::saddr}, {RL78::RP0, RL78::RP0, OPT::saddrp}}},
    // SUBW AX,HL
    {0x27U, {RL78::SUBW_rp_rp, {}, {RL78::RP0, RL78::RP0, RL78::RP6}}},
    // SUBW SP,#byte
    {0x20U, {RL78::SUBW_sp_imm, {SBP::data}, {RL78::SPreg, RL78::SPreg, OPT::byte}}},
    // SUBW AX,ES:!addr16
    {0x11U, {RL78::SUBW_rp_esaddr16, {0x22U, SBP::adrl, SBP::adrh}, {RL78::RP0,RL78::RP0,OPT::ES_I_addr16}}},
    // SUBW AX,ES:[HL+byte]
    {0x11U, {RL78::SUBW_rp_esmemHLi, {0x61U, 0x29U, SBP::adr}, {RL78::RP0,RL78::RP0,OPT::ES_memHL_byte}}},
    // XCH A,!addr16
    {0x61U, {RL78::XCH_A_abs16, {0xAAU, SBP::adrl, SBP::adrh}, {RL78::R1, RL78::R1, OPT::I_addr16}}},
    // XCH A,[DE]
    {0x61U, {RL78::XCH_A_memri, {0xAEU}, {RL78::R1, RL78::R1, OPT::memDE}}},
    // XCH A,[DE+byte]
    {0x61U, {RL78::XCH_A_memri, {0xAFU, SBP::adr}, {RL78::R1, RL78::R1, OPT::memDE_byte}}},
    // XCH A,[HL]
    {0x61U, {RL78::XCH_A_memri, {0xACU}, {RL78::R1, RL78::R1, OPT::memHL0}}},
    // XCH A,[HL+byte]
    {0x61U, {RL78::XCH_A_memri, {0xADU, SBP::adr}, {RL78::R1, RL78::R1, OPT::memHL_byte}}},
    // XCH A,[HL+B]
    {0x61U, {RL78::XCH_A_memrr, {0xB9U}, {RL78::R1, RL78::R1, OPT::memHL_B}}},
    // XCH A,[HL+C]
    {0x61U, {RL78::XCH_A_memrr, {0xA9U}, {RL78::R1, RL78::R1, OPT::memHL_C}}},
    // XCH A,X
    {0x8U, {RL78::XCH_A_r, {}, {RL78::R1, RL78::R0, RL78::R1, RL78::R0}}},
    // XCH A,B
    {0x61U, {RL78::XCH_A_r, {0x8BU}, {RL78::R1, RL78::R3, RL78::R1, RL78::R3}}},
    // XCH A,C
    {0x61U, {RL78::XCH_A_r, {0x8AU}, {RL78::R1, RL78::R2, RL78::R1, RL78::R2}}},
    // XCH A,D
    {0x61U, {RL78::XCH_A_r, {0x8DU}, {RL78::R1, RL78::R5, RL78::R1, RL78::R5}}},
    // XCH A,E
    {0x61U, {RL78::XCH_A_r, {0x8CU}, {RL78::R1, RL78::R4, RL78::R1, RL78::R4}}},
    // XCH A,H
    {0x61U, {RL78::XCH_A_r, {0x8FU}, {RL78::R1, RL78::R7, RL78::R1, RL78::R7}}},
    // XCH A,L
    {0x61U, {RL78::XCH_A_r, {0x8EU}, {RL78::R1, RL78::R6, RL78::R1, RL78::R6}}},
    // XCH A,saddr
    {0x61U, {RL78::XCH_A_saddrabs, {0xA8U, SBP::saddr}, {RL78::R1, RL78::R1, OPT::saddr}}},
    // XCH A,ES:!addr16
    {0x11U, {RL78::XCH_A_esaddr16, {0x61U, 0xAAU, SBP::adrl, SBP::adrh}, {RL78::R1,RL78::R1,OPT::ES_I_addr16}}},
    // XCH A,ES:[DE]
    {0x11U, {RL78::XCH_A_esmemDE, {0x61U, 0xAEU}, {RL78::R1,RL78::R1,OPT::ES_memDE}}},
    // XCH A,ES:[DE+byte]
    {0x11U, {RL78::XCH_A_esmemRpi, {0x61U, 0xAFU, SBP::adr}, {RL78::R1,RL78::R1,OPT::ES_memDE_byte}}},
    // XCH A,ES:[HL]
    {0x11U, {RL78::XCH_A_esmemHL, {0x61U, 0xACU}, {RL78::R1,RL78::R1,OPT::ES_memHL0}}},
    // XCH A,ES:[HL+B]
    {0x11U, {RL78::XCH_A_esmemRpr, {0x61U, 0xB9U}, {RL78::R1,RL78::R1,OPT::ES_memHL_B}}},
    // XCH A,ES:[HL+byte]
    {0x11U, {RL78::XCH_A_esmemRpi, {0x61U, 0xADU, SBP::adr}, {RL78::R1,RL78::R1,OPT::ES_memHL_byte}}},
    // XCH A,ES:[HL+C]
    {0x11U, {RL78::XCH_A_esmemRpr, {0x61U, 0xA9U}, {RL78::R1,RL78::R1,OPT::ES_memHL_C}}},
    // XCH A,sfr
    {0x61U, {RL78::XCH_A_sfr, {0xABU, SBP::sfr}, {RL78::R1,OPT::sfr,RL78::R1,OPT::sfr}}},
    // XCHW AX,BC
    {0x33U, {RL78::XCHW_AX_rp, {}, {RL78::RP0, RL78::RP2, RL78::RP0, RL78::RP2}}},
    // XCHW AX,DE
    {0x35U, {RL78::XCHW_AX_rp, {}, {RL78::RP0, RL78::RP4, RL78::RP0, RL78::RP4}}},
    // XCHW AX,HL
    {0x37U, {RL78::XCHW_AX_rp, {}, {RL78::RP0, RL78::RP6, RL78::RP0, RL78::RP6}}},
    // XOR A,!addr16
    {0x7FU, {RL78::XOR_r_abs16, {SBP::adrl, SBP::adrh}, {RL78::R1, RL78::R1, OPT::I_addr16}}},
    // XOR saddr,#byte
    {0x7AU, {RL78::XOR_saddr_imm, {SBP::saddr, SBP::data}, {OPT::saddr, OPT::byte}}},
    // XOR A,#byte
    {0x7CU, {RL78::XOR_r_imm, {SBP::data}, {RL78::R1, RL78::R1, OPT::byte}}},
    // XOR A,[HL]
    {0x7DU, {RL78::XOR_r_memri, {}, {RL78::R1, RL78::R1, OPT::memHL0}}},
    // XOR A,[HL+byte]
    {0x7EU, {RL78::XOR_r_memri, {SBP::adr}, {RL78::R1, RL78::R1, OPT::memHL_byte}}},
    // XOR A,[HL+B]
    {0x61U, {RL78::XOR_r_memrr, {0xF0U}, {RL78::R1, RL78::R1, OPT::memHL_B}}},
    // XOR A,[HL+C]
    {0x61U, {RL78::XOR_r_memrr, {0xF2U}, {RL78::R1, RL78::R1, OPT::memHL_C}}},
    // XOR A,A
    {0x61U, {RL78::XOR_r_r, {0x71U}, {RL78::R1, RL78::R1, RL78::R1}}},
    // XOR A,B
    {0x61U, {RL78::XOR_r_r, {0x7BU}, {RL78::R1, RL78::R1, RL78::R3}}},
    // XOR A,C
    {0x61U, {RL78::XOR_r_r, {0x7AU}, {RL78::R1, RL78::R1, RL78::R2}}},
    // XOR A,D
    {0x61U, {RL78::XOR_r_r, {0x7DU}, {RL78::R1, RL78::R1, RL78::R5}}},
    // XOR A,E
    {0x61U, {RL78::XOR_r_r, {0x7CU}, {RL78::R1, RL78::R1, RL78::R4}}},
    // XOR A,H
    {0x61U, {RL78::XOR_r_r, {0x7FU}, {RL78::R1, RL78::R1, RL78::R7}}},
    // XOR A,L
    {0x61U, {RL78::XOR_r_r, {0x7EU}, {RL78::R1, RL78::R1, RL78::R6}}},
    // XOR A,X
    {0x61U, {RL78::XOR_r_r, {0x78U}, {RL78::R1, RL78::R1, RL78::R0}}},
    // XOR B,A
    {0x61U, {RL78::XOR_r_r, {0x73U}, {RL78::R3, RL78::R3, RL78::R1}}},
    // XOR C,A
    {0x61U, {RL78::XOR_r_r, {0x72U}, {RL78::R2, RL78::R2, RL78::R1}}},
    // XOR D,A
    {0x61U, {RL78::XOR_r_r, {0x75U}, {RL78::R5, RL78::R5, RL78::R1}}},
    // XOR E,A
    {0x61U, {RL78::XOR_r_r, {0x74U}, {RL78::R4, RL78::R4, RL78::R1}}},
    // XOR H,A
    {0x61U, {RL78::XOR_r_r, {0x77U}, {RL78::R7, RL78::R7, RL78::R1}}},
    // XOR L,A
    {0x61U, {RL78::XOR_r_r, {0x76U}, {RL78::R6, RL78::R6, RL78::R1}}},
    // XOR X,A
    {0x61U, {RL78::XOR_r_r, {0x70U}, {RL78::R0, RL78::R0, RL78::R1}}},
    // XOR A,saddr
    {0x7BU, {RL78::XOR_r_saddr, {SBP::saddr}, {RL78::R1, RL78::R1, OPT::saddr}}},
    // XOR A,ES:!addr16
    {0x11U, {RL78::XOR_r_esaddr16, {0x7FU, SBP::adrl, SBP::adrh}, {RL78::R1,RL78::R1,OPT::ES_I_addr16}}},
    // XOR A,ES:[HL]
    {0x11U, {RL78::XOR_r_esmemHL, {0x7DU}, {RL78::R1,RL78::R1,OPT::ES_memHL0}}},
    // XOR A,ES:[HL+B]
    {0x11U, {RL78::XOR_r_esmemRpr, {0x61U, 0xF0U}, {RL78::R1,RL78::R1,OPT::ES_memHL_B}}},
    // XOR A,ES:[HL+byte]
    {0x11U, {RL78::XOR_r_esmemHLi, {0x7EU, SBP::adr}, {RL78::R1,RL78::R1,OPT::ES_memHL_byte}}},
    // XOR A,ES:[HL+C]
    {0x11U, {RL78::XOR_r_esmemRpr, {0x61U, 0xF2U}, {RL78::R1,RL78::R1,OPT::ES_memHL_C}}},
    // XOR1 CY,[HL].0
    {0x71U, {RL78::XOR1_cy_memr, {0x87U}, {OPT::memHL, OPT::imm0}}},
    // XOR1 CY,[HL].1
    {0x71U, {RL78::XOR1_cy_memr, {0x97U}, {OPT::memHL, OPT::imm1}}},
    // XOR1 CY,[HL].2
    {0x71U, {RL78::XOR1_cy_memr, {0xA7U}, {OPT::memHL, OPT::imm2}}},
    // XOR1 CY,[HL].3
    {0x71U, {RL78::XOR1_cy_memr, {0xB7U}, {OPT::memHL, OPT::imm3}}},
    // XOR1 CY,[HL].4
    {0x71U, {RL78::XOR1_cy_memr, {0xC7U}, {OPT::memHL, OPT::imm4}}},
    // XOR1 CY,[HL].5
    {0x71U, {RL78::XOR1_cy_memr, {0xD7U}, {OPT::memHL, OPT::imm5}}},
    // XOR1 CY,[HL].6
    {0x71U, {RL78::XOR1_cy_memr, {0xE7U}, {OPT::memHL, OPT::imm6}}},
    // XOR1 CY,[HL].7
    {0x71U, {RL78::XOR1_cy_memr, {0xF7U}, {OPT::memHL, OPT::imm7}}},
    // XOR1 CY,A.0*/ 
    {0x71U, {RL78::XOR1_cy_r, {0x8FU}, {RL78::R1, OPT::imm0}}},
    // XOR1 CY,A.1*/ 
    {0x71U, {RL78::XOR1_cy_r, {0x9FU}, {RL78::R1, OPT::imm1}}},
    // XOR1 CY,A.2*/ 
    {0x71U, {RL78::XOR1_cy_r, {0xAFU}, {RL78::R1, OPT::imm2}}},
    // XOR1 CY,A.3*/ 
    {0x71U, {RL78::XOR1_cy_r, {0xBFU}, {RL78::R1, OPT::imm3}}},
    // XOR1 CY,A.4*/ 
    {0x71U, {RL78::XOR1_cy_r, {0xCFU}, {RL78::R1, OPT::imm4}}},
    // XOR1 CY,A.5*/ 
    {0x71U, {RL78::XOR1_cy_r, {0xDFU}, {RL78::R1, OPT::imm5}}},
    // XOR1 CY,A.6*/ 
    {0x71U, {RL78::XOR1_cy_r, {0xEFU}, {RL78::R1, OPT::imm6}}},
    // XOR1 CY,A.7*/ 
    {0x71U, {RL78::XOR1_cy_r, {0xFFU}, {RL78::R1, OPT::imm7}}},
    // XOR1 CY,saddr.0
    {0x71U, {RL78::XOR1_cy_saddrx, {0x7U, SBP::saddr}, {OPT::saddr, OPT::imm0}}},
    // XOR1 CY,saddr.1
    {0x71U, {RL78::XOR1_cy_saddrx, {0x17U, SBP::saddr}, {OPT::saddr, OPT::imm1}}},
    // XOR1 CY,saddr.2
    {0x71U, {RL78::XOR1_cy_saddrx, {0x27U, SBP::saddr}, {OPT::saddr, OPT::imm2}}},
    // XOR1 CY,saddr.3
    {0x71U, {RL78::XOR1_cy_saddrx, {0x37U, SBP::saddr}, {OPT::saddr, OPT::imm3}}},
    // XOR1 CY,saddr.4
    {0x71U, {RL78::XOR1_cy_saddrx, {0x47U, SBP::saddr}, {OPT::saddr, OPT::imm4}}},
