ksekimoto/llvm-project/llvm/lib/Target/RL78/Disassembler/RL78Disassembler.cpp
    // XOR1 CY,saddr.5
    {0x71U, {RL78::XOR1_cy_saddrx, {0x57U, SBP::saddr}, {OPT::saddr, OPT::imm5}}},
    // XOR1 CY,saddr.6
    {0x71U, {RL78::XOR1_cy_saddrx, {0x67U, SBP::saddr}, {OPT::saddr, OPT::imm6}}},
    // XOR1 CY,saddr.7
    {0x71U, {RL78::XOR1_cy_saddrx, {0x77U, SBP::saddr}, {OPT::saddr, OPT::imm7}}},
    // XOR1 CY,ES:[HL].0
    {0x11U, {RL78::XOR1_esmemr, {0x71U, 0x87U}, {RL78::CY, OPT::ES_memHL,OPT::imm0}}},
    // XOR1 CY,ES:[HL].1
    {0x11U, {RL78::XOR1_esmemr, {0x71U, 0x97U}, {RL78::CY, OPT::ES_memHL,OPT::imm1}}},
    // XOR1 CY,ES:[HL].2
    {0x11U, {RL78::XOR1_esmemr, {0x71U, 0xA7U}, {RL78::CY, OPT::ES_memHL,OPT::imm2}}},
    // XOR1 CY,ES:[HL].3
    {0x11U, {RL78::XOR1_esmemr, {0x71U, 0xB7U}, {RL78::CY, OPT::ES_memHL,OPT::imm3}}},
    // XOR1 CY,ES:[HL].4
    {0x11U, {RL78::XOR1_esmemr, {0x71U, 0xC7U}, {RL78::CY, OPT::ES_memHL,OPT::imm4}}},
    // XOR1 CY,ES:[HL].5
    {0x11U, {RL78::XOR1_esmemr, {0x71U, 0xD7U}, {RL78::CY, OPT::ES_memHL,OPT::imm5}}},
    // XOR1 CY,ES:[HL].6
    {0x11U, {RL78::XOR1_esmemr, {0x71U, 0xE7U}, {RL78::CY, OPT::ES_memHL,OPT::imm6}}},
    // XOR1 CY,ES:[HL].7
    {0x11U, {RL78::XOR1_esmemr, {0x71U, 0xF7U}, {RL78::CY, OPT::ES_memHL,OPT::imm7}}},
    // XOR1 CY,PSW.0
    {0x71U, {RL78::XOR1_cy_PSW, {0x0FU, 0xFAU}, {RL78::PSW, OPT::imm0}}},
    // XOR1 CY,PSW.1
    {0x71U, {RL78::XOR1_cy_PSW, {0x1FU, 0xFAU}, {RL78::PSW, OPT::imm1}}},
    // XOR1 CY,PSW.2
    {0x71U, {RL78::XOR1_cy_PSW, {0x2FU, 0xFAU}, {RL78::PSW, OPT::imm2}}},
    // XOR1 CY,PSW.3
    {0x71U, {RL78::XOR1_cy_PSW, {0x3FU, 0xFAU}, {RL78::PSW, OPT::imm3}}},
    // XOR1 CY,PSW.4
    {0x71U, {RL78::XOR1_cy_PSW, {0x4FU, 0xFAU}, {RL78::PSW, OPT::imm4}}},
    // XOR1 CY,PSW.5
    {0x71U, {RL78::XOR1_cy_PSW, {0x5FU, 0xFAU}, {RL78::PSW, OPT::imm5}}},
    // XOR1 CY,PSW.6
    {0x71U, {RL78::XOR1_cy_PSW, {0x6FU, 0xFAU}, {RL78::PSW, OPT::imm6}}},
    // XOR1 CY,PSW.7
    {0x71U, {RL78::XOR1_cy_PSW, {0x7FU, 0xFAU}, {RL78::PSW, OPT::imm7}}},
    // XOR1 CY,sfr.0
    {0x71U, {RL78::XOR1_cy_sfr, {0x0FU, SBP::sfr}, {OPT::sfr,OPT::imm0}}},
    // XOR1 CY,sfr.1
    {0x71U, {RL78::XOR1_cy_sfr, {0x1FU, SBP::sfr}, {OPT::sfr,OPT::imm1}}},
    // XOR1 CY,sfr.2
    {0x71U, {RL78::XOR1_cy_sfr, {0x2FU, SBP::sfr}, {OPT::sfr,OPT::imm2}}},
    // XOR1 CY,sfr.3
    {0x71U, {RL78::XOR1_cy_sfr, {0x3FU, SBP::sfr}, {OPT::sfr,OPT::imm3}}},
    // XOR1 CY,sfr.4
    {0x71U, {RL78::XOR1_cy_sfr, {0x4FU, SBP::sfr}, {OPT::sfr,OPT::imm4}}},
    // XOR1 CY,sfr.5
    {0x71U, {RL78::XOR1_cy_sfr, {0x5FU, SBP::sfr}, {OPT::sfr,OPT::imm5}}},
    // XOR1 CY,sfr.6
    {0x71U, {RL78::XOR1_cy_sfr, {0x6FU, SBP::sfr}, {OPT::sfr,OPT::imm6}}},
    // XOR1 CY,sfr.7
    {0x71U, {RL78::XOR1_cy_sfr, {0x7FU, SBP::sfr}, {OPT::sfr,OPT::imm7}}},
    // clang-format on
};

static std::map<int64_t, int64_t> calltOpcodeToAddr{

    {0x84, 0x0080}, {0x94, 0x0082}, {0xa4, 0x0084}, {0xb4, 0x0086},
    {0xc4, 0x0088}, {0xd4, 0x008a}, {0xe4, 0x008c}, {0xf4, 0x008e},
    {0x85, 0x0090}, {0x95, 0x0092}, {0xa5, 0x0094}, {0xb5, 0x0096},
    {0xc5, 0x0098}, {0xd5, 0x009a}, {0xe5, 0x009c}, {0xf5, 0x009e},
    {0x86, 0x00a0}, {0x96, 0x00a2}, {0xa6, 0x00a4}, {0xb6, 0x00a6},
    {0xc6, 0x00a8}, {0xd6, 0x00aa}, {0xe6, 0x00ac}, {0xf6, 0x00ae},
    {0x87, 0x00b0}, {0x97, 0x00b2}, {0xa7, 0x00b4}, {0xb7, 0x00b6},
    {0xc7, 0x00b8}, {0xd7, 0x00ba}, {0xe7, 0x00bc}, {0xf7, 0x00be},

};

static size_t findPartIndex(InstructionInfo info, unsigned int sbp) {
  size_t byteIndex = 0;
  for (size_t i = 0, e = info.BitParts.size(); i != e; ++i) {
    if (info.BitParts[i] == sbp) {
      byteIndex = i + 1;
      break;
    }
  }

  assert(byteIndex && "Requested sbp was not present in the instruction info");
  return byteIndex;
}

static unsigned char extract8bitValue(ArrayRef<uint8_t> Bytes,
                                      InstructionInfo info, unsigned int sbp) {
  size_t byteIndex = findPartIndex(info, sbp);
  return Bytes[byteIndex];
}

static unsigned int extract16bitValue(ArrayRef<uint8_t> Bytes,
                                      InstructionInfo info, unsigned int sbp_h,
                                      unsigned int sbp_l) {
  size_t hi_Index = findPartIndex(info, sbp_h);
  size_t lo_Index = findPartIndex(info, sbp_l);
  return Bytes[hi_Index] << 8 | Bytes[lo_Index];
}

static unsigned int extract20bitValue(ArrayRef<uint8_t> Bytes,
                                      InstructionInfo info, unsigned int sbp_h,
                                      unsigned int sbp_md, unsigned int sbp_l) {
  size_t hi_Index = findPartIndex(info, sbp_h);
  size_t md_Index = findPartIndex(info, sbp_md);
  size_t lo_Index = findPartIndex(info, sbp_l);
  return Bytes[hi_Index] << 16 | Bytes[md_Index] << 8 | Bytes[lo_Index];
}

static void decodeSADDR(MCInst &Instr, ArrayRef<uint8_t> Bytes,
                        InstructionInfo info,
                        std::map<unsigned char, unsigned int> lookup) {
  Instr.addOperand(
      MCOperand::createImm(extract8bitValue(Bytes, info, SBP::saddr)));
}

static void handleOperand(uint64_t Address, MCInst &Instr,
                          ArrayRef<uint8_t> Bytes, InstructionInfo info,
                          unsigned int operand, const RL78Disassembler *Dis) {
  switch (operand) {
  case OPT::ES_I_addr16:
    Instr.addOperand(MCOperand::createReg(RL78::ES));
    Instr.addOperand(MCOperand::createImm(
        extract16bitValue(Bytes, info, SBP::adrh, SBP::adrl)));
    break;
  case OPT::ES_memDE:
    Instr.addOperand(MCOperand::createReg(RL78::ES));
    Instr.addOperand(MCOperand::createReg(RL78::RP4));
    Instr.addOperand(MCOperand::createImm(0));
    break;
  case OPT::ES_memDE_byte:
    Instr.addOperand(MCOperand::createReg(RL78::ES));
    Instr.addOperand(MCOperand::createReg(RL78::RP4));
    Instr.addOperand(
        MCOperand::createImm(extract8bitValue(Bytes, info, SBP::adr)));
    break;
  case OPT::ES_memHL:
    Instr.addOperand(MCOperand::createReg(RL78::ES));
    Instr.addOperand(MCOperand::createReg(RL78::RP6));
    break;
  case OPT::ES_memHL0:
    Instr.addOperand(MCOperand::createReg(RL78::ES));
    Instr.addOperand(MCOperand::createReg(RL78::RP6));
    Instr.addOperand(MCOperand::createImm(0));
    break;
  case OPT::ES_memHL_B:
    Instr.addOperand(MCOperand::createReg(RL78::ES));
    Instr.addOperand(MCOperand::createReg(RL78::RP6));
    Instr.addOperand(MCOperand::createReg(RL78::R3));
    break;
  case OPT::ES_memHL_C:
    Instr.addOperand(MCOperand::createReg(RL78::ES));
    Instr.addOperand(MCOperand::createReg(RL78::RP6));
    Instr.addOperand(MCOperand::createReg(RL78::R2));
    break;
  case OPT::ES_memHL_byte:
    Instr.addOperand(MCOperand::createReg(RL78::ES));
    Instr.addOperand(MCOperand::createReg(RL78::RP6));
    Instr.addOperand(
        MCOperand::createImm(extract8bitValue(Bytes, info, SBP::adr)));
    break;
  case OPT::ES_word_memB:
    Instr.addOperand(MCOperand::createReg(RL78::ES));
    Instr.addOperand(MCOperand::createReg(RL78::R3));
    Instr.addOperand(MCOperand::createImm(
        extract16bitValue(Bytes, info, SBP::adrh, SBP::adrl)));
    break;
  case OPT::ES_word_memBC:
    Instr.addOperand(MCOperand::createReg(RL78::ES));
    Instr.addOperand(MCOperand::createReg(RL78::RP2));
    Instr.addOperand(MCOperand::createImm(
        extract16bitValue(Bytes, info, SBP::adrh, SBP::adrl)));
    break;
  case OPT::ES_word_memC:
    Instr.addOperand(MCOperand::createReg(RL78::ES));
    Instr.addOperand(MCOperand::createReg(RL78::R2));
    Instr.addOperand(MCOperand::createImm(
        extract16bitValue(Bytes, info, SBP::adrh, SBP::adrl)));
    break;
  case OPT::II_addr20: {
    unsigned int addr20 =
        extract20bitValue(Bytes, info, SBP::adrs, SBP::adrh, SBP::adrl);
    if (!Dis->tryAddingSymbolicOperand(Instr, addr20, 0, true,
                                       /* Offset */ 0, 3)) {
      Instr.addOperand(MCOperand::createImm(addr20));
    }
  } break;
  case OPT::I_addr16: {
    unsigned int addr16 = extract16bitValue(Bytes, info, SBP::adrh, SBP::adrl);

    switch (Instr.getOpcode()) {
    case RL78::BR_addr16:
    case RL78::CALL_addr16:
      break;
    default:
      addr16 += 0xf0000;
    }

    if (!Dis->tryAddingSymbolicOperand(Instr, addr16, Address, false,
                                       /* Offset */ 0, 3))
      Instr.addOperand(MCOperand::createImm(addr16));

