ksekimoto/llvm-project/llvm/lib/Target/RL78/Disassembler/RL78Disassembler.cpp
  } break;
  case OPT::RB0:
    Instr.addOperand(MCOperand::createImm(0));
    break;
  case OPT::RB1:
    Instr.addOperand(MCOperand::createImm(1));
    break;
  case OPT::RB2:
    Instr.addOperand(MCOperand::createImm(2));
    break;
  case OPT::RB3:
    Instr.addOperand(MCOperand::createImm(3));
    break;
  case OPT::SI_addr20: {
    signed int jdsp16 = extract16bitValue(Bytes, info, SBP::adrh, SBP::adrl);
    if (!Dis->tryAddingSymbolicOperand(
            Instr, jdsp16 + Address + info.BitParts.size() + 1, Address, true,
            /* Offset */ 0, 3))
      Instr.addOperand(MCOperand::createImm(jdsp16));

  } break;
  case OPT::S_addr20: {
    signed char jdsp8 = extract8bitValue(Bytes, info, SBP::adr);
    if (!Dis->tryAddingSymbolicOperand(
            Instr, jdsp8 + Address + info.BitParts.size() + 1, Address, true,
            /* Offset */ 0, 3))
      Instr.addOperand(MCOperand::createImm(jdsp8));
  } break;
  case OPT::byte:
    Instr.addOperand(
        MCOperand::createImm(extract8bitValue(Bytes, info, SBP::data)));
    break;
  case OPT::imm0:
    Instr.addOperand(MCOperand::createImm(0));
    break;
  case OPT::imm1:
    Instr.addOperand(MCOperand::createImm(1));
    break;
  case OPT::imm10:
    Instr.addOperand(MCOperand::createImm(10));
    break;
  case OPT::imm11:
    Instr.addOperand(MCOperand::createImm(11));
    break;
  case OPT::imm12:
    Instr.addOperand(MCOperand::createImm(12));
    break;
  case OPT::imm13:
    Instr.addOperand(MCOperand::createImm(13));
    break;
  case OPT::imm14:
    Instr.addOperand(MCOperand::createImm(14));
    break;
  case OPT::imm15:
    Instr.addOperand(MCOperand::createImm(15));
    break;
  case OPT::imm2:
    Instr.addOperand(MCOperand::createImm(2));
    break;
  case OPT::imm3:
    Instr.addOperand(MCOperand::createImm(3));
    break;
  case OPT::imm4:
    Instr.addOperand(MCOperand::createImm(4));
    break;
  case OPT::imm5:
    Instr.addOperand(MCOperand::createImm(5));
    break;
  case OPT::imm6:
    Instr.addOperand(MCOperand::createImm(6));
    break;
  case OPT::imm7:
    Instr.addOperand(MCOperand::createImm(7));
    break;
  case OPT::imm8:
    Instr.addOperand(MCOperand::createImm(8));
    break;
  case OPT::imm9:
    Instr.addOperand(MCOperand::createImm(9));
    break;
  case OPT::memDE:
    Instr.addOperand(MCOperand::createReg(RL78::RP4));
    Instr.addOperand(MCOperand::createImm(0));
    break;
  case OPT::memDE_byte:
    Instr.addOperand(MCOperand::createReg(RL78::RP4));
    Instr.addOperand(
        MCOperand::createImm(extract8bitValue(Bytes, info, SBP::adr)));
    break;
  case OPT::memHL:
    Instr.addOperand(MCOperand::createReg(RL78::RP6));
    break;
  case OPT::memHL0:
    Instr.addOperand(MCOperand::createReg(RL78::RP6));
    Instr.addOperand(MCOperand::createImm(0));
    break;
  case OPT::memHL_B:
    Instr.addOperand(MCOperand::createReg(RL78::RP6));
    Instr.addOperand(MCOperand::createReg(RL78::R3));
    break;
  case OPT::memHL_C:
    Instr.addOperand(MCOperand::createReg(RL78::RP6));
    Instr.addOperand(MCOperand::createReg(RL78::R2));
    break;
  case OPT::memHL_byte:
    Instr.addOperand(MCOperand::createReg(RL78::RP6));
    Instr.addOperand(
        MCOperand::createImm(extract8bitValue(Bytes, info, SBP::adr)));
    break;
  case OPT::memSP_byte:
    Instr.addOperand(MCOperand::createReg(RL78::SPreg));
    Instr.addOperand(
        MCOperand::createImm(extract8bitValue(Bytes, info, SBP::adr)));
    break;
  case OPT::mem_addr5:
    Instr.addOperand(MCOperand::createImm(
        calltOpcodeToAddr[extract8bitValue(Bytes, info, SBP::adr)]));
    break;
  case OPT::saddr:
    decodeSADDR(Instr, Bytes, info, saddrLookup);
    break;
  case OPT::saddrp:
    decodeSADDR(Instr, Bytes, info, saddrpLookup);
    break;
  case OPT::sfr:
    Instr.addOperand(
        MCOperand::createImm(extract8bitValue(Bytes, info, SBP::sfr)));
    break;
  case OPT::sfrp:
    Instr.addOperand(
        MCOperand::createImm(extract8bitValue(Bytes, info, SBP::sfr)));
    break;
  case OPT::word:
    Instr.addOperand(MCOperand::createImm(
        extract16bitValue(Bytes, info, SBP::datah, SBP::datal)));
    break;
  case OPT::word_memB:
    Instr.addOperand(MCOperand::createReg(RL78::R3));
    Instr.addOperand(MCOperand::createImm(
        extract16bitValue(Bytes, info, SBP::adrh, SBP::adrl)));
    break;
  case OPT::word_memBC:
    Instr.addOperand(MCOperand::createReg(RL78::RP2));
    Instr.addOperand(MCOperand::createImm(
        extract16bitValue(Bytes, info, SBP::adrh, SBP::adrl)));
    break;
  case OPT::word_memC:
    Instr.addOperand(MCOperand::createReg(RL78::R2));
    Instr.addOperand(MCOperand::createImm(
        extract16bitValue(Bytes, info, SBP::adrh, SBP::adrl)));
    break;
  case RL78::CS:
  case RL78::CY:
  case RL78::ES:
  case RL78::PSW:
  case RL78::R0:
  case RL78::R1:
  case RL78::R2:
  case RL78::R3:
  case RL78::R4:
  case RL78::R5:
  case RL78::R6:
  case RL78::R7:
  case RL78::RP0:
  case RL78::RP2:
  case RL78::RP4:
  case RL78::RP6:
  case RL78::SPreg:
    Instr.addOperand(MCOperand::createReg(operand));
    break;
  case OPT::RL78CC_C:
  case OPT::RL78CC_NC:
  case OPT::RL78CC_Z:
  case OPT::RL78CC_NZ:
  case OPT::RL78CC_H:
  case OPT::RL78CC_NH:
    Instr.addOperand(MCOperand::createImm(operand & 0xFF));
    break;
  default:
    llvm_unreachable("Operand not implemented");
  }
}

static DecodeStatus handleMatch(uint64_t Address, InstructionInfo Match,
                                MCInst &Instr, uint64_t &Size,
                                ArrayRef<uint8_t> Bytes,
                                const RL78Disassembler *Dis) {
  Size = Match.BitParts.size() + 1;
  Instr.setOpcode(Match.OpCode);
  for (unsigned int op : Match.Operands)
    handleOperand(Address, Instr, Bytes, Match, op, Dis);
  return MCDisassembler::Success;
}
static bool instructionsMergedS3core = false;
DecodeStatus RL78Disassembler::getInstruction(MCInst &Instr, uint64_t &Size,
                                              ArrayRef<uint8_t> Bytes,
                                              uint64_t Address,
                                              raw_ostream &CStream) const {

  if (STI.getCPU() == "RL78_S3" && !instructionsMergedS3core) {
    instructions.insert(instructionsS3.begin(), instructionsS3.end());
    instructionsMergedS3core = true;
  }

  if (Bytes.size() < 1) {
    Size = 0;
    return MCDisassembler::Fail;
  }
  auto matchCount = instructions.count(Bytes[0]);
  if (matchCount == 1) {
    return handleMatch(Address, instructions.find(Bytes[0])->second, Instr,
                       Size, Bytes, this);
  } else if (matchCount > 1 && Bytes.size() >= 2) {
    // find an exact match by trying to match additional bytes
    std::pair<std::multimap<unsigned int, InstructionInfo>::iterator,
              std::multimap<unsigned int, InstructionInfo>::iterator>
        matchIterator = instructions.equal_range(Bytes[0]);

    std::vector<InstructionInfo> matches;
    for (auto match = matchIterator.first, e = matchIterator.second; match != e;
         ++match)
      matches.push_back(match->second);

