ksekimoto/llvm-project/llvm/lib/Target/RL78/Disassembler/RL78Disassembler.cpp
    unsigned char byteIndex = 0;
    do {

      std::vector<InstructionInfo> exactMatches;
      std::vector<InstructionInfo> coverMatches;
      for (InstructionInfo match : matches) {
        if (match.BitParts.size() > byteIndex &&
            Bytes[byteIndex + 1] == match.BitParts[byteIndex]) {
          exactMatches.push_back(match);
        }
        if (match.BitParts.size() > byteIndex &&
            match.BitParts[byteIndex] >= SBP::adr) {
          coverMatches.push_back(match);
        }
      }
      byteIndex++;

      if (exactMatches.size() == 1)
        matches = exactMatches;
      else if (exactMatches.size() > 1 && coverMatches.size() > 0) {
        matches = exactMatches;
        matches.insert(matches.end(), coverMatches.begin(), coverMatches.end());
      } else
        matches = exactMatches.size() ? exactMatches : coverMatches;

    } while (matches.size() != 1 && byteIndex != 4 &&
             byteIndex + 1U < Bytes.size());
    if (matches.size() == 1)
      return handleMatch(Address, matches[0], Instr, Size, Bytes, this);
  }
  // handle special case of the PREFIX instr
  if (Bytes[0] == 0x11) {
    for (std::multimap<unsigned int, InstructionInfo>::iterator
             it = instructions.begin(),
             e = instructions.end();
         it != e; ++it)
      if (it->second.OpCode == RL78::PREFIX)
        return handleMatch(Address, it->second, Instr, Size, Bytes, this);
  }

  Size = 0;
  return MCDisassembler::Fail;
}

// Try to find symbol name for specified label
bool RL78Symbolizer::tryAddingSymbolicOperand(
    MCInst &Inst, raw_ostream & /*cStream*/, int64_t Value,
    uint64_t /*Address*/, bool IsBranch, uint64_t /*Offset*/,
    uint64_t /*InstSize*/) {
  using SymbolInfoTy = std::tuple<uint64_t, StringRef, uint8_t>;
  using SectionSymbolsTy = std::vector<SymbolInfoTy>;

  auto *AllSymbols =
      static_cast<std::map<object::SectionRef, SectionSymbolsTy> *>(DisInfo);
  if (!AllSymbols)
    return false;

  StringRef matchedSymbol = "";
  uint64_t startSymbolAddress = 0;

  if (IsBranch) {
    for (std::pair<const object::SectionRef, SectionSymbolsTy> &SecSyms :
         *AllSymbols)
      if (SecSyms.first.isText() &&
          SecSyms.first.getAddress() <= static_cast<uint64_t>(Value) &&
          SecSyms.first.getSize() + SecSyms.first.getAddress() >=
              static_cast<uint64_t>(Value))
        for (SymbolInfoTy &symbol : SecSyms.second)
          if (std::get<0>(symbol) <= static_cast<uint64_t>(Value)) {
            matchedSymbol = std::get<1>(symbol);
            startSymbolAddress = std::get<0>(symbol);
          } else
            break;

  } else
    for (std::pair<const object::SectionRef, SectionSymbolsTy> &SecSyms :
         *AllSymbols)
      if (SecSyms.first.getAddress() <= static_cast<uint64_t>(Value) &&
          SecSyms.first.getSize() + SecSyms.first.getAddress() >=
              static_cast<uint64_t>(Value))
        for (SymbolInfoTy &symbol : SecSyms.second)
          // Assume that the symbols are ordered by address and take the
          // last symbol from a group of symbols having the same address
          if (std::get<0>(symbol) == static_cast<uint64_t>(Value))
            matchedSymbol = std::get<1>(symbol);

  if (matchedSymbol != "") {
    auto *Sym = Ctx.getOrCreateSymbol(matchedSymbol);
    const auto *SymExpr = MCSymbolRefExpr::create(Sym, Ctx);
    if (startSymbolAddress != 0 && startSymbolAddress != Value)
      Inst.addOperand(MCOperand::createExpr(MCBinaryExpr::createAdd(
          SymExpr, MCConstantExpr::create(Value - startSymbolAddress, Ctx),
          Ctx)));
    else
      Inst.addOperand(MCOperand::createExpr(SymExpr));
    return true;
  }
  return false;
}

void RL78Symbolizer::tryAddingPcLoadReferenceComment(raw_ostream &cStream,
                                                     int64_t Value,
                                                     uint64_t Address) {
  llvm_unreachable("unimplemented");
}
